{
  "hospital_name": "AIIMS",
  "reviews": [
    {
      "source": "MouthShut",
      "hospital": "AIIMS",
      "review": "There are a lot of amenities and facilities that Aiims Hospital, Madurai gives its patients which are speciality units, ICU's, diagnostic rooms, surgery rooms and treatment rooms so no matter what you are suffering from, you will get a solution here."
    },
    {
      "source": "MouthShut",
      "hospital": "AIIMS",
      "review": "The expertise of the doctor at Aiims Hospital, Madurai was the main reason that I choose to go with Aiims Hospital, Madurai and I was not disappointed at all."
    },
    {
      "source": "MouthShut",
      "hospital": "AIIMS",
      "review": "Aiims Hospital, Madurai has cutting edge technology and the skills of the doctors are also too good here."
    },
    {
      "source": "MouthShut",
      "hospital": "AIIMS",
      "review": "This hospital provides for 24 hour security and that is really good because I had to stay in the hospital for a night and since I am living alone in the city, I had no one who could stay with me and for better recovery I needed to sleep, but they assured me that they have good security which consists of a team of females as well and I do not need to worry."
    },
    {
      "source": "MouthShut",
      "hospital": "AIIMS",
      "review": "All the doctors at this hospital have good years of experience so you can definitely trust them without fear."
    },
    {
      "source": "MouthShut",
      "hospital": "AIIMS",
      "review": "Aiims Hospital, Madurai ensures that you get the highest quality of care and it has top-notch facilities and amenities."
    },
    {
      "source": "MouthShut",
      "hospital": "AIIMS",
      "review": "The staff at Aiims Hospital, Madurai really helped me quite a lot. They helped me get to the toilet and do my exercises that I was recommended and they were invested in me getting alright like I was a part of thier family."
    },
    {
      "source": "MouthShut",
      "hospital": "AIIMS",
      "review": "This hospital has doctors who are committed to taking care of the health realted problems of the patients and they go way beyond thier means to give you good services."
    },
    {
      "source": "MouthShut",
      "hospital": "AIIMS",
      "review": "This hospital has doctors that are internationally renowed, yet they do not charge a bomb for the rooms and the service."
    },
    {
      "source": "MouthShut",
      "hospital": "AIIMS",
      "review": "This hospital gives you excellent treatment because the doctors and the staff are simply too good."
    },
    {
      "source": "MouthShut",
      "hospital": "AIIMS",
      "review": "The infrastructure at this hospital is simply uncomparable by any other hospital and the charges for the room is also not that high."
    },
    {
      "source": "MouthShut",
      "hospital": "AIIMS",
      "review": "The co-ordination of the staff at this hospital is really good and they inform each other about what medicines they have to give the patient and take really good care of the patient."
    },
    {
      "source": "MouthShut",
      "hospital": "AIIMS",
      "review": "Aiims Hospital, Madurai provides super speciality services so no matter what you are suffering from, they have got you covered."
    },
    {
      "source": "MouthShut",
      "hospital": "AIIMS",
      "review": "The staff are really helpful and will do everything on time and help you with each little thing the moment you call them. It is a good hospital."
    },
    {
      "source": "MouthShut",
      "hospital": "AIIMS",
      "review": "The doctors at Aiims Hospital, Madurai really care about thier patients. The doctor came twice to check me for my recovery and I was very happy with the staff at this place."
    },
    {
      "source": "MouthShut",
      "hospital": "AIIMS",
      "review": "Aiims Hospital, Madurai is fully supported with the best technology, amenities and facilities so you do not have to worry at all."
    },
    {
      "source": "MouthShut",
      "hospital": "AIIMS",
      "review": "My sister was in the critical care unit and the doctors and staff took really good care of her. The critical care units are fully equipped as well."
    },
    {
      "source": "MouthShut",
      "hospital": "AIIMS",
      "review": "Aiims Hospital, Madurai has doctors that are internationally renowed, yet they do not charge a bomb for the rooms and the service."
    },
    {
      "source": "MouthShut",
      "hospital": "AIIMS",
      "review": "The doctors at this hospital really care about thier patients. The doctor came twice to check me for my recovery and I was very happy with the staff at this place."
    },
    {
      "source": "MouthShut",
      "hospital": "AIIMS",
      "review": "The operations team at Aiims Hospital, Madurai is great and they did my surgery so well, I feel fine now and they also gave me amazing tips to take care of my health, given my condition."
    },
    {
      "source": "MouthShut",
      "hospital": "AIIMS",
      "review": "The doctors at Aiims Hospital, Madurai examine your case from all angles and do not just rush you into surgery.They will even recommend alternative medicine if required."
    },
    {
      "source": "MouthShut",
      "hospital": "AIIMS",
      "review": "Aiims Hospital, Madurai is backed by cutting edge medical technology and services and it is one of the best places to do surgery at."
    },
    {
      "source": "MouthShut",
      "hospital": "AIIMS",
      "review": "This hospital takes care of thier patients in the best possible way. Everyone from the doctors to the staff are very concerned and are invested in every patient."
    },
    {
      "source": "MouthShut",
      "hospital": "AIIMS",
      "review": "Aiims Hospital, Madurai is one of the best hospitals because once you do the surgery from here, you can stay assured that you will not face any problem again."
    },
    {
      "source": "MouthShut",
      "hospital": "AIIMS",
      "review": "Aiims Hospital, Madurai has good and experienced staff and lab technicians and they also have some of the best doctors. I am glad that I was admitted here."
    },
    {
      "source": "MouthShut",
      "hospital": "AIIMS",
      "review": "This hospital is fully supported with the best technology, amenities and facilities so you do not have to worry at all."
    },
    {
      "source": "MouthShut",
      "hospital": "AIIMS",
      "review": "This hospital has a very nice management and they will organize eveyrthing really well for you."
    },
    {
      "source": "MouthShut",
      "hospital": "AIIMS",
      "review": "This hopsital is a pioneer of innovation and they use the newest and innovative technologies to give thier patients the best results."
    },
    {
      "source": "MouthShut",
      "hospital": "AIIMS",
      "review": "We went to Aiims Hospital, Madurai after consulting a doctor from another hospital and this doctor gave us a safe and accurate diagnosis and told us not to go for surgery."
    },
    {
      "source": "MouthShut",
      "hospital": "AIIMS",
      "review": "The head doctor at Aiims Hospital, Madurai is very skilled and he has received many awards and given many speeches and does the surgery witn such precision. It is great to get your treatment done from him."
    },
    {
      "source": "MouthShut",
      "hospital": "AIIMS",
      "review": "Aiims Hospital, Madurai has a good team of doctors who will take care of all your needs brilliantly."
    },
    {
      "source": "MouthShut",
      "hospital": "AIIMS",
      "review": "Aiims Hospital, Madurai provides cashless service option if the health insurance providers that you have choosen are in thier list and they did took really good care of my daughter who was suffering from dengue."
    },
    {
      "source": "MouthShut",
      "hospital": "AIIMS",
      "review": "The doctors at this hospital are very sincere and they are very dedicated towards giving thier clients amazing results."
    },
    {
      "source": "MouthShut",
      "hospital": "AIIMS",
      "review": "This hospital is a multi-spaciality hospital and has doctors that have expertise in a wide range of health problems and will ensure that your health is restored."
    },
    {
      "source": "MouthShut",
      "hospital": "AIIMS",
      "review": "This hospital has 12 modular operation theatres with state of the art facility and they take good care of you."
    },
    {
      "source": "MouthShut",
      "hospital": "AIIMS",
      "review": "This hospital gives quality service at a really affordable rate. Their service includes ambulance services, blood bank services and a pharmacy."
    },
    {
      "source": "MouthShut",
      "hospital": "AIIMS",
      "review": "The infrastructure at Aiims Hospital, Madurai is great and the amenitiies and facilities are also amazing."
    },
    {
      "source": "MouthShut",
      "hospital": "AIIMS",
      "review": "This hospital has rooms that are eqipped with all the amenities to keep the patients comfortable and the doctors do agreat job."
    },
    {
      "source": "MouthShut",
      "hospital": "AIIMS",
      "review": "This hospital offers advanced treatment by following international medical standards and procedures."
    },
    {
      "source": "MouthShut",
      "hospital": "AIIMS",
      "review": "This hospital has doctors who gave me the best consultation even though it was not what other doctors would say. I was completely fine now because i followed thier advice."
    },
    {
      "source": "MouthShut",
      "hospital": "AIIMS",
      "review": "This hospital has experienced staff and state of the art technology and modern amenities."
    },
    {
      "source": "MouthShut",
      "hospital": "AIIMS",
      "review": "Aiims Hospital, Madurai has doctors who gave me the best consultation even though it was not what other doctors would say. I was completely fine now because i followed thier advice."
    },
    {
      "source": "MouthShut",
      "hospital": "AIIMS",
      "review": "Right from the admission to the treatment, everything went really smoothly at this place. The room service was also amazing."
    },
    {
      "source": "MouthShut",
      "hospital": "AIIMS",
      "review": "Aiims Hospital, Madurai provides a comprehensive range of healthcare services and each and every one of thier service is simply brilliant."
    },
    {
      "source": "MouthShut",
      "hospital": "AIIMS",
      "review": "Aiims Hospital, Madurai really takes care of the needs of thier patients. The diet of the patient is decided based on the therapeutic needs of the patient."
    },
    {
      "source": "MouthShut",
      "hospital": "AIIMS",
      "review": "Aiims Hospital, Madurai has a lot of amenities like laboratory, pharmacy, a dialysis center and cath lab and much more which sees to it that the needs of the patients are meet, no matter what surgery they have come for."
    },
    {
      "source": "MouthShut",
      "hospital": "AIIMS",
      "review": "This hospital really takes care of the needs of thier patients. The diet of the patient is decided based on the therapeutic needs of the patient."
    },
    {
      "source": "MouthShut",
      "hospital": "AIIMS",
      "review": "This hospital has a 24 hour emergency and critical care that is supported by a fully equipped pathology lab, emergency and critical care, radiology and pharmacy."
    },
    {
      "source": "MouthShut",
      "hospital": "AIIMS",
      "review": "Aiims Hospital, Madurai offers advanced treatment by following international medical standards and procedures."
    },
    {
      "source": "MouthShut",
      "hospital": "AIIMS",
      "review": "This hospital has all the infrastructure that is needed for a good surgery. I was very happy with the treatment that I got at this place."
    },
    {
      "source": "MouthShut",
      "hospital": "AIIMS",
      "review": "This hopsital has 29 specialized medical facilities and all of them are well-equipped and have the best technology. They also have the best doctors who can make use of the technology."
    },
    {
      "source": "MouthShut",
      "hospital": "AIIMS",
      "review": "Aiims Hospital, Madurai has a 24 hour emergency and critical care that is supported by a fully equipped pathology lab, emergency and critical care, radiology and pharmacy."
    },
    {
      "source": "MouthShut",
      "hospital": "AIIMS",
      "review": "This hospital has amazing staff who will check on you at regular intervals and ensure that you are well taken care off."
    },
    {
      "source": "MouthShut",
      "hospital": "AIIMS",
      "review": "Aiims Hospital, Madurai is a NABH accredited hopsital and it has a very peaceful and calm environment that is filled with skilled and well-trained doctors."
    },
    {
      "source": "MouthShut",
      "hospital": "AIIMS",
      "review": "Everyone in Aiims Hospital, Madurai from the staff to the maid is great and they know how to treat thier patients well."
    },
    {
      "source": "MouthShut",
      "hospital": "AIIMS",
      "review": "This hospital has a pharmacy in the hospital which charges much less for medicines compared to if you buy medicines from outside."
    },
    {
      "source": "MouthShut",
      "hospital": "AIIMS",
      "review": "This hospital has all the emergency equipment that is needed in the ICU and they analyze the reports really well and give a proper diagnosis."
    },
    {
      "source": "MouthShut",
      "hospital": "AIIMS",
      "review": "This hospital has tailor-made packages for surgery to suit every economic classes needs, so you need not worry about the cost of treatment."
    },
    {
      "source": "MouthShut",
      "hospital": "AIIMS",
      "review": "This hospital hires really talented doctors with over 27 years of experience so you know that you are in safe hands."
    },
    {
      "source": "MouthShut",
      "hospital": "AIIMS",
      "review": "Aiims Hospital, Madurai is one of the oldest hospitals and they have the best doctors, technicians and paramedics who take amazing care of you."
    },
    {
      "source": "MouthShut",
      "hospital": "AIIMS",
      "review": "Aiims Hospital, Madurai has some really experienced and well-qualified doctors so you can trust them with your life because thier success rate for surgery is really high."
    },
    {
      "source": "MouthShut",
      "hospital": "AIIMS",
      "review": "This hospital ensures that you get the highest quality of care and it has top-notch facilities and amenities."
    },
    {
      "source": "MouthShut",
      "hospital": "AIIMS",
      "review": "The process of getting admitted at Aiims Hospital, Madurai was hassel-free and they took really good care of me which was amazing."
    },
    {
      "source": "MouthShut",
      "hospital": "AIIMS",
      "review": "Aiims Hospital, Madurai has skilled medical doctors, 2 high-end operation theatres that are filled with the latest equipment and the staff is also amazing."
    },
    {
      "source": "MouthShut",
      "hospital": "AIIMS",
      "review": "This hospital has doctors who do the surgery using latest technologies and ensure that you will not have any pain."
    },
    {
      "source": "MouthShut",
      "hospital": "AIIMS",
      "review": "This hospital is backed by cutting edge medical technology and services and it is one of the best places to do surgery at."
    },
    {
      "source": "MouthShut",
      "hospital": "AIIMS",
      "review": "This hospital is really safe and secure. I stayed at this hospital for a night and everything was well taken care off for me."
    },
    {
      "source": "MouthShut",
      "hospital": "AIIMS",
      "review": "The intensive care unit at Aiims Hospital, Madurai has a state of the art intensive care unit for adults and kids and my child was well taken care off and she is fully fine now."
    },
    {
      "source": "MouthShut",
      "hospital": "AIIMS",
      "review": "Aiims Hospital, Madurai follows meticulous standards of excellence and they have the best infrastructure and equipments."
    },
    {
      "source": "MouthShut",
      "hospital": "AIIMS",
      "review": "The doctors at Aiims Hospital, Madurai have a lot of expertise in thier field and the fees that they charge for surgery is also not that much."
    },
    {
      "source": "MouthShut",
      "hospital": "AIIMS",
      "review": "Aiims Hospital, Madurai hires really talented doctors with over 27 years of experience so you know that you are in safe hands."
    },
    {
      "source": "MouthShut",
      "hospital": "AIIMS",
      "review": "This hospital has some great doctors who are not only well-qualified but also are really invested in the health of thier patients."
    },
    {
      "source": "MouthShut",
      "hospital": "AIIMS",
      "review": "Aiims Hospital, Madurai is known for its emergency medical services and they also have a cardiac and trauma ambulance."
    },
    {
      "source": "MouthShut",
      "hospital": "AIIMS",
      "review": "Aiims Hospital, Madurai uses international standards as thier benchmark for medical, nursing and operating protocols and they are the best at thier job."
    },
    {
      "source": "MouthShut",
      "hospital": "AIIMS",
      "review": "Aiims Hospital, Madurai is one of the best hopsitals because the doctors who work here have an experience of atleast a decade."
    },
    {
      "source": "MouthShut",
      "hospital": "AIIMS",
      "review": "Aiims Hospital, Madurai gives the patients good and healthy food on time and everything from a pharmacy to an ATM is available within the hospital."
    },
    {
      "source": "MouthShut",
      "hospital": "AIIMS",
      "review": "Aiims Hospital, Madurai has state of the art technology and amenities which ensures that your surgery will be done with accuracy."
    },
    {
      "source": "MouthShut",
      "hospital": "AIIMS",
      "review": "Aiims Hospital, Madurai has all the infrastructure that is needed for a good surgery. I was very happy with the treatment that I got at this place."
    },
    {
      "source": "MouthShut",
      "hospital": "AIIMS",
      "review": "This hopsital has good and experienced staff and lab technicians and they also have some of the best doctors. I am glad that I was admitted here."
    },
    {
      "source": "MouthShut",
      "hospital": "AIIMS",
      "review": "Aiims Hospital, Madurai has a very well-trained team who takes care of all your needs and does a great job at supporting your pre-operative and post-operative surgery needs."
    },
    {
      "source": "MouthShut",
      "hospital": "AIIMS",
      "review": "The doctor at this hopsital is one of the best doctors that I have come across. They are not money-minded and are very kind unlike doctors at other places."
    },
    {
      "source": "MouthShut",
      "hospital": "AIIMS",
      "review": "This hospital provides a comprehensive range of healthcare services and each and every one of thier service is simply brilliant."
    },
    {
      "source": "MouthShut",
      "hospital": "AIIMS",
      "review": "Aiims Hospital, Madurai has tailor-made packages for surgery to suit every economic classes needs, so you need not worry about the cost of treatment."
    },
    {
      "source": "MouthShut",
      "hospital": "AIIMS",
      "review": "There are a lot of amenities and facilities that this hopsital gives its patients which are speciality units, ICU's, diagnostic rooms, surgery rooms and treatment rooms so no matter what you are suffering from, you will get a solution here."
    },
    {
      "source": "MouthShut",
      "hospital": "AIIMS",
      "review": "The doctors at Aiims Hospital, Madurai are very professional and they have expertise in thier field so there is no need to worry at all."
    },
    {
      "source": "MouthShut",
      "hospital": "AIIMS",
      "review": "This hospital has an in-house thrid party assistance desk that assists you with the process of your mediclaim really well."
    },
    {
      "source": "MouthShut",
      "hospital": "AIIMS",
      "review": "The management at Aiims Hospital, Madurai is great. They co-ordinated with my health insurance company and got it done quickly."
    },
    {
      "source": "MouthShut",
      "hospital": "AIIMS",
      "review": "The care and treatment that I received at this hospital helped me recover really fast so I am happy with the service."
    },
    {
      "source": "MouthShut",
      "hospital": "AIIMS",
      "review": "This hospital has a doctor who engages you in a conversation and tries to take your mind off the pain and he has trained the staff to do so as well."
    },
    {
      "source": "MouthShut",
      "hospital": "AIIMS",
      "review": "Aiims Hospital, Madurai has rooms that are eqipped with all the amenities to keep the patients comfortable and the doctors do agreat job."
    },
    {
      "source": "MouthShut",
      "hospital": "AIIMS",
      "review": "Aiims Hospital, Madurai has surgeons with a lot of years of experience and they do the surgery with extreme care and attention to detail."
    },
    {
      "source": "MouthShut",
      "hospital": "AIIMS",
      "review": "This hospital follows meticulous standards of excellence and they have the best infrastructure and equipments."
    },
    {
      "source": "JustDial",
      "hospital": "AIIMS",
      "location": "All India Institute Of Medical Sciences",
      "review": "Everything is fine but behaviour of the staff other than Doctors are very very poor. These people not even want to talk for a fraction of a second. This type of behaviour hurts all the patient who come from fsr flank areas of India. I would like to to request the Management to look into the matter & give them proper training on this issue."
    },
    {
      "source": "JustDial",
      "hospital": "AIIMS",
      "location": "All India Institute Of Medical Sciences",
      "review": "This hospital is really bullshit nurses and so called guard misbehave to every patient, people who come for treatment this is really nonchalant behaviour I`m gonna complaint a file against this hospital I have seen all the guards eat food during work hours. Rai Bareli` s aims hospital is terrible you guys need to improve you service or else I`ll surely talk to prime minister"
    },
    {
      "source": "JustDial",
      "hospital": "AIIMS",
      "location": "All India Institute Of Medical Sciences",
      "review": "I went to All India Institute Of Medical Sciences for treatment. It was terrible. The doctors did not help me well. My health did not get better. I felt very upset. The staff were not friendly and did not listen to me. I waited a long time for help, but it was no good. I do not recommend this hospital to anyone.  ENT Vibhag IS VERY BAD And dental Vibhag is very bad"
    },
    {
      "source": "JustDial",
      "hospital": "AIIMS",
      "location": "All India Institute Of Medical Sciences",
      "review": "One of the lady security guard (Madhuri  devi)She don`t have manners how to speak she speak like a jailer not ready to understand is she hire to scold to people she should understand the situation with"
    },
    {
      "source": "JustDial",
      "hospital": "AIIMS",
      "location": "All India Institute Of Medical Sciences",
      "review": "I had a very bad experience at All India Institute Of Medical Sciences. The staff was unhelpful, and I waited a long time to see the doctor. The place was messy and noisy. It felt very poorly managed. I expected good care, but I left feeling disappointed and frustrated. I do not recommend this hospital at all!"
    },
    {
      "source": "JustDial",
      "hospital": "AIIMS",
      "location": "All India Institute Of Medical Sciences",
      "review": "I had a terrible experience at All India Institute Of Medical Sciences. The staff there was completely ignorant and showed no empathy towards patients. They seemed overwhelmed and uninterested, making it difficult to get any proper guidance or help. It felt like I was just another number rather than a patient in need of care. Such a disappointing visit!"
    },
    {
      "source": "JustDial",
      "hospital": "AIIMS",
      "location": "All India Institute Of Medical Sciences",
      "review": "Worst, experience When I had an accident in ambernath my parents gone to Dombivli Aiims and this worst hospital told that doctor is not available. Person is type of do or die condition then also not they told doctor is not available 😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡"
    },
    {
      "source": "JustDial",
      "hospital": "AIIMS",
      "location": "All India Institute Of Medical Sciences",
      "review": "Unfortunately, I had a disturbing experience witnessing the guards were bothering a woman who was simply trying to retrieve her job card they also ask for bribe. Their behaviour was completely unacceptable and unprofessional. It`s concerning that individuals in positions of authority would treat someone in such disrespectful manner. This incident reflects poorly on the establishment and raises questions about their commitment to customer service and basic human decency. I would say you to replace SIS guar..."
    },
    {
      "source": "JustDial",
      "hospital": "AIIMS",
      "location": "All India Institute Of Medical Sciences",
      "review": "There is proper communication by staff,security gaurds are very rude and mannerless...they don`t know how to talk to people. There is only consultant are good otherwise all staff are waste."
    },
    {
      "source": "JustDial",
      "hospital": "AIIMS",
      "location": "All India Institute Of Medical Sciences",
      "review": "CTVS department me Dr mayank Yadav se dur rahe. Fraud dr hai ishko jo surgery nahi bhi ata hai wo bhi case le leta hai, mere bete ka arterial switch operation success nahi kar paya aur uski jan chli gyi. Bad me pata chal ishka trial case tha."
    }
  ],
  "review_count": 102,
  "news": [
    {
      "source": "Brave News",
      "hospital": "AIIMS",
      "headline": "Delhi AIIMS में पेशेंट केयर भत्ता मामले में सुप्रीम कोर्ट ने संस्थान से मांगा जवाब, ये है मामला | In Delhi AIIMS, now only these people will receive the patient care allowance"
    },
    {
      "source": "Brave News",
      "hospital": "AIIMS",
      "headline": "AIIMS Delhi Bags Top National Award For Overall Excellence At DHR-ICMR Summit 2025"
    },
    {
      "source": "Brave News",
      "hospital": "AIIMS",
      "headline": "AIIMS honoured with top rank for overall performance at summit - The Tribune"
    },
    {
      "source": "Brave News",
      "hospital": "AIIMS",
      "headline": "AIIMS Delhi bags top national rank for institutional excellence"
    },
    {
      "source": "Brave News",
      "hospital": "AIIMS",
      "headline": "Delhi Aiims,दिल्ली AIIMS में डॉक्टर और प्रशासन में तनातनी, 'दखल' से बिगड़ा माहौल, फैकल्टी में बढ़ी नाराजगी - tension between doctors and administration at delhi aiims growing resentment among faculty - Navbharat Times"
    },
    {
      "source": "Brave News",
      "hospital": "AIIMS",
      "headline": "Union Health Minister JP Nadda addresses 50th convocation of AIIMS New Delhi"
    },
    {
      "source": "Brave News",
      "hospital": "AIIMS",
      "headline": "Delhi: AIIMS revamp plan for better patient care gets a fresh push | Delhi News - Times of India"
    },
    {
      "source": "Brave News",
      "hospital": "AIIMS",
      "headline": "List of AIIMS Colleges in India: Rank Wise, Courses, Admissions, and Eligibility - GeeksforGeeks"
    },
    {
      "source": "Brave News",
      "hospital": "AIIMS",
      "headline": "AIIMS Delhi launches new portal for patient redressal, to instal AI-enabled CCTV cameras | Delhi News - The Indian Express"
    },
    {
      "source": "Brave News",
      "hospital": "AIIMS",
      "headline": "Come after 2 years, AIIMS Delhi tells heart patient who needed surgery - India Today"
    },
    {
      "source": "Brave News",
      "hospital": "AIIMS",
      "headline": "Aiims Delhi addresses video posted by Rahul Gandhi on patient plight | India News - Business Standard"
    },
    {
      "source": "Brave News",
      "hospital": "AIIMS",
      "headline": "‘Delhi has reached an emergency’: AIIMS experts warn as toxic air triggers patient surge | Delhi News - The Times of India"
    },
    {
      "source": "Brave News",
      "hospital": "AIIMS",
      "headline": "AIIMS Delhi 2024-25 Courses, Fees, Admissions, Placements, Rankings"
    },
    {
      "source": "Brave News",
      "hospital": "AIIMS",
      "headline": "AIIMS Delhi Online Appointment- OPD Appointment Timings, Registration Process, Steps"
    },
    {
      "source": "Brave News",
      "hospital": "AIIMS",
      "headline": "Full Form of AIIMS"
    },
    {
      "source": "Brave News",
      "hospital": "AIIMS",
      "headline": "AIIMS Delhi Launches Grievance Redressal System & Expands Patient Care Services"
    },
    {
      "source": "Brave News",
      "hospital": "AIIMS",
      "headline": "Patient Care"
    },
    {
      "source": "Brave News",
      "hospital": "AIIMS",
      "headline": "Private wards at AIIMS Delhi: How much does it cost and who is eligible? - CNBC TV18"
    },
    {
      "source": "Brave News",
      "hospital": "AIIMS",
      "headline": "Patient education services"
    },
    {
      "source": "Brave News",
      "hospital": "AIIMS",
      "headline": "Introduction"
    },
    {
      "source": "Brave News",
      "hospital": "AIIMS",
      "headline": "AIIMS Delhi Reschedule OPD Appointment & Follow Up at www.ors.gov.in - AIIMSOPD.in"
    },
    {
      "source": "Brave News",
      "hospital": "AIIMS",
      "headline": "OUT PATIENT SERVICES"
    },
    {
      "source": "Brave News",
      "hospital": "AIIMS",
      "headline": "Patient Welfare Services"
    },
    {
      "source": "Brave News",
      "hospital": "AIIMS",
      "headline": "AIIMS OPD Registration Appointment Online Booking & Timing at ORS Patient Portal - AIIMS Registration"
    },
    {
      "source": "Brave News",
      "hospital": "AIIMS",
      "headline": "About Us"
    },
    {
      "source": "Brave News",
      "hospital": "AIIMS",
      "headline": "AIIMS Honoured With Top National Rank For Institutional Excellence - Daily Excelsior"
    },
    {
      "source": "Brave News",
      "hospital": "AIIMS",
      "headline": "List of AIIMS in India - MBBS| MD/MS| DM|MCh"
    },
    {
      "source": "Brave News",
      "hospital": "AIIMS",
      "headline": "AIIMS Delhi Doctors List 2025 (Department-wise) & Contact Number - AIIMS Appointments"
    },
    {
      "source": "Brave News",
      "hospital": "AIIMS",
      "headline": "Delhi Government Challenges Apollo Hospital Over EWS Patient Care | Health"
    },
    {
      "source": "Brave News",
      "hospital": "AIIMS",
      "headline": "Delhi High Court asks govt to look into AIIMS suggestion for Ayushman centres in hospitals | Delhi News - Times of India"
    },
    {
      "source": "Brave News",
      "hospital": "AIIMS",
      "headline": "AIIMS Delhi doctors told to use Hindi in prescriptions, sparks debate"
    },
    {
      "source": "Brave News",
      "hospital": "AIIMS",
      "headline": "AIIMS staff object to withdrawal of hospital patient care allowance for Group C, D employees"
    },
    {
      "source": "Brave News",
      "hospital": "AIIMS",
      "headline": "Union Minister J.P. Nadda launches 'Inter-AIIMS Referral Portal' for seamless patient care - The Hindu"
    },
    {
      "source": "Brave News",
      "hospital": "AIIMS",
      "headline": "AIIMS New Delhi: The Pinnacle of Medical Education in India - Career Plan B"
    },
    {
      "source": "Brave News",
      "hospital": "AIIMS",
      "headline": "Controversy erupts after AIIMS New Delhi X ray report generated by 'AI Radiologist' goes viral"
    },
    {
      "source": "Brave News",
      "hospital": "AIIMS",
      "headline": "AIIMS Sexual Harassment Row: Nurses demand protection for complainant"
    },
    {
      "source": "Brave News",
      "hospital": "AIIMS",
      "headline": "From one to 23: AIIMS expansion reflects India’s healthcare commitment"
    },
    {
      "source": "Brave News",
      "hospital": "AIIMS",
      "headline": "GENERAL INFORMATION ABOUT NURSING"
    },
    {
      "source": "Brave News",
      "hospital": "AIIMS",
      "headline": "aiims hospital new delhi : Latest News, Photos, Videos on aiims hospital new delhi by IBC24.in"
    },
    {
      "source": "Brave News",
      "hospital": "AIIMS",
      "headline": "AIIMS Delhi — India’s best medical college that's home to many leaders of Covid battle"
    },
    {
      "source": "Brave News",
      "hospital": "AIIMS",
      "headline": "AIIMS Leads the Way- 3 Indian Hospitals in World's Best list"
    },
    {
      "source": "Brave News",
      "hospital": "AIIMS",
      "headline": "ఎయిమ్స్‌ న్యూఢిల్లీలో 10 పోస్టులు.. ఇంటర్వ్యూ ఆధారంగా ఎంపిక! | Sakshi Education"
    },
    {
      "source": "Brave News",
      "hospital": "AIIMS",
      "headline": "Medical Social Welfare Unit (Main Hospital )"
    },
    {
      "source": "Brave News",
      "hospital": "AIIMS",
      "headline": "AIIMS New Delhi, Medanta, PGI Chandigarh feature among world's best hospitals 2025"
    },
    {
      "source": "Brave News",
      "hospital": "AIIMS",
      "headline": "How to book online appointment in AIIMS, Delhi: 16 simple steps | eHealth Magazine"
    },
    {
      "source": "Brave News",
      "hospital": "AIIMS",
      "headline": "AIIMS Hematology Appointment Online, Check OPD Timings & Helpline Number - AIIMSOPD.in"
    },
    {
      "source": "Brave News",
      "hospital": "AIIMS",
      "headline": "Affordable OP services turn bane for AIIMS Bibinagar"
    },
    {
      "source": "Brave News",
      "hospital": "AIIMS",
      "headline": "Orthopedic Doctor in AIIMS, Delhi - Book instant Appointment, View Fees, Feedback"
    },
    {
      "source": "Brave News",
      "hospital": "AIIMS",
      "headline": "IIT Delhi, AIIMS Delhi to establish a CoE for AI in Healthcare - Express Healthcare"
    },
    {
      "source": "Brave News",
      "hospital": "AIIMS",
      "headline": "2 मिनट में पाएं AIIMS में अपॉइंटमेंट? फॉलो करें ये तरीका । How to book appointment in AIIMS Delhi - India TV Hindi"
    }
  ],
  "news_count": 50,
  "collection_date": "2025-11-20T00:24:03.306154"
}