{
  "hospital_name": "Apollo",
  "reviews": [
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "Apollo Belapur cannot be trusted.\n\nI had a very bad experience start from the surgery to discharge.\n\nThey sent unrealistic bill to insurance team and later couldn't provide justification for the bill, at the end patient and their family to suffer mentally.\n\nDon't choose Apollo Belapur."
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "I went for a DMO role a few months back . Mamatha singh has no respect for my qualifications & experience. She blames organisation for less wages . On my face she said you aren't the only one who are qualified & had some experience. If not you we will get many others. The other HR is very good cool headed & tried to calm her down. But she is not listening. Superintendent liked me very much but Mamtha singh gave bad feedback saying very bad conduct. So I got rejected there.\n\nShe is representing a big organisation & this is how she behave with the person who is holding MBBS degree."
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "I had dengue fever and I got admitted into this hospital and they started treating me as soon as I got admitted since my platelets were at a very low amount and I personally love the way how doctors come and consult me every\n\nThough the medical expenses are very high , the doctors working there are very experienced, infrastructure is also very good"
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "I visited Apollo Hospitals, Bannerghatta Road(Bengaluru) from Tanzania between March 1626, 2025, for a routine medical check-up(ref. AHB0001298094). Overall, I received a satisfactory care from competent and dedicated doctors and other Hospital staff. However, I had a very bad experience with Dental Department. On March 25, I underwent a full-mouth laser gingival curettage and received a crown-and-bridge placement which involved exorbitant charges of INR86, 859(over USD1, 000), plus INR9, 567 for a root canal. Upon returning to Tanzania, on April 14 I noticed the crowns beginning to chip, and within a week they had completely detached. When I reported this to the Dental Department, I was offered a complimentary replacement bridge but this would involve local dentist consultation in Tanzania, digital impressions, bite registration, and subsequent refitting at my own cost. I declined the offer, not only due to the expense but also because of my concerns about the crowns quality and the risks of coordinating two different dentists across countries. Instead, I requested a full refund of my total treatment cost(INR96, 426).\n\nSince no agreement was reached, I escalated the matter to the International Patients Department. I received a notification stating that an International Patients Representative would contact me. However, I have not heard from anyone. The only communication I have received were internal email exchanges, on which I was merely copied.\n\nThis experience has been deeply disappointing, especially considering Apollo Hospitals esteemed reputation in Tanzania and globally. As an international patient, I have placed my trust and my resources in care of this hospital, expecting the best out of it. I hope the hospital addresses this promptly and ensures better support for international patients in similar situations."
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "Coming all the way from West Bengal, I placed my trust in Apollo Hospital — and I’m glad I did. As a patient, what matters most is feeling safe, cared for, and heard. From the moment I arrived, the professionalism and empathy of the staff made a strong impression.\n\nThe doctors here are not only highly skilled but also attentive and patient in explaining every step of the treatment process. Nurses and support staff were kind, efficient, and always available, even during the toughest moments.\n\nTraveling such a long distance for medical care isn’t easy, but Apollo gave me confidence and peace of mind that I was in the right hands. I chose this hospital for its reputation, and my experience lived up to — and exceeded — expectations.\n\nIf there’s one thing I’d say to other patients: if you’re looking for quality treatment and people who truly care, Apollo Hospital is a place you can trust."
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "I’m truly heartbroken and disappointed. After waiting patiently for over a month to consult Dr. Rooma Sinha—putting all my hope and trust into finally getting help—I was told at the last moment that she wouldn't be available. There was no prior notice, no message, no courtesy call—nothing. If she knew she wouldn’t be available, why not inform patients at least a week earlier?\n\nThis wasn’t just an appointment—it was something I was counting on for my health and peace of mind. The lack of communication felt careless and disrespectful. Time, trust, and emotional investment—all wasted. I expected better from someone in such a respected position."
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "I Lost my brothers life here. just 18 days before with Admition of just 1 and half day. and bill was Rs. 550000, and outcome is \"Death\"\n\nThis is not Hospital. it is money making Organisation, here Nursing Staff very unknowledgeble . Admition Manager \"Vaishali Jagdale\" behaviour also Very Casual and Bad. After Admition of Patient. which was not before Admition.\n\nFinally i want serious Attention of people. don't go here with your loveble familly members. Govt Authorities plz take some Serious Action. on this Hospital."
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "The patients should think twice before opting for treatment as they will charge exorbitant amount for Miscellaneous charges and will not give proper breakups with clarity in the estimates which you take before operation from them"
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "Their call centers keep calling and send several SMS’ to confirm appointments. Lot of Spam. Over rated hospitals. Just go to another health care provider to better care at lower prices."
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "Dr. A.G.K. Gokhale and his doctor's team was excellent with all the necessities provided.\n\nAlso all the nurses from Bengal in ICU section was very attentive and helpful. Overall experience was very smooth."
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "My daughter is doing dialysis in Apollo hospital chennai. she is a patient since 2009. The dialysis cost is huge. We are paying so much but the food they provide is horrible. So less quantity they serve it cold . We from northeast do not eat curd rice and rice is too little. Please improve your food quality and quantity!!"
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "Worst experience with Optometry/Dental Department as no value for Time of Patient but they want timely payment without any hesitation."
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "Try to avoid this hospital as much as possible . Doctors are ok , but nursing staff is pathetic . They almost killed my wife ."
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "Very unhygienic, there were rats running in the single rooms too. Even after complaint, no action was taken. They are not using latest medical equipments, they used 18 gauge needle for spinal fluid test which is not latest..didnt use any ultrasound or local anaesthesia..poked my dad 8 times in the spine..couldn't do it right even once and he is highly diabetic and they didn't even care to wipe off the blood after or put a plaster on it..he went through a lot of pain and suffering that he literally asked for poison instead, even when he didn't give consent after 3 pricks, they proceeded without consent and forcefully pricked him 8 times. Dr. Sarmistha Panigrahi (Anaesthesiology) was the one responsible for it. The skill and education of her is really questionable. Very lazy staff even after calling them multiple times, they don't come and attend us even when they are free, they just sit and chat. So careless they don't attend the patient on time and so negligent in giving medicines..they gave dolo instead of diabetic medicine once. Since we are educated enough we could tell the difference..just imagine the harm it can cause to naive people. When the negligence was confronted they didn't even apologize. Too over priced for the services provided. Just another commercial branded hospital. Not patient centric like they market."
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "My father was living a good life in the village, I don't know in which unlucky moment I brought him to Apollo navi Mumbai to get him treated by a good doctor, I did not know that a good doctor would silence him forever. And the hospital administration killed him in the name of angiography, Even though I am blaming on Dr Sanjeev team in anger, but the real culprit is me. Doctors profession is such that always see incidents of death in the hospital, someone's death may be a normal thing for them, but what difficulties the death of a person may cause to his family, it may not make any difference to them\n\nToday, I have suffered the biggest loss. My children's education was run from his pension money, because I was unable to maintain the family with my small job. Now, even the children's education will remain incomplete because my main support is gone.\n\nI want answer only these 3 questions from apollo navi mumbai\n\n1.Did I take him to you in a dying condition?\n\n2.If I had not got angioplasty done as per hospital advice, how many days would he have lived?\nCan I get the cctv footage of 13th July 24 from 5 am to 9 pm to know what all happened to him because even the staff of Apollo is not trustworthy.\nDr. Sanjeev is a good doctor but some of his team members were very careless and that became the reason for my father's death. I wanted to know what happened to him but they are not giving me the CCTV footage even though there was a camera installed near his bed."
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "In CBD Apollo Emergency I was diagnosed for not keeping well. The emergency doctor was so rude named Dr. Nitishaa that first she didn't bothered patient is waiting for treatment later she was being so rude with the patient for why you did ECG you have some cardiac issue then only we do ECG and when I was diagnosed with no medical issue still she was forcing to do multiple test so that the amount of bill can be increased.\n\nShe was always giving excuses for not making the discharge paper as one of the staff told let 2 hours be over 3k patients have to pay along with other bills\n\nIf a patient is feeling okay and report are normal I think it's the right of the doctor to discharge the patient. Dr. Nitishaa need to behave with her patient she was being so rude even other patients started saying she is so rude."
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "It was a beautiful experience with doctor Aradhya , We are a foreign couple come to India to have children and we were afraid who would be the best doctor for this decision, but Apollo Hospital in Kondapur is the best place for treatment, and thanks to God & D.Aradhya, the first attempt of IVF was successful, and I recommend everyone to go to this wonderful hospital."
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "I was admitted in emergency due to fracture on Tibia and Fibula. I had to undergo surgery with nailing and plate. Hospital had initially taken cashless approval against my corporate ICICI policy, however, when we saw the estimate especially room rate, the hospital has shown room rate as INR 8200 whereas for same room they were charging INR 5000 from individuals as well as some other insurance companies. Since my room limit under corporate policy was less than INR 8200, I decided to use my personal Star health policy and asked hospital to get the cashless authorisation against Star Health policy which we got within 2 hours. After getting the approval I had categorically written to hospital of our intention of using Star Health Policy. To our utter surprise the hospital first got the claim realised from Star health on 28th May and submitted another bill to ICICI on 3rd June so that they can claim the amount twice to in tease their profit by fraud. ICICI also paid the claimed amount to Apollo. When I checked with Apollo, they just said that it is a human error.\n\nFrom this it is clear that hospital is trying all unfair means to make money as they had knowingly submitted another claim to ICICI which shows fraudulent practices being followed by Apollo and puts a question mark on their so called ethical practices.\n\nIn my openion one should only go to Apollo if they have someone known working in hospital"
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "Dr Sudhir Kumar is money minded dr all he care abou the amount you paid for the consultation, hes busy with the phone and if you ask questions he wil send you another dr, hes very rude honestly, sad to such unprofessional dr in Apollo field"
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "Good Afternoon, I came for a consultation for Dr Satish Kotla and I am waiting in the lobby for one hour and their is no Air conditioning and outside the hospital the temperature in Hyderabad is around 42degrees is this the treatment you people are giving to the patients,"
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "We went to Apollo hospital for my father's treatments and our experience is average. Good treatment good administration."
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "Food service staff Pavithra provides good service to my mother she is a very caring girl. Other services have to improve more."
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "My sister had to undergo Gall bladder removal. Liver biposy was done . Surgery went well but the doctor who suggested surgery \" Dr Bharat Kumar\" is pathetic without medical ethics. Based on Liver biopsy he tells my sister \" Your life is OVER. You will have to spend rest of your life on steroids which will cause other health concerns\". But since the serology report was negative about AUTO Immune Disorder. He told her to consult Liver Transplant Specialist of Apollo for second opinion. My sister couldnt sleep for a week. After a week we decided to take her to another Doctor from Global Hospital and he was surprised to know the kind of scary language Dr Bharat used. Finally series of tests were redone there . Her Liver block was received from and given to Global Hospital and biopsy ruled out chances of Auto Immune PBC and instead said the duct narrowing was either due to intake of some other medicines or Gall bladder issue. Basically biopsy report of Apollo was wrong and Dr Bharat doesnt know how to talk to patients. Which doctor would tell his patients that their life is over ?...After surgery behaviour of nurses in ICU was super rude and they scolded my sister when she said its paining."
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "I was diagnosed with breast cancer and had to undergo lumpectomy surgery done by Dr. Sandeep The first time I met him, my fear of cancer was completely gone. Dr. made me feel at ease through his friendly behaviour and cheerful disposition. He explained to me, in layman's terms, my medical condition and how I will be completely cured of cancer after the surgery and other allied treatments. His confident attitude, friendly behaviour made me undergo my cancer treatment with lot of ease. Dr. surgical skills are also excellent. I did not feel any discomfort or pain after the surgery and the wounds healed very fast. He is also an excellent human being and I strongly recommend Dr"
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "Best service and hospital working process such a great and the workers behaviour mind-blowing and osm"
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "Best hospital facilities are also good best staff best doctors and food is also and fresh for patients"
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "Third class service. Worst experience. Ticket keeps getting postponed. Very bad call center service.\n\nOnly making money from AMC no service"
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "I admit in 3rd floor...it's leg surgery...last 4days there care me very good way....\n\nI thank ward girl....incharge person paremila..., malathi akka....half nour once I ask to come for rest room...they treat me in good way...and give moral support too.."
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "Good behaviour in hospital staff and doctor and easily all facility are available in one roof thanks ????"
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "I am writing to share a distressing experience my family had at Apollo Hospital Navi Mumbai last weekend, specifically in relation to the services provided by Dr. Swapnil Gosavi (ENT). It is with great disappointment that I recount the events, hoping to raise awareness and caution others from falling victim to similar situations.\n\nLast weekend, my aunt faced a medical emergency when a small wire became lodged in her throat during dinner. To seek prompt assistance, we rushed her to Apollo Hospital Navi Mumbai. To our dismay, instead of a quick resolution, the hospital subjected her to a series of unnecessary tests and admitted her to the standard ward overnight.\n\nThe wire was eventually removed the next morning via endoscopy by Dr. Swapnil Gosavi. However, our ordeal did not end there. Despite her improving condition, the hospital insisted on keeping her for further observation in the general ward. When I requested discharge in the evening, they declined, insisting on an additional day's stay.\n\nThe shock came when we were presented with a bill totaling Rs. 1, 93, 000, justifying it as a complicated surgery and a severe level emergency case. When I questioned the billing department, I was redirected to Dr. Swapnil Gosavi, who displayed a dismissive and rude attitude. He insensitively mentioned the disturbance to his sleep, claiming a thankless job and asserting that such costs were expected at a hospital like Apollo.\n\nI confronted Dr. Swapnil with valid concerns, questioning why she was not placed in the ICU if it was a severe emergency and why the procedure took place at morning. Unfortunately, his responses lacked clarity and were overshadowed by a condescending attitude.\n\nIn my attempt to rectify the situation, I approached the billing department, only to be met with conflicting stories. Initially, they claimed no prior communication about a deposit, but later altered their stance, stating that a deposit of Rs. 2, 00, 000 was communicated beforehand without any written and signed estimation.\n\nFeeling cheated and desperate for resolution, I have escalated the matter to the ICMR and consumer forum. I share this experience here not only as a cautionary tale but also to urge everyone to stand against such unethical practices. Let us think beyond money and prioritize ethical medical care over financial gains.\n\n#Apollo #DrSanjayGosavi #ThinkBeyondMoney #PatientRights"
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "Dear Apollo Team,\n\nThe situation you described at Apollo Hospital Navi Mumbai regarding the care of your nephew, Karan Yadav, is concerning. It appears that there was a miscommunication or lack of coordination between the medical staff, leading to confusion and delays in providing the necessary medical attention to your nephew after his accident.\n\nDr. Tulika Avinash Diwan who was suppose to attend my nephews (Karan Yadav/ 15 years old) who met with accident and is in emergency ward G014. As she told after CT scan report she will start the process but after waiting so many hours, hospital authority Dr. Harsh mentioned she is in OPD and after waiting another hour Dr. Harsh came to me and mentioned.\n\nPlease help,\n\nMukesh Yadav"
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "Personal experience. Worst treatment. Junior and sadist dr.Karthik from nephrology department ?(+91-996205xxxx?) is behaving like a rowdy and playing with patient's health and experimenting with patient. He will purposely complicate your simple problem by giving you very less insulin(without asking diabetologist) and shift you to MD CCU to grab more and more money from you and make you bankrupt. Even without the need for dialysis, He will purposely start dialysis by threatening you something false and damage your kidneys permanently . He will not advise anything at the time of discharge also. He seems uninterested in his profession. He will make you do dialysis 3 times a week to make regular income from you. Beware of this(so called) doctor Karthik. You will not only lose money, you will also lose your precious health. Senior Dr.kc prakash sir is good. But he's relying and believing this inexperienced and UNPROFESSIONAL karthik."
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "I am thankful to Dr Vithal D Bagi for the timely advice Dr B Kiran Babu and the team who have given full support and guidance for TAVR procedure of Cardiology department\n\nSpecial thanks to Ms Pallavi the coordinator too"
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "Dr Meenal Jain was very rude and disrespectful.. it’s a shame for a Dr to have such attitude… infrastructure and service is good but staff and Dr needs to improve their behaviour."
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "Dr Anand M did not even checked patient, was rude and puts everything on lifestyle.\n\nHospital charges high fees, ask to pay registration fee separately i was charged 1500 for consultation though told 1200 on phone, even paying so much doctor do not bother stand from his seat to check patient."
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "Doctors and the nursing staff , especially sister Viji and Labani were very helpful. The management is poor but the staff is great and very supportive."
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "I am right now at hospital waiting for my turn to get a echo 2d test . The consultation with doctor led to recommendation of this test . First the people manning desks have no clue , no behavioural training - for a place which has patients they casually ask patients to “ go here “ go there “ - no clear instructions , no basic empathy that patients are not in the best of health . After a few running around I finally came to the right place - the absolutely lack of professionalism , no token system of waiting , no clear sense of timing for tests , doctors just walking in with their patients breaking into the queue . A non Indian elderly patient started shouting finally cos he has been waiting till since 11 am and no one has basic courtesy to attend to him to apologise or give him water . And because he started shouting he was taken when it was actually my turn with not so much as chekcing with me !!! This is pathetic - atleast show basic empathy to people who are patients and do not need additional tests . Hospitals with lesser brands and lesser charges have better facilities and better mannered staff as well as doctors . A particular doctor was just using his rank to get in his patients breaking the queue twice . Everyone’s time is important and everyone is suffering - if “ children case “ is going to be used to guilt everyone to break queues pls tell that before taking our money - Apollo first makes us pay bill before any such test is administered. I would like to mention technician Surekha was trying her best but the doctor was simply throwing his weight and breaking the queue to get in his patients -some of these ppl need immediate ICU level training . The non Indian patient being ignored has very legit reason to be upset - and on his behalf k asked the staff “ would you have behaved like this with a white man “ and they had no answer"
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "I take appointment of Dr. Sunil kutty. I taken proper appointment with confirmation. On Dr. Name they take payment after payment neurological dept receptionist said their Secretaries assist you.. If we paid best doctor fees with high amount. They send assistant. 1 st floor physician dept all receptionist are too much rude & not properly guided.. Groud floor Meenakshi MRI dept she aslo talking rudely.."
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "The behaviour of ICU nurses and doctors towards the ICU Patients are very inappropriate and rude, they are paid to do there job, but they act like they are doing some favour to us and the patients if they had issues cleaning the patients or taking care of them, they should have taken a different profession, when they know that in this profession they have to do all such things, then they have to do it."
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "Ms. Sanjana from billing department helped us a lot in our queries and really provided a good service"
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "I will NEVER recommend Apollo to any of my friends or family any time after having such a nightmarish experience last 5 days. So many tests were performed on my 75 year old mother and still there was no proper diagnosis.\n\nMy mother had fever and disorientation for which a plethora of tests were suggested and the diagnosis shared was unbelievable.\n\nBrain MRI, CSF, USG, eeg, 2Decho...etc etc and then pet ct scan just becoz everything was clear ..How a Pet CT scan is advised for a 75 year old without any symptoms , findings or a biopsy ???? Unjustifiable\n\nThe TPA raised a query in the discharge summary but I don't see any support coming my way and have lost complete trust on medical fraternity....looks like it is a best option not to visit such star hospitals in today's world"
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "I had an appointment with Dr Senthamil selvi on 22/10/23 her secretary of women's hospital asked me to visit today i.e 23/10/23 after coming the secretary is telling Dr is on leave. I have my flight tonight , I spent 15k for my checkup, we are paying so much and this is what we get . Was not expecting this from the management."
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "Me and my mother we like the services i like the way the kake care for every thing especially about the daily health of my mum. For sure My God bless ur hands abundantly Nurse, doctor you do a very good job.\n\nPavni, chongpi may God bless you, keep that golden heart. In few word this department was good, secure, and will be a pressure to be admitted here next time. By have nice job"
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "Medical treatment provided was excellent but the housekeeping service was unsatisfactory. Need improvement. Overall experience was good."
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "We have been associated with this hospital from 2017 due to certain health issues for my father, the schedule of treatment has been always positive. Experience wrt to the availability of staff / nurse has been really poor off late and the management has to realise they are losing a lot of good resources owing to short recruit"
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "Pathetic service, no adherence to appointment given, if explained to staff also not bothered even aged pers"
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "Good staff, Nurse, ward boys and doctors are very responsible and caring. Very rush and full of crowd in emergency ward need to extend their infra structure. Doctors and staffs are working so hard. They diagnose thoroughly and enquiry based. Need improvement in rooms and shifting. Rooms are filled and it took a day to shift."
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "Doctors are so irresponsible. The doctor who has done the surgery is not involved in the patient care.\n\nCare is horrible than a government hospital. Just money minting."
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "When my cousin was present for a surgery.........the day of discharge was so bad. They were literally extending the process of mediclaim payment and have a huge billing and credential issues. Kindly look forward to it. And improve the staffs working effeciency."
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "My wife had been admitted in BMT ward for approx 28 days for Bone Marrow Transplant. We were scared before admission but after admission and interaction with nursing staffs, my fear had been vanished. We have been discharged Today (27.09.2023) With good memories in that days. All nursing staffs are very caring and friendly. Special thanks to Vitty sister who has treated like own older sister. Thank you Dr. Punit Sir and Dr. Kanika Madam for giving best treatment to my wife."
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "Thank you so much for your care and guidance during this incredible experience! We are beyond thrilled.\"Thank you again for everything you did to help get our baby here. You were so wonderful to work with during a stressful time and you and your team were supportive and encouraging every step of the way…."
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "I was admitted for one week and was taken care of very well by the entire nursing staff. They were prompt to give attention and provide necessary care."
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "Incorrect lab results provided to us. Initially few tests were prescribed basis which we had to do additional tests, both the test results were flawed.\n\nI m not sure if they have properly trained lab technicians or not."
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "Apollo Hospitals is a prominent healthcare group headquartered in India. It operates a network of hospitals and medical facilities, both in India and internationally. These hospitals offer a wide range of medical services, including cardiology, oncology, neurology, and more. The term \"Apollo Hospital International\" might refer to their international operations or specialized facilities catering to international patients."
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "To the staff of Apollo hospital I express my wholehearted appreciation for your care and attension you have provided to our patient"
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "Burst service in Apollo rajshree indore.apni family member ki death krwana ho to lekr aa jao.Bahut ghatia staff , doctors, maintenance , all service"
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "Hospital has taken 50000/- as deposit while admitting patient even there is health insurance of recognised company.On the same day of admission patient was discharged but hospital refused to refund remaining balance amount after deducting the bill.. Even after 14 days of rigorous follow up the hospital administration harassed me regarding said refund and asked to call another department for the same... Even now after discharge of patient on 30/07/2023 I have not get refund... The rude and disrespectful behavior of hospital administration frustrated me to see such type of harassment"
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "Deepika sister it was a nice experience. You were very cooperative and nice during the whole procedure."
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "The Apollo hospital has undergone significant changes over the past 5 years. Unfortunately, some employees seem to have adopted a more direct communication style, and certain treatments now require an additional fee. If zero stars were an option, that's the rating I'd give."
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "I m extremely satisfied with the Depart of NICU of Hospital.Great Care and attention Given By The Staff like a mother I m happy with their work thanks a lot"
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "I have visited this hospital more than 3 to 4 times the service was excellent doctors and staff was polite addressing issue in a good manner, even\n\nfacilities also good..thanku apollo ??"
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "We got excellent service by staff sister ANKITA, MARGARET, MINU, SUSHMA...ALL...DR.OMPRAKASH nd DR.POONAM is best\n\nSo HYGINE ND GOOD TEAM WOR??\n\nTHANK YOU??"
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "I visited dr raghu he is one of the finest doctor’s i ever met…a very good human being more than a doctor thank you"
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "I am writing this review on behalf of my father who is on dialysis in Apollo Ahmedabad. My father fully satisfied the dialysis treatment providing in apollo. the doctors and staffs in dialysis unit is well experienced and mannered. now Apollo dialysis is like a second home for my father. Under the guidance of respected doctors Mr.Mukesh and team doing a very passionate care to patients.\n\nQuality of service is far better than other dialysis centers. But the infrastructure is very pathetic. Dialysis machines are old models, congested place, not enough space between beds.\n\nNow a days govt dialysis centers are far better than this. No proper cooling in unit, my father always asks for a fan in a centralized aircondinitioning fecility. And charging Gujarats highest rate for dialysis. This is unacceptable. We are still here in apollo because of doctors and staffs."
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "Gynecology department in Manju sister is a great and caring nurse. She offers helpful advice and suggestions. She is prompt to respond to calls. We have not had any negative interactions with anyone."
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "My words can’t explain how grateful i am to Dr.Richa Bansal and Dr.Anuja Thomas of Apollo Belapur for facing a complicated surgery of mine on June 2023 so smoothly and with utmost care.Thanks a lot to the whole team of Dr.Richa and Dr.Anuja for dedication and hard-work thru out my recovery phase in hospital.I wll never forget the help of whole Apollo team for my rebirth."
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "Apollo hospital gives nothing compared to the money the charge- Worst nursing staff, worse security rules, etc .The whole point of hospital is to earn money rather than the patient recovery. All this hospital has are 4-5 canteens, all area ac and thats it. They try to make the patients long stay to make money rather than treating them well and discharging. We stayed here for 1 & 1/2 month which resulted to a huge bill of ₹40 lakh and patient DEATH. Would never ever recommend this hosptal to anybody."
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "The receptionist at radiology department was excellent...and very humble and dedicated to providing high quality standard guidelines and helpful details and directions..\n\nDr Nita is excellent and explains to patients details with understanding very humble and smart in all she does..good listener and very patient ..\n\nDr Tikoo .. excellent Dr and his receptionist team..He listens carefully and guides his patient well..he his very humble and gentle\n\nThe wellness check up team the best from receptionist to cashiers to labattendees .\n\nThe MRI team.. excellent\n\nDrReddy the cardiologist is excellent doctor ..I love the way he handles patients and explains details and very care to listen to patient\n\nOncology department The best in all areas .\n\nPharmacy. Attendees great ...but medication abit expensive.\n\nIn general The Apollo hospital in Mumbai Navi is one of the best I have ever attended with alot of staff and Doctors team work and giving the patient the best care and support needed ...\n\nThey ensure you understand every procedure and guides you from step to step ..They don't rush the patient in giving them meditation...they examine and listen carefully before any drugs are given out ...\n\nThey don't undermine patients or shout at them...they handle them with care and love ..\n\nThey all carry themselves with alot of professionalism and dedication.\n\nHospital is clean and well kept\n\nThe hospital has best medical equipment and well placed ..\n\nAm happy I had an opportunity to be handled and checked and treated very well at Apollo Navi Mumbai hospital .."
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "I take this time to say thank you so much for all staffs who works in bone morrow transplant , the Doctors especially Dr punit jain , the nurses and the housekeeping staff for a good services delivery for me when i was sick , the nursing team took great care for me. Iam happy to be discharged.\n\nThankyou everyone ."
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "Apollo Hospitals Chennai is totally into business. They are harassing the common people who come from different states of the country. Too expensive treatment. Request to middle class people not to come to this hospital rather visit Vellore. They are doing business at the cost of people's hard earned money. Moreover, local people are given more preference. They are high profile dacoits looting money from people. Very bad experience. They charge a huge amount for a minor operation."
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "Verry rude staff they don't understand a bit how to talk to the interviewer who comes to us very rude they have no manner disappointment with the recent experience I had at your esteemed institution. I regret to inform you that I encountered multiple instances of staff misbehavior and rudeness during my visit, which has left me deeply disturbed. Firstly, upon arrival at the hospital, I was greeted with an unpleasant attitude from the interviewer . He is very rude\n\nMedical care is good or hospital also but staff as interviewer he is too ?? bad"
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "L am sachin salve admitted in apollo hospital navimubai .done liver transplantation. all doctors and staff care good.special thanks to Dr.daris, Rohan, Shailesh, makrant ketul.staff nurse Sheena, Raji, mercy, nimmy, jessy, ambly, biji.thank you so much all ."
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "My father Natanasabapathy 78 years old . He need to change pace maker . we met Dr.Karthigesan in Trichyappolo then he done replacement in chennai. Very friendly and he make our family pan 0% Thank you sir, Thanks to nurse sherin, shivani, all nurse, ward boy's, housekeeping, f&b device, dr secretary simaran tan q all help full."
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "Here Dr talking is very good…..but here same staff like a PM !!! Specially Healthcare building staff.\n\nThis time i coming, my family member see doctor. So I have experience woman building, Children building, Sondori main building, and full body checkup health building. “Only main building staff very professional” Other all very very poor!!!"
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "Dr Nita Nair is excellent.\n\nShe is very very supportive and very quick to respond.\n\nHer team including staffs including nursing and house keeping services are very good."
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "Too Good nursing Staff. Doctors good.\n\nHouse keeping was not provided while taking the patient to OT and while getting back to ward. Nursing staff had shifted and got the patient back.\n\nMidnight no response of House Keeping staff.\n\nReports hard copy were not provided"
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "I admitted for renal transplant surgery, successfully done, in sixth floor D ward staffs Seema, Raji, Mummy, Mercy, Ambily, Biji are taken care of me well, Thank you"
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "We are completely satisfied with the services this hospital has provided uptill now, will suggest everyone about apollo hospital"
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "Saraswathi ( she was doing her duty very clean and good)\n\nJayakumar ( he was also very patient with his work)"
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "Very nice and good experience. They take care the patient very well. All the staff are friendly....."
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "Satisfying and Very Caring Atmosphere! My son was admitted here for treatment and we are returning back healthy, Great care by taken by the staff."
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "Because I had dengue, I went to this hospital. They purposefully reduced AC temperature. I complained about reduced AC temperature, but management has not taken any action. Additionally, they delayed my discharge from hospital by making me weak and removing more blood from my body, which worsened my health, in order to charge me more money. I felt like almost dead. Don't come here, patients are not treated well , but looted by practicing fraud and scam with them."
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "Worst facilities of staff .... The doctors are also so mean nd selfish ... Worst ever hospitals seen"
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "I am getting my daughter treated in apollo hospital she is going through chemo therapy the only reason am in this hospital is because of my dr Vipin Khandelwal the best pediatric hematologist the stafff doesn’t know what they are doing we have to call multiple times for change of medicine for a simple urine test it takes 1. :30 min and that to I chased it or else’s god know when would I be able to get the reports please improve your services nurses are very important for patients and it’s important that they know what they are doing"
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "Consulted Dr. Ranjanee Muthu for my mothers treatment, she explained everything very slowly and gave proper care"
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "Excellent service, cooperative staffs.....Qualified technicians well equipped. Well organised.Quite satisfied by the service provided by the hospital staff. Staff is well mannered and polite."
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "Im admitted in renal icu bed no 05 bcz of nephrectomy donor surgery.they are give better service to me and my brother.Im getting new life.thanks for all.fst thanks to my god and all apollo staffs.Nursing care is super fablous exellent.Only one commenêt cleaning will be improved 2 times is not enough need more than 2 times..Doctor give a very much care for surgery..thank you.Specialized thanks for Dr.M sarãvanàn and dr.thirumalai ganeshan."
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "Excellent service from Apollo hospital .\n\nRecently I m visited Apollo hospital for my brother PFT check up such a good experience nice service......\n\nThank You For Miss. Damayanti Ma'am."
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "The hospital chain emphasizes patient care and aims to provide a comfortable and supportive environment for patients. They focus on personalized care, ensuring that patients feel well-cared for during their treatment journey."
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "Sagar kamble security in icu.3rd floor.\n\neven his colleagues as security.\n\nsincere and obedient.\n\neven submissive to us.\n\nthank you."
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "Excellent service from Apollo hospital . water is provided on time. satisfaction treatment from the hospital."
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "My friend got fast emergency treatment and save his life. Staff is knowlegable and very obediant... Thank u for all apollo hospital team"
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "Security gard:mrs.saheeda khan.it is very intelligent person, she help me about serching my phn.anf very good job????"
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "Service in apollo 44 is pathetic patients have to wait for everything for 2 3 hrs. No water is provided on time. And not satisfaction treatment too many side effects but no result. Only people money time getting waste."
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "A professional and empathetic ICU environment with a lot of thought given to caretakers in addition to patients. Typical ICU duty environments for caretakers can be stressful, with trying to get information on the patient in the ICU, or staying overnight at the hospital. I found that at Apollo Belapur, solutions to a lot of these concerns were thought through and taken care of. The security was professional enough to stick with hospital rules about ICU visitation, and at the same time empathetic enough to handle all caretakers respectfully. Special call out to Samir Bhilare on this front, and additionally for prompt communication in calling the caretaker when doctors required the medical history of the patient or to update the caretaker about the patient’s progress. Apollo also has a great attendant resting area, complete with perhaps 20 or more beds, each equipped with its own bedside lamp, a pillow and a plug point, as well as clean restrooms and bathrooms. It’s a great model in ICU attendant/caretaker management for other hospitals to follow."
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "Worst hospital providing fake treatment in huge cost. This is regarding surgical treatment of my husband Gaurav Shrivastava done on 21-Mar-2023 (hospitalization from 20-Mar-2023 to 22-Mar-2023). He had taken treatment for “Kidney stone removal” from Apollo Hospital, Belapur Navi Mumbai. As per the initial CT scan test report (dated 20-Mar-2023), 2 stones were present in left kidney which were 7 mm each in size and one in the right kidney of 14mm size.\n\nHe underwent a surgery on 21-Mar-2023. After surgery, the doctors informed that the stones have been removed and in Discharge Summary same was mentioned that stones have been broken by laser lithotripsy and removed from the left Kidney and the stone of the right kidney was powdered and then bilateral DJ stenting was done. He was discharged on 22-Mar-2023 (stents were to be kept for 3-4 weeks). In the medical bill, all these procedures have been charged for both the kidneys.\n\nNow, we contacted another Physician for “Removal of DJ stents” since the price in Apollo was very high and this new physician suggested to undergo a CT scan (at any diagnostic centre of our choice) before this procedure. As per the CT scan report (dated 10-Apr-2023), it was identified that the stones are still present in both the kidneys (one 7mm stone in left kidney and one 14mm stone in right kidney) and even the size of the stones were also same (size was same as that of the CT scan dated 20-Mar-2023).\n\nThat means the surgical treatment provided by Apollo Hospital was fake and is a case of medical negligence and fraud.\n\nAs per my current Physician recommendation, I will again have to undergo a surgery to remove the stones along with “Removal of DJ stent” and a new stent will be placed.\n\nThis has affected my husband, me and my family members gravely in all aspects- mentally, physically, and financially. I have paid a huge amount for this treatment around 3 lakhs (3 days hospitalization) and my husband had tolerated so much pain and blood loss (during and after procedure) but the medical issue has not been resolved.\n\nAs Apollo didn’t provide a proper treatment, my husband will again need a surgery for “Removal of Kidney stones”.\n\nI asked the hospital that, based on my complaint, Apollo management should take action against all the doctors involved in this fake treatment scam and I want refund of all the amount that I have paid along with compensation for the mental and physical trauma that me and my family members have suffered. However, just like their doctors the management is negligent too.\n\nNow, I am going to take a legal action against Apollo Hospital and its responsible medical staff and posting this to warn everyone that this hospital runs scams and frauds in treatment."
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "This is the right platform to share my experience about the treatment we got for my mother.\n\nMy mother had been diagnosed with high risk AML and her condition was very critical as she had fever since last 20 days before her admission. We were so blessed to have Dr. Punit the right person who can treat and cure this on time with his great decision making ability and with his amazing BMT team. My mother got right treatment from right person at right time. thanks much Dr. Punit for treating my mother so well we wouldn’t have imagined this journey without you."
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "Treating Doctor and assistant Doctor Excellent\n\nNursing Staffs cooperative and very good\n\nHouse keeping to good.\n\nTPA dept need proper coordination.\n\nCafeteria needs to improve.\n\nRegards\n\nDr Ranjit Khandare"
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "Apollo Hospitals is one of the best I have ever visited, My grand father had tuberculosis and underwent treatment here. He recovered in a year. The services provided are good. they have the latest equipments, laser technologies, xray rooms, modern diagnostics. The doctors are also quite good in their specialization and knowledge. The only problem is it is too costly for a common man, so be ready to spend enough to get the best services."
    },
    {
      "source": "MouthShut",
      "hospital": "Apollo",
      "review": "I am going through dialysis since 1 yr in this hospital. Having a great experience, dialysis department, staff, doctors are so good and friendly. It is like a second home to me."
    },
    {
      "source": "JustDial",
      "hospital": "Apollo",
      "location": "Apollo Home Health Care Ltd.",
      "review": "I visited Apollo Home Health Care Ltd for a routine check-up in the Intensive Care Unit (ICU). The department was clean and hygienic, which made me feel safe during my visit. The wait time for my appointment was less than one hour, making the whole experience very efficient."
    },
    {
      "source": "JustDial",
      "hospital": "Apollo",
      "location": "Apollo Hospital",
      "review": "Its a good hospital. And staff also very good and humble person."
    }
  ],
  "review_count": 102,
  "news": [
    {
      "source": "Brave News",
      "hospital": "Apollo",
      "headline": "Delhi Government Reports Indraprastha Apollo Hospital's Disregard for EWS Patient Care: Only 9-10% Compliance, ETHealthworld"
    },
    {
      "source": "Brave News",
      "hospital": "Apollo",
      "headline": "Medication Support in Blackpool | Apollo Care"
    },
    {
      "source": "Brave News",
      "hospital": "Apollo",
      "headline": "Apollo AyurVAID to expand network to 350 beds in four months - Industry News | The Financial Express"
    },
    {
      "source": "Brave News",
      "hospital": "Apollo",
      "headline": "Delhi Government Challenges Apollo Hospital Over EWS Patient Care | Health"
    },
    {
      "source": "Brave News",
      "hospital": "Apollo",
      "headline": "Apollo Medicine Journal - Apollo Hospital Bangalore"
    },
    {
      "source": "Brave News",
      "hospital": "Apollo",
      "headline": "Emergency Department Solutions | Emergency Medicine Staffing"
    },
    {
      "source": "Brave News",
      "hospital": "Apollo",
      "headline": "Apollo Hospitals in India: Prices for Diagnosis and Treatment, Reviews | MediGlobus"
    },
    {
      "source": "Brave News",
      "hospital": "Apollo",
      "headline": "Dementia India Alliance and Apollo AyurVAID Hospitals sign MoU to Advance Integrative Dementia Care and Awareness"
    },
    {
      "source": "Brave News",
      "hospital": "Apollo",
      "headline": "Apollo Hospitals Achieves Historic Milestone: Completes 5,000 Liver Transplants, Sets a New Benchmark for Indian and South Asian Healthcare"
    },
    {
      "source": "Brave News",
      "hospital": "Apollo",
      "headline": "Apollo AyurVAID Hospitals inaugurates facility on Greams Road - The Hindu"
    },
    {
      "source": "Brave News",
      "hospital": "Apollo",
      "headline": "Renewing Hope, Restoring Lives: Apollo Cancer Centre Unveils Its Cellular Therapy And Blood And Marrow Transplant Centre In Bengaluru. - TRIPURA STAR NEWS"
    },
    {
      "source": "Brave News",
      "hospital": "Apollo",
      "headline": "Apollo - Elevate Healthcare"
    },
    {
      "source": "Brave News",
      "hospital": "Apollo",
      "headline": "Apollo Hospital served only 9-10 percent EWS OPD patients in 5 years: Delhi Govt tells SC"
    },
    {
      "source": "Brave News",
      "hospital": "Apollo",
      "headline": "Hospital Medicine Solutions | Hospitalists Staffing"
    },
    {
      "source": "Brave News",
      "hospital": "Apollo",
      "headline": "Apollo Hospitals Q2 Results: PAT rises 26% YoY to Rs 477 crore - The Economic Times"
    },
    {
      "source": "Brave News",
      "hospital": "Apollo",
      "headline": "Patient Instruction information - Apollo Hospital Bangalore"
    },
    {
      "source": "Brave News",
      "hospital": "Apollo",
      "headline": "Apollo Medical / Apollo Software / Primary care software to Extract and Store Patient Data"
    },
    {
      "source": "Brave News",
      "hospital": "Apollo",
      "headline": "Apollo AyurVAID opens third Chennai unit, on track to open 4 more nationally in next 3 months - The HinduBusinessLine"
    },
    {
      "source": "Brave News",
      "hospital": "Apollo",
      "headline": "Apollo Hospitals Group Celebrates 20 Years of Apollo Medicine: A Legacy of Medical Excellence and Global Impact - The Wire"
    },
    {
      "source": "Brave News",
      "hospital": "Apollo",
      "headline": "Careers - Apollo Care"
    },
    {
      "source": "Brave News",
      "hospital": "Apollo",
      "headline": "ApolloMD : Prescribing Quality Care | Healthcare Outlook"
    },
    {
      "source": "Brave News",
      "hospital": "Apollo",
      "headline": "Physicians - ApolloMD"
    },
    {
      "source": "Brave News",
      "hospital": "Apollo",
      "headline": "'Apollo Hospitals Plans To Add 1,600 Beds In Next 14 Months': MD Suneeta Reddy"
    },
    {
      "source": "Brave News",
      "hospital": "Apollo",
      "headline": "Apollo doctor warns: 10 big misconceptions about common diseases that could cost lives - The Economic Times"
    },
    {
      "source": "Brave News",
      "hospital": "Apollo",
      "headline": "Apollo Medicine: Sage Journals"
    },
    {
      "source": "Brave News",
      "hospital": "Apollo",
      "headline": "Best Ayurvedic Hospital in greams road Chennai | Apollo AyurVAID"
    },
    {
      "source": "Brave News",
      "hospital": "Apollo",
      "headline": "Apollo Hospitals Gears Up For Apollo HealthCo IPO By Q4 FY27, Unveils ₹8,300 Cr Expansion Plans"
    },
    {
      "source": "Brave News",
      "hospital": "Apollo",
      "headline": "Know Your Hospital - Apollo"
    },
    {
      "source": "Brave News",
      "hospital": "Apollo",
      "headline": "Apollo Hospitals says in talks with insurers to settle pricing, claim disputes"
    },
    {
      "source": "Brave News",
      "hospital": "Apollo",
      "headline": "Apollo AyurVAID | Award Winning Ayurvedic Hospital for Root-cause treatments"
    },
    {
      "source": "Brave News",
      "hospital": "Apollo",
      "headline": "Apollo Institute Of Medical Sciences & Research Hosts ‘White Coat Ceremony’ To Welcome The Class Of 2025 Students. - TRIPURA STAR NEWS"
    },
    {
      "source": "Brave News",
      "hospital": "Apollo",
      "headline": "Health Records : Apollo 24|7"
    },
    {
      "source": "Brave News",
      "hospital": "Apollo",
      "headline": "Best Hospitals in India for East African Patients"
    },
    {
      "source": "Brave News",
      "hospital": "Apollo",
      "headline": "Best hospital facilities in Delhi | Apollo Hospitals Delhi"
    },
    {
      "source": "Brave News",
      "hospital": "Apollo",
      "headline": "Apollo Home Healthcare - HCAI"
    },
    {
      "source": "Brave News",
      "hospital": "Apollo",
      "headline": "Public Private Partnerships | Apollo TeleHealth"
    },
    {
      "source": "Brave News",
      "hospital": "Apollo",
      "headline": "Book Appointment - The Apollo Clinic"
    }
  ],
  "news_count": 37,
  "collection_date": "2025-11-20T00:24:03.294703"
}