{
  "hospital_name": "Narayana",
  "reviews": [
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "I had heart surgery at this hospital, and I couldn't be more grateful for the exceptional care I received. The surgeons were highly skilled and explained everything thoroughly, putting my mind at ease. The nursing staff was attentive, compassionate, and always ready to help. The entire team made my recovery process much smoother. Im deeply thankful for their professionalism and kindness throughout my treatment!"
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "Doctors do unneccesary tests to make the bills high.\n\nbad experience and most doctors looks freshers.\n\nhigh bills > poor treatment"
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "My father was admitted to this hospital with 40% cardiac function, based on a suggestion from another doctor. The initial plan was to perform an angiogram here and then move him to Narayana Hospital in Bangalore for further treatment.\n\nHowever, what followed was one of the most distressing experiences we've ever had. Despite him walking and speaking normally upon arrival, he was immediately shifted to the ICU. From that point on, things spiraled downward. His regular medications were changed without proper explanation, and we were kept in the dark about critical decisions.\n\nStudent doctors handled his case with minimal supervision, and the senior staff, including the head nurse, were unapproachable and rude. Even the basic courtesy you'd expect from support staff like ICU cleaners was missing.\n\nMost shockingly, without any informed consent from our family, they placed him on an invasive ventilator and conducted X-ray. Within just two days of admission, we tragically lost him.\n\nTo make things worse, the hospital delayed issuing the death report, making us run around for two more days while we were already grieving.\n\nUnless you have influence or strong connections, you might not receive the care and attention you deserve here. For us, it was a heartbreaking and irreparable loss. I would not recommend this hospital to anyone."
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "\"DEADLY NEGLIGENCE AT MEDICA HOSPITALDO NOT TRUST DR. AMLAN MANDAL\"\n\nIt is with deep grief, anguish, and a heavy heart that I write this review. My father, aged 63 years, was admitted to Medica Superspecialty Hospital, Kolkata on 23rd February 2025, under the care of Dr. Amlan Mandal. What we believed would be a short-term observation for a manageable condition turned into a devastating loss, due to sheer medical negligence, arrogance, and lack of empathy.\n\nMy father was generally fit and active for his age. He suddenly fell ill, lost bowel control, and was found to have an old blood clot and a mild reaction to recent medications. Based on this, we rushed him to Medica for emergency admission. After initial tests, the doctors themselves told us that the condition was not as serious as we fearedthe blood clots were old and manageable, and the primary issue was an electrolyte imbalance(sodium-potassium levels). With basic treatment, his condition improved within hourshe was walking, talking, and feeling normal.\n\nDespite his rapid improvement, the medical team insisted on keeping him for just two more days for observation. Our family was inclined to bring him home, but we were convinced to let him stay, thinking it was the safer optiona decision we now deeply regret.\n\nFrom Day 2 onwards, the situation took a mysterious and alarming turn. The doctors began pointing out new symptoms every dayissues with food consumption, oxygen imbalance, discomfort. They inserted a Ryles tube(nasogastric tube) even though my father had no swallowing issues initially. They placed him on oxygen support, and later diagnosed a lung infection that had never existed before his hospital admission. This infection spiraled out of control, and they utterly failed to detect or manage it properly.\n\nThroughout this time, Dr. Amlan Mandal and his team were dismissive, rude, and extremely difficult to communicate with. Every time we asked for clarification or questioned the declining health of our loved one, we were met with condescending responses like, \"Do you understand more than us?\". Dr. Mandal carried himself with an air of superiority, completely ignoring the legitimate concerns of family members who were watching a loved one deteriorate before their eyes.\n\nWhen the Ryles tube was inserted, my father visibly showed discomfort and distressmoving his legs, adjusting his posturesigns which were ignored by the medical staff. And because he was moved to the ICU, we were cut off from monitoring his care closely, unable to intervene or transfer him to another hospital once we realized things were spiraling out of control. We were simply told to wait and trust the processa process that ultimately led to his death.\n\nWhats even more disturbing is what one of the hospital staff told our family driver, who was crying on the day of the passing:\n\nThis hospital is nothing but a business. Its a place of death, not care.\n\nThat one sentence said everything we had felt but couldnt believethat our trust had been horribly misplaced. My father entered this hospital walking and talking, and within 10 days, he was gonenot because of the original condition, but because of the negligence, mishandling, and egotistical approach of Dr. Amlan Mandal and his team.\n\nThis review is not written out of impulseits a warning to families who are considering placing their loved ones under his care. Our biggest mistake was trusting him and this hospital. Please, dont make the same one."
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "SUMMARY\n\nmy old aged mother at 77 yrs was kept for 16 days in ICU & LOST her LIFE due to wrong promises & ignorance by Doctors & ICU team\n\nSTORY - unbelievable\n\nwith lot hopes & trust on Dr.Vivekananda Gajapati , we admitted my mother , 77 yrs senior old woman on 26.01.2025 who had breathlessness issue.\n\nDr.Vivekananda told us to go for open heart surgery & not to hear any words of my mother\n\nthe first day I told doctor - will keep my mother in ward & incase of breathlessness will need your observation & checkup\n\nbut Dr.Vivekananda straight away told we have to admit my mother to ICU only\n\ndue to bad experience in ICU earlier, we did not want but because of Dr pressure we admitted to ICU with only left TRUST\n\nmy mother was good first day, had good natural night sleep post many days wo any oxygen\n\n2nd night on 27.01.2025 > i just entered ICU accidently at 4am & found my mother struggling with breathlessness fully sweating , in dark, no AC & no doctors or nurses to attend her\n\nI Immediately called doctors & nurses & got nebuliser given & my mother was ok after 30min\n\ninsisted ICU staff to take care of my mother, going forward\n\n3rd night - at 10pm - mother started shivering with cold in the stomach while having dinner - all doctors & nurses rushed in , my mother got panic- tried to come out of the bed- shouting please discharge me.\n\nhe was forced to bed by nurses & doctors & gave sleeping dose & took my signature for ventilation & next morning on 29.01.2025 - I see my mother on ventilation- mouth shut - cannot express or disclose nothing from heart what she wants to tell\n\nventilation was supposed to be opened after 48 hrs by anistia Dr.pramod - but Dr.Vivekananda straight away declined & asked not to remove this ventilation till angiogram & surgery on monday 03.02.2025still 3 days to go as the senior surgeon Dr.Suraj was on leave till Sunday\n\nmy old aged mother (77yrs) was with only liquid food & was very weak till surgery day & got fever of 109 degrees\n\nbut still was taken for surgery in this BAD morher condition by senior surgeon Dr.Sai Suraj\n\nwe were told by Dr.Vivekananda also that all organs are working well except heart - will get resolved this heart issue also with this surgery done - gavelot of hopes\n\nhanded over my mother to Dr Sai Suraj & just washed his hands & responsibility\n\nDr.Sai Suraj operated my mother in 6 yrs & told operation successful - we all family were happy & thanked Dr.for this success\n\n2 days gone, , on wed 05.02.2025 , ventilation was replaced with oxygen - but post 4 hrs - my mother got unconscious & was again replaced with ventilator\n\nDr.Sai Suraj tells next day morning thu 06.01.2025I'm not there again for next 2 days & will return back on Sunday 09.02.2025\n\nwe got panic , my mother was this difficult stage & Dr is taking off\n\nDr Sai suraj gave us confidence that his team will take care of my mother well\n\nthe same day night - the ICU doctor Dr.Chandrashekar tells me - your mother is very weak was on ventilation before surgery last week & also aged - so she is not able to breath back\n\nI was shocked with this statement. Mother age is 77 hrs is already known from inception & my mother is weak because of ventation since last 1 week before surgery - was also known to ICU team\n\nTHEN WHY MY MOTHER WAS TAKEN FOR SURGERY , when all these were WELL KNOWN before ?\n\nmy mother CONTINUED further on same VENTILATION & was told will remove on monday 10.02.2025\n\nmy mother was feeling very weak without proper food & with MOUTH SHUT since 28.02 - 08.02.2025\n\ngot report on 06.02.2025 > Blood Urea & Infection is high - later controlled in next 2 days on 08.02.2025\n\nSuddenly on 08.02.2025 evening 6pm\n\nthe Anistia doctor calls us & tells my family\n\nYOUR MOTHER CONDITION WORSENING with Antibiotics not working & infection getting worsened.\n\nwe were SHOCKED with this statement\nsince 2 days we were told the UREA & Infection is controlling & suddenly this surprise statement\n.\n\nWe called Dr.Sai Suraj & Dr.Vivekananda- both just telling - our team is trying our best - but nothing happening from team & both Dpctors enjoying their week ends\n\nMY MOTHER HAD CARDIAV ATTACK in next 2 HRS & LOST HER LIFE\n\nWE FAMILY WERE WAITING FOR OUR MOTHERS WELLNESS IN NEXT 2 DAYS & GETTING SHIFTED TO WARD & DISCHARGING - BUT NH - SDM JUST IGNORED & KILLED MY MOTHER ( who refused to get admitted to SDM hospital & get operated due to bad early experience- we took a chance & we failed badly\n\nMany told us not to go with operation at this age of mother but still we TRUSTED Dr.Vivekananda Gajapati & went ahead - but we were WRONG & all others were RIGHT\n\nI learned 4 things today with this\n\n1) DO NOT OPERATE - POST 60 YRS &\n\n2) DO NOT OPERATE with WEAK condition & FEVER\n\n3) NEVER GO ON DR.WORDS -take RIGHT DECISION\n\n4) ALSO TAKE PATIENT OPINION - ITS THEIR LIFE\n\n-"
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "I am writing to express my profound grief and disappointment with the treatment my son received at Mazundar Shaw Medical Center, specifically under the care of Dr. Sunil Bhat. Unfortunately, my son passed away during his treatment, and I feel compelled to share my experience in the hope that it may prevent others from enduring similar hardship.\n\nMy son underwent a stem cell transplant at this hospital, and from the outset, we faced multiple complications, including severe fever, loose motions, and respiratory issues. Despite these complications, the treatment offered was inadequate, and the management of these issues was subpar, with no clear path for resolution.\n\nAdditionally, I found the hospital’s practices, including exorbitant medical charges and an overall lack of proper care, to be deeply concerning. The success rate of stem cell transplants, which I was told was only around 20%, is a significant factor to consider, and I wish I had been made more fully aware of the risks and the likelihood of success before proceeding.\n\nDuring the course of treatment, my son was subjected to high doses of medication and injections, which were not adequately monitored. It seems that the overdose of these medications may have contributed to his condition worsening, leading to his untimely death.\n\nI invested a significant amount of money—over 55 lakhs—hoping to save my child, but in the end, I lost him due to what I believe was both ineffective treatment and lack of proper care.\n\nI strongly urge anyone considering stem cell treatment at Mazundar Shaw Medical Center to think carefully and weigh the risks involved. My family and I were devastated by this experience, and I want to make sure that others are fully informed before making such a critical decision."
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "Good hospital for kids and neonatal care. Care given by the doctor and staffs are satisfactory. Affordable and recommended for childrens and parents"
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "Dr j.roychoudhury and other all staff except managers on duty Ramcharan and other m.o.d.s attitude is very rough.Serious matter which are written on form should be highlighted.Mrn no of my wife is 383875.They did not tell me that when patient will be shifted to o.t Andi i.t.u attendant should vaccant the room. My wife was shifted for o.t on 26/10/24 at 8am and I was told at 9p.m to vaccant the room by a security'sent by m.o.d.when asked them why is so ? They showed me one paper where those points are written.But my question is m.o.d should discuss such serious matter with patients attendant.My advice is pls.read all the paper before sign it."
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "At first we came here in this Hospital and we meet with doctor Uday khanolkar. he suggested for an angiogram. the doctor did the angiogram himself. when the angiogram was done, he said the condition of the patient is not so bad, no surgery is needed within 5 years, only take medicines and follow-up. After that he referred to Dr Devi shetty. When we met to Dr Devi Shetty, doctor said that it is emergency to replace aortic valve. Really it was very confusing and it was difficult to take decision either go for surgery or not. We need same decisions from all doctors.\n\nWell! the hospital is neat and clean. service is good. But for treatment it takes more patience for the patients. Bangladesh help desk is very helpful for the new Bangladeshi patients."
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "Long waiting hours to admit patient in emergency(minimum 2.5hrs to 3.0hrs)\nOne of the highest room charges for the semiprivate and private room(Semi private room: 8500Rs for each and 3 patient in that room, Private room: 15000Rs)\nLong waiting hours to get semiprivate or private room(Approximately 4Hrs)\n\nTotal waiting hours to get room is approx 7Hrs(waiting for emergency+ waiting hours to get room), if you will take regular follow up to get room or standing in front of Dr. then only people will get the room in 7Hrs, otherwise it will take more than that.\nCleaning was not up to the mark:\nDustbin was in open condition and small insect were flying above that dustbin. Cockroach problem in pediatric ward.\n\nOnly one time cleaning.\nNo facility available to clean the patient.\nIf patient was shifted ICU from Semi private or Private room, people has to vacate the room.\nWhere patient attender will go with the bags and other belongings. No answer for that.\nSupport staff behavior is very bad.\nNo support form administrative side. No one will give clear information.\nOnly one time Dr. will visit but no clear time, they can came any time in a day.\nConclusion: I felt, I am in government hospital but paying money like private hospital."
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "Visited on August 2024 for master health check and on reception lady named Shruti behaved worst.all the time she chanted in Kannada language\n\nRebuking us.we don't know kannada but seeing her gesture clearly understandable her worst behave.Also is package Department behaviour of Raghu Nandan is intolerable. He suggested my Bangladeshi friend to fly in his country if he has shortage of money.extremely harsh and worst behaviour ever seen in indian hospitals."
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "Mera papa ko surgery ke baad icu se general ward mein sift kia but waha ke staff itne irresponsible hain woh thik se take care bhi nahi karte hain or humne complaint kia unka toh woh aaye humse sab janne ke liye humne sab bola toh incharge of nurse woh boli action lengi unke upar but sabse worst part tha ki jab doct. Mere papa ko aaj discharge kar diye toh waha ki ek nurse bolti ki inko aaj rahne do toh doct. Bhi bole fir kal morning mein kar denge but unhone signed bhi kar dia diets bhi ready kar diye par woh nurse ke wajha se ajj discharge nahi dia par hume tension hain ki agar woh papa ke sath kuch ulta sidha na kare ish wajha hum bhi bahut tension mein hain bas morning ka wait kar rhe hain…."
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "I recently had the opportunity to visit Dharamshila Cancer Hospital, and I must say the experience was both comforting and reassuring. The hospital is well-equipped with advanced technology, and the medical team is highly professional and experienced in their respective fields.\n\nFrom the moment you step into the hospital, you are greeted with warmth and compassion. The staff is incredibly supportive, making sure that both patients and their families feel at ease during what can be a very challenging time. The doctors take the time to explain every aspect of the treatment plan, addressing any concerns or doubts with patience.\n\nOne aspect that particularly stood out was the hospital's emphasis on holistic care. They don't just focus on treating the disease but also on the overall well-being of the patient. The availability of counseling services, nutritional support, and various wellness programs is a testament to their commitment to comprehensive care.\n\nThe hospital's infrastructure is modern and clean, ensuring a comfortable environment for recovery. The nursing staff is attentive, and the administration is efficient in handling appointments, billing, and other formalities.\n\nOverall, Dharamshila Cancer Hospital provides a beacon of hope for those battling cancer. Their dedication to providing quality care, combined with their compassionate approach, makes it a place where you feel confident in the treatment you or your loved ones are receiving.\n\n---"
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "Don't go to this hospital . bcozilaaj ke naam pe bass paise lute jate Hain.. or doctors vi apko drake or test Krane ko kehte hain and that time aap kuch keh vi nhe skte..baat rheProblem solving to worstso Don't go here at all."
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "Recently visited(on 01-July-2024) this hospital for vascular surgery. Done too many tests(Blood test Urine Test ECG Echo Xray Scanning for legs) which are overpriced. Totally 16000 rupees charged for all tests. additionally charged 4900 rupees for stockings. Where as other hospitals are giving it for free after the surgery is done. Each doctor consultation is 1100 rupees. For checking all the reports and BP they charged 1100rupees. For surgery they do have packages. For me the final and estimated cost was 230000 rupees. Since the cost of the surgery is more I haven't admitted at Narayana. They do have NH care App for the report results and doctor appointment bookings. Since I didn't go for surgery at Narayana Health they have removed all my report results from the app. I wasn't able to view any of my test reports from that app. And they have never given any access to my test reports. Called customer care number and requested for the reports. They asked me to visit the hospital for any help required.\n\nAdmitted to different hospital and the same surgery was done with the half of the price what Narayana Health was charging. Stockings were provided at free of cost. Transportation was provided. Picked up at my home location and dropped me back after surgery at free of cost. Appointments and timings are just for show off. You won't get your doctor appointment at the specified time. One full day is required to meet doctor and to come out of the hospital. Unnecessary tests will be done for a high price.\n\nNarayana Health hospital is money minded."
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "Fully money looters. there test charges are much more compared to Dr Lals pathological laboratory. Doctors get commission and incentives based on the tests prescribed.\n\nDoctors use the fear factor to scare the patients and to take out money.\n\nYou can see a bunch of silly Bangladeshi patients who are fooled here."
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "My mother in law was mismanaged by this hospital run by Devi Prasad Shetty. Most of the hospital is run by medical students than credible doctors. Specialists mostly spend 1 mins per patient and not on diagnosis or solving patient's problems but on training their interns on somebodies life and death. Patients families who are already on emotional rollercoaster ride are fed with stories of one pointer hope so that they can carry on paying the bills on false hopes. Once the doctors hit their revenue target per patient. They stage the death and the body is let go. Everyone who is reading this review, if you want to save your family and bring them home alive dont take your family member to this hospital. Try your luck in some other hospital."
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "Doctors gives time only for couple of mins, quickly comes to a conclusion and prescribe next steps. Tests like MRI, USG, endoscopy are completed in few mins. I am highlighting this based on my many experiences with other hospitals like CMC Vellore, Medanta, Fortis, Apollo, Max, Sakra, etc. My recommendation is to visit hospital that is well established and reputed brand for better satisfaction and value for money. Don’t recommend this hospital especially if you really care about yourself or dear ones."
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "I recently had the opportunity to experience the comprehensive care provided by RN Tagore Hospital for Robotic Assisted Lap Hysterectomy and bilateral Salpingectomy, and I am pleased to share my exceptional experience from admission to discharge.\n\nWe were recommended by Dr Asish Kumar Ghosh.From the moment we entered the RN hospital, the admission process was seamless and efficient. The admission personnel were professional, courteous, and extremely helpful. They guided me through the necessary paperwork swiftly, ensuring I understood each step of the process. Their empathetic approach made a potentially stressful situation feel manageable and straightforward.\n\nOnce admitted, the care provided by the nursing staff was nothing short of exemplary. The nurses were not only highly skilled but also incredibly compassionate. They attended to my needs promptly and with great care, always making sure I was comfortable and well-informed about my treatment. Their dedication to patient care was evident in every interaction, and they went above and beyond to ensure my well-being.\n\nThe hospital staff, including the doctors and support personnel, demonstrated a high level of professionalism and expertise. The doctors were thorough in their explanations, providing detailed information about my condition and the upcoming operation. They patiently answered all my questions, which greatly alleviated my concerns and built my confidence in the treatment plan.\n\nThe RN Tagore TPA (Third Party Administrator) Mr Pradip Kumar Saha and team at RN Tagore Hospital deserve special mention for their efficiency and supportive attitude. Navigating insurance processes can be daunting, but the TPA team handled everything with remarkable efficiency. They communicated clearly about the coverage, facilitated smooth transactions, and ensured that all necessary approvals were obtained promptly. Their assistance was invaluable in making the financial aspects of my hospital stay as hassle-free as possible.\n\nThe surgical team with Dr Asish Kumar Ghosh and Dr Satyadip Mukherjee displayed an impressive level of competence and coordination. My wife's operation was conducted with precision and care, and I felt reassured by their confident and professional demeanor. Post-surgery, the nursing staff continued to provide excellent care, ensuring a smooth recovery process.\n\nFinally, the discharge procedure was handled with the same level of professionalism and care that characterized my entire stay by Mr Arpan ke Bera and Ms Sukanya Muhuri and team. The discharge personnel ensured that all formalities were completed swiftly and that I received clear instructions for post-discharge care. They also arranged a follow-up schedule and provided contact information for any post-discharge queries, ensuring a smooth transition from hospital to home.\n\nIn summary, RN Tagore Hospital exceeded my expectations at every stage. The combination of skilled medical care, compassionate nursing, efficient administrative support, and comprehensive discharge planning made my experience outstanding. I highly recommend RN Tagore Hospital to anyone seeking high-quality medical care."
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "Worst hospital. They just do business here. People go there for any kind of treatment regarding heart they just try to convince you to do angioplasty. I've lost my father here last month, they tried to do business till his last breath. From management to doctors everyone is corrupted here. Dr. Gaurav Agarwal did the OT of my father, I've called him after 6pm to ask about my father's condition he simply replied \"it's my family time, I can't talk right now.\" On Sundays all the specialist doctors are on holidays, patients are kept on observation of some untrained RMOs. I will have the regret for lifetime that I have admitted my father here."
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "It was around 10 clock while we reached the hospital there were no doctors and people were so rude. Also the bill was 28k for just 3 hour. Looted us even the deposits amount was not returned . Shameless people they does all broker jobs. Including staffs were rude . Shame of such useless hospital."
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "Incomplete information provided by call centre executive, as a result my total planning of the day go to vain.\n\nVery pathetic service. Better to visit at hospital and get the information."
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "I had typhoid but they were giving treatment for covid. I had very little cough and my reports were saying i had typhoid still a moron sujith ms was giving me swine flu antibiotics. In 2 days they given so many antibiotics. It is big paragraph of antibiotics. They taken out somehow fake covid report and didn’t tested typhoid. I took forcefully discharge and went somewhere else for treatment.\n\nWhen i took forcefully discharge there duty doctor comes and said if you are going against our advice your cashless insurance will not work you have to pay in cash.\n\nAfter 2 days they sent me a report saying you have typhoid take medicine from a clinic.\n\nThey hidden my report of typhoid such a fraud people they are."
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "I have worst experience. Please do not visit . This hospital will keep patient life in danger for ever . I visited gynae department and got caesarean and then within couple of months my had complications and I have to undergo another surgery . Any village level doctor is much more trained than these Narayana doctors . Don’t get trapped . It’s just business and no treatment . Waste hospital ."
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "I had CKD so went for consultation with dr.suma raju who is nephrologist in narayana HSR layout...her voice is like she is tired and woke up from the sleep...she keeps on giving same bloody tablet for proteinurea but it was still more increasing instead of getting low...she doesn't know to give proper treatment bc she said by food u cannot control proteinurea...!!!\n\nLuckily I got into ayurveda treatment and miracle is happened...since 5 months I was on tablet with this doctor but it's of no use at all...within a week in ayurvedic medicine my proteinuria dropped from 2.49 ratio to 1.65 due to food diet and their medicine..!!!\n\nGuys never go to do called English allopathic treatment plzzzzz...go to ayurveda u wil live ur life with happily instead of spoiling ur money and time!!!...."
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "My aunt got her CSF procedure done at the HSR Narayana based on advice from Dr Anush Rangarajan who works out of the main Narayana Hrudayalaya. 3 tubes of spinal fluid was collected and we were told to expect the result the next day by afternoon. We waited 2 days before approaching the HSR hospital for results. Imagine our horror and surprise when the laboratory which was on the 4th floor of the same hospital told us that they have not received the spinal fluid for testing. We spoke to the Manager on Duty and he tried to trace the whereabouts of the fluid and then acknowledged that he did not know where it is. He told us that they had a spare fluid tube which was kept in freezer which they will send for testing.\n\nMy questions\n\na) How do we know it is my aunt's spinal fluid they are now sending for testing?\n\nb) How do we know the fluid taken 2 days ago and now sent for testing will give correct results?(Integrity of the result)\n\nc) Dr Anush had asked us to get the test done asap. But results are delayed due to Hospital's negligence\n\nThe hospital has not bothered to even call to apologize for the negligence and have chosen to remain silent."
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "I had booked a slot with paediatric Dr. Anil Sapare on February 5th 2024 for my infant daughter at 6:30PM through NH Care mobile application well in advance almost 4 hours prior to the scheduled appointment time, and also had made payment of Rs 1200 (100 for registration + 1100 for consultation). However on visiting the hospital at around 6 PM we were informed that the doctor cannot attend us as he has to attend some emergency even though he was at his room. They said there is some technical glitch in the app because of which we got the slot, and refused to attend my baby. They didn't even have the ethics to refund the whole amount. After requesting them they have now just initiated refund of rs1100 (rs100 is non refundable they said). Still awaiting the refund to my account. They have wasted our precious time causing more discomfort to us. Planning to file case in consumer court regarding this."
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "Rude and unprofessional front desk staffs (especially the person sitting in front of room 6)\n\nPatients are waiting for the doctors more than 5 - 6 hours and none of the staff giving a proper answer"
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "Worst hospital in Guwahati. Doctors and nurses don't even know the basic etiquette and behaviour to deal with patients.They lack transparency and deal very rudely with the patients and torture them mentally.The patients live in constant psychological fear and want to run away from such a hospital.The nurses are not even well-trained to deal with the patients and do not offer food to the patients for fear of cleaning the vomit.Please be careful and stay away from this hospital and save a life.I lost a precious life due to medical negligence . I will never recommend this hospital to anyone."
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "He had a sudden heart attack and immediately took here.within 1 month got his dead body.they are killing."
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "Very very very worst. Team of doctors not answering properly. Specially for cancer patients all doctors are killers murderers giving heavy doses of chemotherapy and killing childrens. Specially the icu doctors are most planned murderers after death of child not giving the body also if u don't pay full money to them"
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "Very good we'll staff management. Really liked the way they treated us. N the infrastructure is also very good."
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "Very good Dr. Team. Dr. Bipin Ghanghurde has performed my baby hand surgery very nice and i am happy and fully satisfied. Thanks a lot Dr. Bipin and his team. Thanks to all hospital staff for kind of support."
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "Not any experienced doctor !! Avoid this hospital bcz no good supplements ! My problem not fixed !!!"
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "Simply go for the unwanted tests and treatment is worst. If the patient is serious I don't recommend this hospital. Make sure insurance amount utilized fully without giving treatment"
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "0 star Only, , , killer Hospital, No manarism..Worst one.\n\nDont refer this hospital to any one.\n\neven no proper caring in ICU and ventilator patients. its worst condition. only two nurses are take care the 20+ ICU and ventilator patients. And Nurses are doing work more than 12 hrs. So how they care the patients.\n\nWorst management...Money munded hospital.\n\nDon’t run hospital in a God name."
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "No proper management system is available. Nursing care and treatment is deplorable. No proper communication between doctors for a patient, nurses and attendants are careless, dietitians are nonsense, not well trained. They gave my father curd in lunch when he was suffering from 103-104 F fever. Attendants are lier. They give wrong information only for controlling the family of the patient. My father had been admitted there with urosepsis and he was a very critical patient with previous history of ependimoma. His condition deteriorated there. He got no care there. The total medical management system is a joke there. Medical malpractice is also present. We got no proper test report too. At the time of discharge no instructions was given from the doctor or the relevant official. They diagnosed in wrong way. This hospital is a gateway of death. I have admitted my father now in another hospital where the management is proper. I will NEVER recommend Narayana Hospital to anyone. NEVER EVER."
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "Doctor good ...but male word nurses very bad very neglect l hate male word nurses.. very very bad nurses plz action hospital MD plz"
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "My aunt was admitted there, she felt terrible by the behaviour of the nurses and doctors also. Food quality is very very poor and charges OMG\n\nare touching the sky...If someone admitted there they will charge you minimum 30K for just admission and sitting on their bed. They are ysing the people's compulsion as a weapon to loot them.\n\nExtremely Bad"
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "My father was admitted in this hospital for a surgery. At initial stage, the doctor mentioned about the financial package for the entire process of the surgery. We added another few thousands on top of the package amount. But surprisingly, they started charging separately which was never mentioned to us or discussed. For an example, the OT timing has increased all of a sudden, after taking my father to the OT, the anaesthetist came with a form saying that the patient needs to be shifted to the ICU after the surgery and we have to sign the consent form for that. I wonder why this was not mentioned to us and why at the very last minute when the patient party has no option remain. Even if they used only one medicine, the bill was included the whole strip of that medicine. This happened in every single case.\n\nThe worst experience ever and will not recommend anyone."
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "Few days back mu uncle got admitted for stunt replacement in Narayana hospital and we were so worried about their health. But the staff and facilities are so good that my uncle is now very well and doing his routine work."
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "I wana share you today bad experience about in this hospital.. We plan to surgency of 3days ago and i get all the reports and counselling to get particular Department.. All those processes follow to doctors instruction. Corporate insurance also we process in insurance section so that one get postive approved so i was admitted on 31/07/2023 midnight around 8.30 pm to delay process in Admission..Next day we plan to surgery but suddenly particular department doctor's told me we will discharged without reasons iam fully disappointed.. and thers doctors also not ready to listen concern words he is told me discharged.agian we wil speak with Higher Management will explained wht problems it happen department side then only consider to accept surgery. My surgery it happen around 12 to 3 pm and next day will move to word. Once i reached ward incharge person told me discharge to do immediately around 11 o clock and again some one told me your discharged cancelled.. Nobudy not respond properly wrost rudeless. Not communities property with attended.. This point was suffer patient and attendeder also.. Totally i feel wrost service this hospital only make money minded. Nobudy caring patients issues there problems also will not consider.\n\nPost surgery also here done.. That's why one more surgery will move NH but here now feel totally differt persons mindset.. I feel very bad.."
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "I am visiting RN Tagore hospital since 2017, but now there treatment is very bad, DR. SISIR KR PATRA AND DR. SANDIP PAL , both the doctors are very bad still they haven't identity the problems, but they have done 100+ tests. Their behavior, attitude are very rude and poor mentality. They are only focusing on tests, revenue and lengthy treatment procedure. Within 1.5year I have admitted the same patient for three times due to blood loss and minimize hb%, still they are failure to rectify the problem. Patient hb% is 3.6 during their treatment process. Both the doctors has not visit IPD also, they are only doing different tests.\n\nI will complain overall my experience with state govt and other governing body also"
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "Good team work overall happy with the services good nursing service also aruna I am happy with bda clinic"
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "Our country has been getting doomed by such worst hospitals who destroy people. We had a minor procedure for our kid for 2 days and the bill came to Rs90000+ . They gave zero support to the patient and bystander and facilities were absolutely bad for the price they charge. They over billed on everything as soon as they knew we had insurance. If this is the kind of looting our country allows without setting up any governance over it we are all doomed. Please avoid this hospital and rather choose others"
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "Very good treatment by Dr Gopal D, general medicine, and also good facilities, all facilities and test are done here, many departments are here, I'm happy about this hospital and hospitality"
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "Very good treatment, Hospitality, good care co ordination, excellent services, good nursing staff'sgood"
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "Very good Hospitality, very good staffs, well trained care coordinator s, good facilities, im so happy"
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "Very good treatment by Dr Shivakumar sir and darshan sir.both are treated very well.and also good care co ordinate staff,"
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "Hospital is good...staff is very good n specially Rooplekha Baruah .....I am giving her 5 star for her respond and behaviour..as well as her caring nature.Thank you very much to Dr Midul ch Bharali, Rooplekha Baruah as well as the whole staff."
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "Possibly the worst hospital. I got admitted & was relieved in 3 days. The management is the worst. They are their to just take money out of the patient.\n\nFood is not eatable tasteless & just water n spices in most of the dishes. Services is bad, smell of the urin in bathrooms & Rooms are below average.\n\nWhen I wanted to book a free follow with the doctor they started to ask for money on app & their helpline number though it’s written everywhere that follow-up within 6 days is free.\n\nThey are just MONEY Drinking LEECH that don't bother if patient die or is serious. They are just concerned about money & how can they make the life of patient & their families hell."
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "My experience was very bad with department of Orthopaedic. Dr. Prashant B N had asked me to do MRI of my knee on 25/04/2023 . I did the MRI . I went to orthopaedic department on 26/4/2023 and 27/04/2023 both day respectively for Dr. Prashant B N to show my MRI. But that is very unfortunate for our station that only junior Dr checked tmy MRI and asked me to go for ACL surgery. I am from West Bengal and went there for senior Dr. but junior Dr. suggested.\n\nI had online appointment. I went there on available date of Dr. Prashant B N . I think they are behind the money more over treatment. By the way thank you for such great experience"
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "We came hare from kuch Bihar for my father treatment Dr Sharath damodar he gave us good suggestion n analysis to my father docters are very helpfull and kind entire hospital staff TQ all"
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "We are from maharashtra we came here for treatment to my son after coming here we meet Dr sunil bhat he gave good suggestions to my son I would like to thanks all msmc team for ur support."
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "We are under docter pragnya coca she has given good advice and treatment to my patients i would like to thanks all that majumdar staff especially suzen she helped us lots we are happy"
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "Too much unnecessary tests are recommended, without reason. They refer interdepartment refer to increase bills.\n\nTest and kits are very very expensive."
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "My Mother diagnosed with Stage 4 Non Hodgkin's Lymphoma.\n\nDoctor explained the situation to us exactly and clearly.\n\nHe knows his job very well. He is very calm and composed doctor.\n\nResolves all our queries.\n\nAfter taking his treatment my mother is into complete remission and I hope she will win her war against cancer.\n\nTry to listen what doctor is saying and educate yourself about the disease by watching YouTube channel(from doctors, patient's etc), reading research papers and build your expectation accordingly and take care of your loved one's.\n\nI am satisfied from the treatment given to my mother."
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "My husband admitted under Dr Kiran, Dr Rakshith referred to narayana hospital for further treatment now my husband seems to be well and the hospital is well and hygiene. overall is very good thank you."
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "I visited Narayana Multispeciality Hospital in Harikere to get endoscopy done under guidance of Dr Shivakumar. It was well maintained hygienic, the staff, nurse were calm and composed, they made sure I don't feel any pain during endoscopy. I had been suffering from severe vertigo's emerging due to gastric problems, after finding out the root cause which is H pylori, they gave me medicines which cured my disease within a month. I cant thank Dr shivakumar much enough because he was a god who helped me cure my disease. I would recommend people to visit narayana hospital as they have excellent modern techniques for diagnosing diseases."
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "This hospital gives excellent service with heart touching experience. You can refer your close ones for better treatment"
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "Recently went there just for a catheter change with all required materials purchased by self. inspite of this just a catheter change costed me 1360. This is daylight robbery"
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "We came from West Bengal for treatment to my wife after coming here we meet Dr akshitha shing docter has suggested good treatment to my patients and all msmc staff are very kond and helpfull tq so much"
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "We are from bangladesh came to meet docter suman mb he has suggested good suggestion to my patient and now am going for keemo prociduer doctwrs staff are very good and kind tq"
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "We are fully satisfied with majumdar shaw treatment docters are very good and all the staff are very kind and helpfull tp"
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "We meet docter vijay pillay his so good and polite and all the majumdar shaw hospital staff are wonderful and kind will visit again"
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "Not sure which name suits this hospital best. Highly understaffed. Staff attitude is worst because they are over worked and no motivation. Will make you to solve the puzzle how to get admitted. While you are doing this you will start experiencing stress mentally. Heart normally with start racing. Came and booked a bed on Friday 24 March morning for 78 year old mother for 28 march and we were made to sit for 4 hours. Mom is diabetic and she had to be given food. Insurance desk is dangerous. If you have insurance go there. Else you will need hospitalisation after dealing with the crooks there. The agency asked them to write the policy number clearly and they have no way of knowing that there is a reply. We have to go and tell them to check their inbox and they are supremely skilled to send you away with the query making it look complex so that you are put their sight. Terrible dept. Overall a pathetic hospital which cannot qualify for treatment. Stay away."
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "RN Tagore Hospital is a compassionate and fully equipped multispeciality hospital that provides accurate treatment at affordable rates. The doctors and staff are helpful and ensure that patients receive the best possible care."
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "Best hospital cancer staff docters very helpfull and kind so caring and loving , this is my first visit but am very happy with majumdar Shaw service tq all"
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "We are doing treatment under Dr sumane mb sir he has given a good suggestion and analysis to my son we are very happy with majumdar Shaw staff doctors all are very supportive"
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "We came from bangladesh for my father treatment we meet dr pragnya coca and some others docters also they are very good and all the majumdar shaw staff are very kind and helpfull I would like to thanks all of you."
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "It's really great to have a doctor like Kundan Hazarika sir. He is a man of honesty and sincerity. He treated my mom very well and only bcz of him today my mom is safe. He is a very descent doctor and am lucky to have him as my mom's doctor. Thank u so much Dr Kundan Hazarika sir"
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "Faced issues at first with the CT Angio test, but it was resolved by one of the seniors.\n\nEmployees need to communicate better with the patients."
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "Very good hospital for cancer treatment docter are very good all staff are very helpfull and kind majumdar shaw hospital is best for cancer ."
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "We are from bangladesh we came here to Treatment fir my wife we meet docter they are very helpfull kind all staff are very helpfull tq so mch to entire msmc team."
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "We came from West bangal for treatment my mom is suffering from diagnosis after coming majumdar shaw hospital we meet docters they gave us good suggestion and treatment to my mom now she's bit fine tw everyone"
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "Very good service am under docter nidhi Tandon she has given us good treatment and suggestion to my patient we are vry happy with majumdar Shaw service TQ"
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "Hello Everyone\n\nI have been admitted to Narayana Multispeciality Hospital in Kolkata in 2014as I am suffering from Colastic Jaundice (Fluctuating Bilorobin)as well as my both the legs are vibrating and I had itching problems throughout my whole body.Ihad been admitted at HDU for treatment. I am under the Doctor named Mr. S Pal who is a specialist in this section. Also the nurses behaviours are caring. One more important thing is that behind each bed there is a switch, if any patient wants to call the nurses (both male and female)he/she can press the bell anytime.\n\nWhen I had been admitted my Bilirobin showing as 20 but staying under treatment for 10 days my Bilirobin falls to 4 respectively.\n\nI was given Ice bump in my legs for 9 days and from the 10th day I feel no problem in my leg. For itching problems an ointment was provided to me. I had gone through MRI as well as blood tests too. The hospital is clean enough.\n\nThe infrastructure of the hospital is quite satisfactory but the fees of the hospital is expensive.\n\nAfter 10 days I was released from the hospital and advised by the doctor to take rests.\n\nAfter 1 month also my Bilorobin was at 4. Thereafter I moved to CMC, Vellore for further treatment and got 100 percent cured from there.\n\nI may suggest that you too can admit yourself or your nearest ones at NarayanaMultispeciality Hospitals for better treatment.\n\nThanks For Reading."
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "We camr From bangladesh this is my first visit with majumdar shaw hospotal we meet docter pragnya coca she is very good and hospital staff very helpfull friendly tq so mch"
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "We came from bangladesh treatment for my daughter to majumdar shaw cancer center web meet doctors suman mb he has given us good treatment andb suggestion myb daughter tq so mch"
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "This is my first visit with majumdar shaw hospital for my daughter we meet docters they are very good and all hospital environment is good staff nurses all are very polite and helpfull tq"
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "We came from west bengal to meet Dr akshitha shing she has given us good suggestion and anayllis to my patient we meet doctors everyone are very good and polite thank you majumdar Shaw"
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "We are doctor under suman mb he has given us good treatment of my mother doctors and staff are very helpful and kind thanks to majumdar Shaw.and entire team."
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "We are under doctor pragnya coca she has given us good suggestion and treatment to my father this is my forth visit with this doctor and hospital staff leanness every thing is so good"
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "We are from bangladesh from past 13 years we are doing treatment under majumdar shaw hospital under docter akshitha singh treatment ia very good and docters are very good staff all very kind and polite helpfull tq Everyone"
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "We are under docter pragneya coca she has given good suggestions and treatment to my patient we are very much happy with majumdar shaw service"
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "Excellence service docter and staff all are very helpful if you anyone thinking to visit this hospital majumdar shaw just go for it without doubt."
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "This is my first visit with majumdar Shaw hospital it's very good and all the docters staff are very helpful and kind they helped us lot TQ ."
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "I had great expirence in majumdar shaw hospital docters treatment staff are kind friendly and helpfull tq so much"
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "I have visited this hospital and i have recived good service and i am satisfide thank to all thank you"
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "I have visited thus hospital and i have received good service thanks to all the doctors are good and staff also good"
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "Very good hospital for cancer treatment we are under docter has has given very good suggestion and analysis to my patient thanku msmc"
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "This is my third vidit with majumdar shaw hospital we are getting very good treatment we are under dr pragnya coca she is very nice and all the staff are very good tq"
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "My granny is doing treatment under Dr pragnya coca Nidhi Tandon mam they are very good and all msmc staff very good friendly helpfull TQ so much"
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "This is my second visit with majumdar shaw we meet docter peagnya coca she is very good and thanks to entire nh staff for your efforts"
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "We are from Bangladesh we came here for my treatment me meet docter Nidhi Tandon she is very good and entire nh team are very helpfull and kind TQ so much."
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "I have visited this hospital and I have reviewed best treatment and good experiences all doctors are very good including staff thank you all"
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "Am rajesh debnath ..i came to hospatal to consulte i got good service ...thank you narayana ..thank you once again"
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "Great hospital. Mazumder shaw hospital service is too good. I am very happy. Clean hospital with good service."
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "I have good experience. There all staff Are very Help full. There are lot of Bengalis. They are so co operative."
    },
    {
      "source": "MouthShut",
      "hospital": "Narayana",
      "review": "This is my second visit with narayana health I got very good treatment and suggestions for my wife i would i like to thanks all nh staff are very kind helpfull"
    },
    {
      "source": "JustDial",
      "hospital": "Narayana",
      "location": "Dharamshila Narayana Superspeciality Hospital",
      "review": "Sabse bekar hospital hai mariz ko marne ke liye chod dete hai or apna bill banate hai be wajah inko sirf pese payare hai or staff or doctor ek daam bekar hai baat karne ki tamiz nahi hai garib se khali pese aeth te hai"
    },
    {
      "source": "JustDial",
      "hospital": "Narayana",
      "location": "Dharamshila Narayana Superspeciality Hospital",
      "review": "Worst hospital ever. Firstly get your investigations dobe somewhere else because it cost us 20200 for a CT scan. Then Dr. Pranav filed a report that we are not eligible for insurance policy after them telling us that we would have everything eligible for insurance. Dr. Pranav and the whole administration staff is the worst and i hope no one ever comes here for treatment of their loved ones."
    },
    {
      "source": "JustDial",
      "hospital": "Narayana",
      "location": "Dharamshila Narayana Superspeciality Hospital",
      "review": "Was admitted for THR without going through the patient`s case history and then discharged after 4 days charging over 1L for doing nothing"
    },
    {
      "source": "JustDial",
      "hospital": "Narayana",
      "location": "Dharamshila Narayana Superspeciality Hospital",
      "review": "Dr Mayank gupta is very humble and look after the patient very patiently,so we are very much satisfied with your service"
    },
    {
      "source": "JustDial",
      "hospital": "Narayana",
      "location": "Dharamshila Narayana Superspeciality Hospital",
      "review": "My son was rushed to Dharamshila Narayan Hospital on 5th September 2025 when he sustained a freak injury on his chin. He was bleeding profusely and was in acute pain. The admission in emergency care did not felt like `` Emergency `` at all. After a lot of back and forth, which amounted to a couple of hours, Dr Dimple Arora , a plastic surgeon was called in to attend my son. Even as my son was being administered lacal anesthesia for the plastic surgery, which had been advised by Dr Dimple Arora . But to my..."
    },
    {
      "source": "JustDial",
      "hospital": "Narayana",
      "location": "Dharamshila Narayana Superspeciality Hospital",
      "review": "Billing was done,sample was taken,unfortunately they forgot to do hb1ac test.i m sad and surprised.my phone no.9773918346,Vijay Kumar 57 naval apartments Vasundhara enclave Delhi 96.today sample was given."
    },
    {
      "source": "JustDial",
      "hospital": "Narayana",
      "location": "Dharamshila Narayana Superspeciality Hospital",
      "review": "My experience at Dharamshila Narayana Superspeciality Hospital was excellent! The customer service was outstanding, with caring staff who ensured a smooth process. I faced minimal wait times, thanks to their organised system. Regular doctor visits kept me well-informed, and the hospital`s well-connected location made it easily accessible. Highly recommend!"
    },
    {
      "source": "JustDial",
      "hospital": "Narayana",
      "location": "Dharamshila Narayana Superspeciality Hospital",
      "review": "Bhai is hospital main kabhi mat jaana sabse bekar hospital hai inko paiso say pyaar hai mareez say koi pyaar nhi hInhonai  staff bhi bohat attitude main rehta hai misbihave lartai h doctors bhi patient say"
    },
    {
      "source": "JustDial",
      "hospital": "Narayana",
      "location": "Dharamshila Narayana Superspeciality Hospital",
      "review": "Few days ago I was visit first time in emergency regarding dressing . All staff are very good. Doctor also seen my woundSpecialy thanks to Sachin mandal.  I really happy his carefully dressing and behaviour."
    },
    {
      "source": "JustDial",
      "hospital": "Narayana",
      "location": "Dharamshila Narayana Superspeciality Hospital",
      "review": "I came to the hospital today and met orthopedic coordinator Pooja and Pooja  helped me a lot in getting the x-ray billed and Pooja also took me to the doctor very quickly, thank you Pooja ji"
    }
  ],
  "review_count": 110,
  "news": [
    {
      "source": "Brave News",
      "hospital": "Narayana",
      "headline": "Narayana Health, Bangalore, to Organize One of the Largest HLA Testing Camps in Eastern India for Thalassemia Patients in Kolkata - The Tribune"
    },
    {
      "source": "Brave News",
      "hospital": "Narayana",
      "headline": "Narayana Health expands to UK, acquires Practice Plus Hospitals"
    },
    {
      "source": "Brave News",
      "hospital": "Narayana",
      "headline": "Narayana Health Partners with Athma to Streamline Patient Care"
    },
    {
      "source": "Brave News",
      "hospital": "Narayana",
      "headline": "Narayana Health Launches Arya Health Plans with Coverage Up to INR 1 Cr"
    },
    {
      "source": "Brave News",
      "hospital": "Narayana",
      "headline": "Narayana Health: A Journey of Transformative Healthcare"
    },
    {
      "source": "Brave News",
      "hospital": "Narayana",
      "headline": "Narayana Health unveils Rs1Cr health insurance for Rs29/day"
    },
    {
      "source": "Brave News",
      "hospital": "Narayana",
      "headline": "Narayana Health | Cisco Meraki"
    },
    {
      "source": "Brave News",
      "hospital": "Narayana",
      "headline": "Narayana Health City Becomes the First Private Hospital to Introduce Advanced Blood Testing Facility, ID-NAT"
    },
    {
      "source": "Brave News",
      "hospital": "Narayana",
      "headline": "Narayana Health achieves greater patient care and operational efficiency"
    },
    {
      "source": "Brave News",
      "hospital": "Narayana",
      "headline": "Innovation: Narayana Health ties affordability, quality - BusinessToday"
    },
    {
      "source": "Brave News",
      "hospital": "Narayana",
      "headline": "Narayana Health's tech choices aimed at efficient patient care, infrastructure, better clinical care quality: Group CFO Sandhya J, ETHealthworld"
    },
    {
      "source": "Brave News",
      "hospital": "Narayana",
      "headline": "Narayana Health Leading Cardiac Care in Bangalore Contact Number - hospitals-info.in"
    },
    {
      "source": "Brave News",
      "hospital": "Narayana",
      "headline": "International Patient Services Testimonials - Narayana Health"
    },
    {
      "source": "Brave News",
      "hospital": "Narayana",
      "headline": "Narayana Health City inaugurates Advanced Simulation Centre, dedicated to training ICU nurses, ETHealthworld"
    },
    {
      "source": "Brave News",
      "hospital": "Narayana",
      "headline": "Narayana Hrudayalaya to invest ₹900 Cr in a new multi-specialty hospital in Kolkata."
    },
    {
      "source": "Brave News",
      "hospital": "Narayana",
      "headline": "Narayana Health Insurance offers ₹1 cr coverage for surgeries - Healthcare Radius"
    },
    {
      "source": "Brave News",
      "hospital": "Narayana",
      "headline": "Narayana Health: Low-Cost, High-Quality Tertiary Care"
    },
    {
      "source": "Brave News",
      "hospital": "Narayana",
      "headline": "Narayana Health’s Aditi Insurance looks to bridge the Coverage Gap for Working Class — Healthcare Executive"
    },
    {
      "source": "Brave News",
      "hospital": "Narayana",
      "headline": "Narayana Health partners with ClearMedi Healthcare - Express Healthcare"
    },
    {
      "source": "Brave News",
      "hospital": "Narayana",
      "headline": "Narayana Hrudayalaya: A Model for Accessible, Affordable Health Care? - Knowledge at Wharton"
    },
    {
      "source": "Brave News",
      "hospital": "Narayana",
      "headline": "Narayana Health Acquires UK-Based Practice Plus Group, Expanding Global Healthcare Presence, ETHealthworld"
    },
    {
      "source": "Brave News",
      "hospital": "Narayana",
      "headline": "corporate-partner-narayana-health - annapoorna"
    },
    {
      "source": "Brave News",
      "hospital": "Narayana",
      "headline": "Narayana Health uses data analytics and AI to provide affordable, high-quality healthcare - Microsoft Stories India"
    },
    {
      "source": "Brave News",
      "hospital": "Narayana",
      "headline": "Narayana Health Expands into UK Market with Acquisition of Practice Plus Group - Observer Voice"
    },
    {
      "source": "Brave News",
      "hospital": "Narayana",
      "headline": "Narayana Health buys UK's Practice Plus Hospitals - The Economic Times"
    },
    {
      "source": "Brave News",
      "hospital": "Narayana",
      "headline": "Narayana Health buys UK’s Practice Plus for Rs 1,930 crore to expand global footprint"
    },
    {
      "source": "Brave News",
      "hospital": "Narayana",
      "headline": "Biostate AI's Indian Subsidiary Bayosthiti Partners with Narayana Health to Build World's Largest India-Specific Cardiac AI Dataset | Morningstar"
    },
    {
      "source": "Brave News",
      "hospital": "Narayana",
      "headline": "Narayana Health enters UK market with ₹2,200 crore acquisition of Practice Plus Group Hospitals - BusinessToday"
    },
    {
      "source": "Brave News",
      "hospital": "Narayana",
      "headline": "Narayana Health crosses borders, acquires UK’s Practice Plus Group Hospitals | Mumbai News - The Times of India"
    },
    {
      "source": "Brave News",
      "hospital": "Narayana",
      "headline": "Narayana Health Banks On Domestic Revenue To Drive Growth"
    },
    {
      "source": "Brave News",
      "hospital": "Narayana",
      "headline": "Indian Billionaire Devi Shetty’s Narayana Health To Enter U.K. Market In $248 Million Deal"
    },
    {
      "source": "Brave News",
      "hospital": "Narayana",
      "headline": "Narayana Health targets 22% RoCE by FY30 in UK bet, eyes private pay growth to boost margins"
    },
    {
      "source": "Brave News",
      "hospital": "Narayana",
      "headline": "Narayana Health to Discuss UK Hospital Acquisition in Upcoming Conference Call"
    },
    {
      "source": "Brave News",
      "hospital": "Narayana",
      "headline": "Narayana Health Transforms Patient Relationship Management"
    },
    {
      "source": "Brave News",
      "hospital": "Narayana",
      "headline": "Healthcare Technology: NetApp along with Narayana Health develops patient record system 'Athma', ETHealthworld"
    },
    {
      "source": "Brave News",
      "hospital": "Narayana",
      "headline": "Narayana Health Insurance: Is the ₹1 crore cover your affordable safety net? | Mint"
    },
    {
      "source": "Brave News",
      "hospital": "Narayana",
      "headline": "Narayana Health City inaugurated"
    },
    {
      "source": "Brave News",
      "hospital": "Narayana",
      "headline": "‘Narayana Health’s core proposition \"Take Care\" is simple yet powerful’ - Exchange4media"
    },
    {
      "source": "Brave News",
      "hospital": "Narayana",
      "headline": "Narayana Health’s UK deal adds heft with acquisition of NHS partner - Industry News | The Financial Express"
    },
    {
      "source": "Brave News",
      "hospital": "Narayana",
      "headline": "Narayana Health (NH) - Appointment, Reviews, Contact Number, Address, Visa Invitation - International Patient Services - Contact Directly here"
    },
    {
      "source": "Brave News",
      "hospital": "Narayana",
      "headline": "How Narayana Health Hospital’s Viren Shetty plans to deepen insurance penetration? But keeping patients out of the hospital"
    },
    {
      "source": "Brave News",
      "hospital": "Narayana",
      "headline": "Narayana Hrudayalaya opens its first paediatric hospital in Mumbai | eHealth Magazine"
    },
    {
      "source": "Brave News",
      "hospital": "Narayana",
      "headline": "Narayana Health - 2025 Company Profile, Team, Funding, Competitors & Financials - Tracxn"
    },
    {
      "source": "Brave News",
      "hospital": "Narayana",
      "headline": "Customer Support - NH Insurance"
    },
    {
      "source": "Brave News",
      "hospital": "Narayana",
      "headline": "Narayana Hospital Bangalore - Doctor List, Contact No. And Book Appointment Online"
    },
    {
      "source": "Brave News",
      "hospital": "Narayana",
      "headline": "Request an Appointment - Narayanmemorialhospital"
    }
  ],
  "news_count": 46,
  "collection_date": "2025-11-20T00:24:03.303573"
}