{
  "hospital_name": "Max",
  "reviews": [
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "I had a really positive experience at Max Hospital. The staff here is extremely professional, caring, and polite. From the reception to the doctors, everyone ensures that patients feel comfortable and well looked after.\n\nThe hospital is very clean, well-maintained, and equipped with the latest medical facilities. The doctors take time to explain the treatment clearly and always listen patiently to every concern. The nursing staff is also very attentive and supportive, which makes the recovery process much smoother.\n\nOverall, I truly appreciate the quality of care and hygiene standards maintained by Max Hospital. Highly recommended for anyone looking for trusted and compassionate healthcare services."
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "I had a horrifying experience at Max Hospital Vaishali due to poor facilities, operations & management. During my wifes LACS, Dr. Archana (anesthetist) kept struggling for 2030 mins with multiple attempts before another doctor fixed it in 2 mins, leaving my wife in pain for days. Our newborn was kept in NICU for ~8 days only to develop rashes, torn skin & bleeding due to careless nursing. Doctors contradicted each other on discharge just to inflate bills. Nursing staff ignored repeated calls for basic help, and housekeeping was pathetic. Even after complaints to Guest Relations (Mrs. Pooja), improvements lasted only a day. Discharge was full of harassment, valet parking staff was missing, and the food court served stale, overpriced foodeven an expired coconut water pack to my wife. This hospital is a profit-making trap with zero care for patients."
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "I am not happy with nursing staff, they never listen my problem in icu at night , staff name is madhumati, rashmi, sehnavas. I aprsest mr arun k panwar, sultan, one more ."
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "My experience with Max Hospital, Shalimar Bagh, during my father's cancer treatment was extremely painful and disappointing. My father was under the care of Dr. Sajan Rajpurohit and his team. When his condition became critical, he was admitted to the ICUa place where every moment counts and where the presence of the primary doctor is crucial.\n\nShockingly, Dr. Sajan Rajpurohit never visited my father in the ICU. When we asked the hospital staff, they claimed he was not available. However, I personally saw him in the lift at the hospital, which means he was present on the premises but still chose not to visit his critically ill patient. This is not just negligenceit is inhumane.\n\nWhat is the purpose of admitting a patient to the ICU if the senior doctor doesnt even bother to check on them? Looking at reports and giving instructions from a distance is not medical care. The lack of compassion and seriousness from Dr. Rajpurohit was extremely hurtful during such a critical time.\n\nEven the ICU staff seemed mechanical and indifferent. There was no sense of urgency, no empathyjust routine formalities.\n\nThis careless and insensitive approach worsened my father's condition, and unfortunately, we lost him.\n\nI am sharing this review so that others can be aware. If a senior doctor like Dr. Sajan Rajpurohit can neglect a patient in the ICU, it raises serious questions about the hospitals ethics and commitment to life.eply Disappointed with Max Hospital Shalimar Bagh and Dr. Sajan Rajpurohit\n\nMy experience with Max Hospital, Shalimar Bagh, during my father's cancer treatment was extremely painful and disappointing. My father was under the care of Dr. Sajan Rajpurohit and his team. When his condition became critical, he was admitted to the ICUa place where every moment counts and where the presence of the primary doctor is crucial.\n\nShockingly, Dr. Sajan Rajpurohit never visited my father in the ICU. When we asked the hospital staff, they claimed he was not available. However, I personally saw him in the lift at the hospital, which means he was present on the premises but still chose not to visit his critically ill patient. This is not just negligenceit is inhumane.\n\nWhat is the purpose of admitting a patient to the ICU if the senior doctor doesnt even bother to check on them? Looking at reports and giving instructions from a distance is not medical care. The lack of compassion and seriousness from Dr. Rajpurohit was extremely hurtful during such a critical time.\n\nEven the ICU staff seemed mechanical and indifferent. There was no sense of urgency, no empathyjust routine formalities.\n\nThis careless and insensitive approach worsened my father's condition, and unfortunately, we lost him.\n\nI am sharing this review so that others can be aware. If a senior doctor like Dr. Sajan Rajpurohit can neglect a patient in the ICU, it raises serious questions about the hospitals ethics and commitment to life."
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "Actually, I should be giving this hospital a no star rating, but the review program is designed so the reviewer is forced to select at least one star. Our experience with the treatment given to my father is totally below the level of medical professionalism. There is total lack of communication with the family members by the staff and the doctors in the MICU.\n\nThey order all sort of tests repeatedly and the diagnosis is never revealed. There is never a plan explained by any of the doctors to the family, which is totally unacceptable. All they say to the inquiry by the concerned family is it is in God's hands. They do tests, the diagnosis is never justified, then they order more tests, and continue to keep the family in the dark. They deliberately make delays, which is party of policy without any explanation and continue to rack the bills. The expenses incurred by the family and the suffering of the patient is not in play. So many unnecessary infections were acquired by my father in thev MICU due to the unhygienic practice s. All the doctors have to is hospital acquired infection that cannot be helped.\n\nDuring the 8-week stay we wanted to move my father out of the Max care, but we were given false promises and sweet talk. I have written a letter to the chairman, yesterday and I really hope he responds. If not well you all know about karma, we go way back, we have become very close friends."
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "Staff not good. Very rude very unprofessional. No value for patients time. Don’t have sympathetic attitude towards patient family."
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "Arun, manisha, kamende, princy, All these member of the staff in apex CCU Unit are very calm, wise understanding as per our needs to satisfy patients need as well as very familiar in nature!"
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "Max hospital Gurgaon MRI not working so patient taken to Modern lab and MRI done of Rs 8500 but hospital Charges ambulance for Rs 4500 .\n\nwhy ambulance charge recovered from patient when it is fault of Max hopital that MRI machine faulty ?"
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "The staff of dialysis centrre in max vaishali are very unprofessional and inexperienced people.Max hospital trains staff for how to loot the money from people if anyone come for treatment they doesn't care about the patients how they feel and are treated such as how they are injected the syringes in dialysis line and Blood pressure is normal or what . They are allowed to new staff on floor without proper training, they are supposed to be stand with new staff and instruct them while injecting the syringe in fitsulla but here is everything Vice versa. Last ti.e shared my incident happened in max hospital, this time same mistake repeated. I can say this sure that they know only ay what time my shift is over and how early will I leave this place... , finally patient and family bears all the cost and all the pains while having the treatment.\n\nNow After closing the fitsulla by which fault... i do not know, god knows finally I bear the neckline for dialysis cost but that was not done superbly, flow was not good , all the day struggled with max treatment"
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "Worst hospital and worst treatment management.. They have very inexperienced doctors in emergency.. Worst behavior i have ever seen of staff"
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "I had breakfast at Max .service was very good and staff is very humble and supportive.\n\nFood is very tasty and hygienic"
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "Doctors are good but no proper management for basic need of the patient. There is shortage of Nursing Staff in the hospital."
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "Lady doctor in radiology department couldn't make a correct diagnosis of my patient. She couldn't see a foetus in ultrasound while the foetus was clearly visible. There was one yolk sac and in ultrasound she wrote two yolk sacs. She needs to take care of her job as your one wrong diagnosis can push a patient for abortion while there are chances of survival of baby. Max vaishali should check before appointment a doctor atleast in Radiology department."
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "I write my experience on this platform for max health care hospital this is worst hospital seen in my life his medical services are not good he provide very poor service his general ward not clean well and Medical tests are very expensive doctor write medicine available only his hospital medical store available I am very disappointed and staff behavior very rude not good behavior for Patient and his family members very expensive test and medicine available on his max medical store I not recommended this hospital"
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "Max Saket is very good hospital having team of experienced doctors. I had my uterine fibriod surgery on sep 24 done by Dr. Vivek Marwah sir. It is very difficult to find such a good doctor as surgeon. His whole team is doing good efforts for recovery of pateints soon. I don't have words to say about treatment and care in max saket. It's very good hospital having team of well experienced doctors.\n\nRegards Suman verma"
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "Very bad experiance in Max vaishali Bed manager are behaving partial & keep you waiting to allot the preferred catagory & after making you wait for almost 24 hours they will say we do not have bed & when you try to check around people who come afterward will be preferred so they act very partially"
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "Under Dr. Manisha Arora and her team’s brilliant diagnosis, pre and post care treatment and supervision, I would also like to genuinely appreciate the support staff, nurse, attendents, housekeeping etc. who took great care of us. My wife successfully got a major fibroid removal surgery done. While being admitted in max hospital gurgaon B wing for 2-3 days, we got great family like care, emotional and mental support. Although almost of these staff were great, some very special mentions that we would remember forever include Simple & Shelja (nurses) and Shalini & Phool Kumari (support attendants). They were extremely helpful, caring, understanding and cooperative. They did an above and beyond job in helping us navigate such a major vulnerable time. We thank our lucky stars that we got to receive care from them. And of course can’t thank enough in our lifetime to dr manisha Arora and her team. We have found our Gynac for life in her and would always wish that more and more staff in hospitals be like Simple & Shelja (nurses) and Shalini & Phool Kumari (support attendants)!"
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "I am writing to express my worst recent experience I had at MAX hospital.\n\nOn 9th August, I visited MAX hospital for a routine consultation due to a fever. Without any test results, the doctor claimed that I might have dengue and insisted on admitting me to the emergency department until the reports were available. I was told that if the dengue test was negative, I would be discharged within 24 hours. However, I was admitted without an attendant, and the reports, which were ready by 11 PM on 9th August, were not communicated to me promptly.\n\nFrom the beginning, I was very clear that I could not afford a large medical bill as I am a student, and my family is not in town. I have corporate insurance, but I was informed that I could not claim it due to not completing six months at my company. Despite this, I was not informed about my insurance status until 10th August.\n\nDuring my stay, I was not updated about my diagnosis or treatment. On 10th August, around 10 PM, I requested to be discharged as I was feeling fine and was concerned about incurring unnecessary charges. However, the hospital staff was uncooperative, and I felt that I was being billed without receiving proper treatment or information.\n\nUpon discharge, the nursing and billing staff were unsupportive. As a patient on IVs, I had to navigate the hospital alone, which I found to be highly irresponsible and unprofessional behavior.\n\nI am seeking assistance on how to file a grievance and claim compensation for the distress and inconvenience caused by this experience. I would appreciate your prompt attention to this matter.\n\nThank you for your understanding and cooperation.\n\nSincerely,\n\nMARYAM HUSSAIN"
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "Had a very worst experience in max saket hospital my father had gone their for liver transplant , they guaranteed us 100% that his liver will work like a new liver . But they did operation and after operation i lost him. They took payment before operation from us and at last gave us a dead body.I show the father how he got torcher but at that time after operation they give us 0% guarantee .After operation my father got worsted and even he can't talk and walk .Under Subhash Gupta team .They didn't not give any perfect answer.\n\nSo, I request you to clear all the things before taking patient there ??\n\nIt's better to go ayurvedic even after liver transplantation patient can't survive it's better to go ayurvedic.\n\nOne of the no.1money mafia company not hospital"
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "One of the worst hospitals in India. They didn't care for their patients properly, which was my personal experience. If any patient wants to go to the toilet, they have to wait 15-20 mins for the nurse to come and help the patient. They weren't changing the bedsheets of their patients even for weeks and we had to request them to change the clothes of our patients.\n\nDue to their negligence, I lost my father. The doctor named Vaibhav Chachra is worse as he doesn't know how to take care of the patients and even how to deal with the family. He was only looking to make money for his hospital and I am sure that he was having his cut in all these. We have spent lakhs of rupeeson the treatment and still, I lost my father. Every day was a trauma for us as Vaibhav was scary every day and every time. Doctor like him needs to learn how to take care of the patients and their families while in treatment and I would suggest he go to a mental hospital.\n\nDoctors and hospitals like him bring a bad reputation, not only to the Uttrakhandbut also to the whole country. So please avoid the hospital and doctors and in the worst case if you have to visit then make sure to take the patient to the other good hospital as soon as possible."
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "My worst experience with any doctor in my life was with Vikas Gupta. Very arrogant and does not care for time. Comes late and just writes tests"
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "Deepa Negi, FM attendant was very helpful and cooperative. She was taking all the responsibility to guide the tests to be done. Appreciate her support!"
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "I was admitted to Max Gurugram on 4 June 2024 with pneumonia and was there till 11 June. I was taken very good care of by Dr. Anish Gupta and his team. He was communicative and was always smiling. The staff when I was in the room was very courteous and efficient. However I had some issues with some assistance I received while in the ICU. I communicated that to Dr. Gupta and he promptly corrected the situation."
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "The representative didn't have idea about Doctor 's specialisation. I have requested for Orthopaedic and he gave appointment for spine surgeon. I wasted more than 4 hrs in waiting area."
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "This boy is so perfect in his work. God bless him. Where nurses are unable to find veins fori insertion of Cannula, there comes this boy \"Vishnu\" and within few seconds he finds the vein and pricks. The Cannula is inserted and he has gone. Superb, keep it up."
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "I would like to take this opportunity to thank Dr. Swasthi from the bottom of my heart on being a great savior for my mother during a difficult phase of our life. My Mother had been detected with Ovarian cancer.\n\nI was totally impressed by the way my mother was treated first time when she met her and the way she followed up. She is not only an excellent doctor , she is simple, superb human being, sober, approachable, smiling face with her selfless service. She is an extraordinary intelligent doctor with human values. Nice advise, hardly find such non commercial doctors in this era. Apart from dedication , she also has slight wit which impresses me more resulting in great relief from stress while chatting with her.\n\nMy best compliments for your exceptional care and for making a difference in the lives of others.\n\nRegards\n\nKajal Rathi"
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "I am extremely happy with the TPA services, they help for the approvals &hassel free service.special thanks to sameer &Dr isha & there team.god bless them!!"
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "I feel the above 2 departments are under staffed. Bed availablity is also poor considering the rush these days. Another tower need to built and number of beds need to be increased."
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "Dear Sir, all my onco concern staff under Dr Gopal sharma and his team are excellent to help and guide all needy pts at your doorstep. Best wishes and best regards....Capt Sanjay Sharma"
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "I am writing to bring to your immediate attention a distressing incident that occurred during my father's recent admission to your hospital on April 23rd, 2024. My father, Mr. Prakash Koundal, is a heart patient, and we entrusted his care to your esteemed institution.\n\nOn April 24th, 2024, my father underwent a test prescribed by his doctor, accompanied by my mother. Unfortunately, during their visit, my mother, who is not well-educated, approached Dr. Neha Chaudhary on the floor with concerns about the hygiene of the instruments being used. Dr. Neha's response was shockingly unprofessional and utterly unacceptable. She not only yelled at my mother in an aggressive manner but also humiliated her in front of other patients present in the area. Furthermore, she escalated the situation by calling security and forcibly ejecting my mother from the room.\n\nTo compound the distress, upon my father's return from the test, he also faced Dr. Neha's inappropriate behavior. Instead of receiving a courteous response, my father was met with further disrespect and aggression. Dr. Neha's conduct towards my elderly parents was not only unprofessional but also deeply upsetting.As per the reports she behaves in the same way with others as well.\n\nDespite our efforts to address the issue with your staff, including raising our concerns with the query desk, the response has been unsatisfactory. While Ms. Nidhi and other senior staff acknowledged the seriousness of the matter, they informed us that Dr. Neha's behavior is considered to be her personality, and therefore, no further action would be taken beyond an apology. As a daughter of Mr parkash koudal i assisted them we just need small sorry from neha to my parents so that they will get out from that feeling not in front of everyone but in person to my parent i didn't ask for the bigger thing but nidhi along with sr dr tried to defend her and said we are saying sorry on behalf of her this is not justice to my parents .\n\nThis response is wholly inadequate and fails to address the severity of the situation. It is not a matter of mere inconvenience but one of harassment and mistreatment of patients under your care. My parents, as well as our family, feel deeply distressed by this experience.\n\nI implore you to take immediate and decisive action to address this matter. It is imperative that Dr. Neha Chaudhary be held accountable for her unprofessional conduct and that steps are taken to ensure that such incidents do not recur in the future. My parents, along with other patients, deserve to be treated with dignity, respect, and compassion."
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "I recently had the pleasure of being a patient at Max Hospital, From the moment I walked in, the staff made me feel welcomed and comfortable. The doctors were highly knowledgeable and took the time to explain everything to me in a way that I could understand. The facilities were clean and modern, and I felt confident in the quality of care I was receiving."
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "Everything is ok, service in high level. Staff very polite, doctors very polite and they explain well"
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "On 1st April, in the afternoon at about 2:00 PM I went to Urology department. I asked the billing executive to give me appointment of a doctor who is actually available.\n\nAfter billing I went to the reception of Urology where I was told that Dr Vimal Dassi was in OT. Not knowing when the doctor would return I went back to billing and asked for change of doctor who is available. Billing executive asked to find out which doctor is available.\n\nSo, I went back to Urology reception and\n\nasked for alternately available doctor. The receptionist told me that the doctor would be coming soon, so I waited Dr Dassi to return.\n\nDr Dassi returned after sometime and called me to his office out of turn. He asked me not to sit in chair and keep standing.\n\nHe raised his voice angrily talking in a most rash and rude manner as to why I can't wait. His demeanour was that of a school teacher trying to punish his students.\n\nI suggest that a video camera should be installed in Dr Dassi's cabin to record such incidents since he saw me alone.\n\nI intend to take up the matter with Directors / Chairman of Max group of hospitals and also Medical Council of India or similar bodies. If the issue is not addressed properly, I would raise it in social media.\n\nKK Grover\n\n981127xxxx\n\nkk.grxxxx@gmail.com"
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "This is worst hospital. Please do not visit Max hospital Vaishali\n\nI had an emergency few days back, and I rushed to Max hospital vaishali ghaziabad, staff were so rude and they kept me waiting even knowing my emergency condition . After2 hours they ask my father to pay 10k as emergency charges and refuse to give me daily injection because that was prescribed by doc out of Max. my health worsen but they kept forcing us for payment and max consultation . we paid huge money as per their bulshit protocol and finally they only give same injection no other prescription suggested by their so called doc, after harrasing they discharged me in 7 hours.\n\nI will never ever visit MAX"
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "My father who is 91 spent 2-3 weeks at Max Gurugram and was taken good care of by the medical team and survived hip surgery and pneumonia and just got home.\n\nHe however complained that he was left in a puddle of urine several times whilst in his room which is very unfortunate, especially when recovering from surgery with a big would but even without it is not acceptable for such a big hospital where we paid a 8 lakh bill. They called for the attendants and would have to wait a long time before they came. Hoping this can be addressed not sure who to contact."
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "My family had worse experience at max super speciality, saket. so, basically my father was admitted to ICU with chest infection. He was on ventilator for 2 weeks. ICU team and doctors didn't look him well. Infact after 2 weeks his condition was even worse. They provided artificial juices to patient in ICU. They wanted to keep him in ICU for long and charge us lakh daily. Finally we decided to take him out of hospital and bring him home with homecare setup from different health care provider."
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "I had an unfortunate experience with this therapist two years ago after watching a live video. Regrettably, my encounter with her was highly unsatisfactory. She presents herself as knowledgeable, but in reality, she turned out to be someone ready to take advantage of vulnerability, making her more of a scam artist than a professional. Punctuality was a consistent issue as she was frequently late for sessions without any prior notice, leading to prolonged delays.\n\nIn addition to her lack of professionalism, she exhibited manipulative behavior that negatively influenced my perspective on the world. Her approach involved more threats than guidance, creating an unhealthy environment for communication. Furthermore, she displayed judgmental tendencies, making it difficult for me to open up during sessions.\n\nRather than providing coping mechanisms for anxiety, her sessions exacerbated my condition, prompting me to seek help from another mental health professional. Overall, my experience with her was detrimental, and I am still in the process of recovering from the negative impact of our interactions. In light of my experience, I cannot recommend her as a trustworthy or right-minded therapist.\n\nI feel compelled to caution individuals against seeking therapy from Ann Simi John, as my personal experience suggests it may not be a valuable investment of time and money.\n\nThe video posted above reveals instances of her tardiness during live meetings, which raises concerns about her overall integrity."
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "I visited to urology department staff members are so coprative.\n\nSpecial thanks to Steffy ma'am for your help."
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "Not good hospital my experience is very bad ?? Doctors not clear about patient and not refer to another hospital. They keep the patient admitted until they kill him. The patient's family keeps hoping that his patient is alive but it is not. This hospital has been made a center of money making. So I request you to go anywhere but not go there ??"
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "I have recently visited the hospital for a cesarian admission they given me quote of some amount of 1.19 lac+ some 7000 non consumables and after a week their person again sent a new quote which is higher in price aroung 1.32 lac+ some 10k non consumables .\n\nwhen I ask to to the management for this they said this is our recent prices.\n\nso I would suggest before visit take all tha things in doumentated.\n\nalso after visiitng the hospital they treated well for few hour but after admission they are not able provide hospitality to patient because lack of trained staff and their is no quality check.\n\nno soap in bathroom\n\ncentralize heater is not working\n\nno bed sheet change\n\nno towel\n\nno quality checks for paitent\n\nno feedback system for imrovement.\n\nPlease be aware their management is coming to your windwos every hour for asking about the service but they didint given the good service.\n\nThey are doing extortion of money in different way or style.\n\nI would suggest smart hospital is better care the patient.\n\nam helpless becuase my patient is admited.\n\nRegards\n\nGabbar."
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "Nursing staff is good one of sister were very kind and humble she takes care of patient nicely and listens properly.Her name is Pooja Rastogi"
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "We visited max hospital mohali as my mother in law is suffering from rectal cancer. Dr pankaj (radiation oncologist) and Dr sachin ( medical oncologist) gave NACRT. After that Dr. Ritesh pruthy and Dr lovedeep ( surgical oncology team) operated on her. I m lucky that i have chosen max hospital. Doctors are extremely empathetic and made our journey so simple as if nothing has happened. That is the real beauty of their treatment. God forbids if any such thing happens to any family, this is the best place and this is the best team. May god bless them all."
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "Not good for saving life, only make mony.\n\nI never recommended, my few relatives were go there but never back...."
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "I am admitted in max saket for my surgery on 5th floor east which is done by doctor pradeep chowbey and i m fully satisfied with doctor and nursing staff specially from sister blessy, Nidhi , angela and other sisters who have attended me all are very cooperative and helpful and special thanks to supervisor Mukta and the food was delicious thanks to food and beverages"
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "OPD staff of Max Hospital Bathinda is very nice. My mother was attended by a girl named Madam Harmeet. I didn't go today, but according to my mother, Madam Harmeet helped her very well. Many thanks to the OPD staff, especially Madam Harmeet????????????"
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "My experience with the hospital has been amazing. Max, saket has been our go to hospital for many years. My grandmother has her dialysis there thrice a week. The staff and the doctors are amazing. We have also gotten her admitted there quite a few times. The doctors and the staff is trustworthy."
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "I'm delighted to write again about a special man that I called \"Superman\". My words are not powerful enough to describe the power of healing that he has within his specialty. Dr. MANNU BATHIA was my mother's surgeon in 2019. He had the challenge of redoing her back surgery which was a reparation for a bad surgery done in 2019 in Cameroon. The surgery was successful.\n\nToday I'm here again to share another special journey with him and his team. 5 years later after my mom's surgery on her back, she trusted Dr. Mannu again and came here for surgery on her knees. At first, she was scared because many hospital policies around the world allow only surgery on one knee at a time. Dr Mannu as usual knew how to comfort her and explained that it would be possible to have both done on the same day. Her second concern was the rehabilitation length of time. Most of the literature we have read confirms that the effective walking process can come after 3 to 6 months. Coming from Africa to a foreign country to stay for an undetermined period can be challenging regarding financial expenses. Dr Mannu one more time comfort her saying that a month of recovery will be enough to stand up and go back to her country safe and on her feet. The surgery on her knees(both) was successfully done on November 14, 2023. There were no complications before during or after the surgery. The hospital team was able to help her stand with a walker 3 days later. Today(November 29), she is at her guest house moving by herself, dancing some mornings, and appreciating her \"18-year-old brand new knees\".\n\nThe hospital was so organized, and clean, following all the standard protocols. The staff was dedicated. The price of the surgery was affordable. Dr. Mannu was friendly, hearted, and highly skilled. A special kudo to Mr. Parvaiz who is Dr Mannu's right hand. He went above and beyond with my mother's care from the beginning to the end. I especially recommend Dr. Mannu from Max Hospital to anyone who wants to transform his medical care in India into a wonderful journey filled with Love, care, expertise, and reliability.\n\nDr Mannu, you are devoted and specialized in what you doing, and what makes the difference is your heart full of compassion and sympathy. My family and I will never forget the impact that you had on my mum's life. You are a precious piece in the extension of her life expectancy. May God bless you and your family indefinitely. You know how to bring back alive any dead bones. As a medical provider, I know what I am talking about and I feel blessed to have such a devoted provider in the medical practice. You did a great job as always. Thank you so much for everything.\n\nDiane Boyom"
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "Very good hospitality... On 5 th floor under the guidance of Dr Pradeep chaubay... Excellent care taken by full staff... Especially by nurse ms chanchal and ms nidhi singh... Security staff was also very cooperative especially Mr murari kr singh... Also special mention for Mr padam singh service man.. very kind and humble... Thank you for such a comfortable experience to the whole team.."
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "Very nice , cooperative & Punctual service in Max Patparganj hospital department GDA\n\nName Brijesh , Poonam & Pankaj\n\nThanks for all 3 guys"
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "I had a disappointing experience at Max Hospital. It's disheartening when a place meant for care falls short in various aspects, including food service, maintenance, and staff conduct (my husband had a femur surgery and they missed meal in the ICU, not only this he was bought in a broken bed from ICU the room, which we got to know when his epidural got stuck and he screamed out of pain). To discuss these concerns I was introduced to THE GREAT LALITESH SANGWAN, on mentioning that I also come from an hospitality background he called my ex company VANA to enquire about me, he is such a unprofessional, especially discussing me over coffee with someone from your previous workplace, is completely unacceptable. It's fortunate that Sandeep, the Vice President, extended an apology, but the lack of accountability from Dr. Lalitesh Sangwan is concerning. Max Hospital indeed needs to reconsider their leadership selection and prioritise patient care and professionalism. I am curious about Sangwan's inquiries to Vana, warranting a comprehensive explanation and accountability from the hospital's management.\n\nI need to hear from you soon owner of max hospital and have all the proofs (videos, audio’s and pictures) for whatsoever I said in this review.\n\nThanks, looking forward to hear from you asap"
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "My mother was admitted to the Hospital for 4 days. We had a very positive and good experience at the hospital. The staff is very polite, courteous, helpful and caring. The nursing staff in particular are very caring and empathetic. It was a great experience here."
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "With reference to the subject cited above, I would like to bring your notice to the insupportable behavior of the doctors in Max Hospital, Mohali.\n\nI would like to inform you that my father has been taking kidney treatment from Dr. Manish Kumar Singla, Max Hospital Mohali\n\nA week ago , my father encountered pleural effusion, and he was facing a lot of breathing and cough problems. So, we decided to visit Max Hospital, Mohali, which is identified as a great chain in the medical sector, and it is 250km away from our hometown. On 30th October, we paid opd to meet Dr. Manish Singla. To our surprise, he didn't do anything, just referred to chest specialist Dr. Deepak Bhasin. To meet him, we again paid the opd charges. Ironically, instead of doing the process of pleural effusion removal, the doctor took just a sample of fluid by painful injection and prescribed some tests worth Rs. 12000, which turns out to be all negative. These 3 days until we got reports were just waiting period in pain without getting any treatment or prescription\n\nOn 2nd November, after getting the reports, when we visited again there. We faced harassment as we had to wait for 2 and half hours, which is like one has to do in any government hospital. Honestly, this is a black spot on the brand image of Max Hospital. After waiting a long. We paid other opd charges, and upon our request, they did the process of pleural effusion removal. It cost 6100 for the process coupled with 2200 for consumables.\n\nDespite paying a lot of money and investing long time. The doctors were supposed to prescribe some post process consequences like fever or so. But they didn't tell anything even if they didn't give any antibiotics to cure the effects.\n\nLast night, my father was suffering from severe fever, and we were not aware of what to do. This morning, when I approached the assigned doctors, they didn't pick up the call and messaged back to call at 3 p.m., which is really an unpleasant experience. At the given time when we contacted. His attendent told me that the doctor would call you back. Till 5 pm, we didn't receive any call. Such negligence can lead to severe problems. On being enquired, these problems are usual here."
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "Had the worst experience with Max personnels at Saket. It was around 5 pm when I had gone for lab draw and before filling out the registration form, I confirmed with the front desk that if it's possible to get the reports same day as I had to see my private doctor next day at 9:30 am. She confirmed that physical report is not possible but I would get the report in my email by end of the day and I can use it for my doctor's appointment.\n\nI again confirmed with the guy who drew the blood and was given the same assurance that although physical report is not possible, I would get the details in my email that same day.\n\nNever received the email that day. Waited till 9:30 am next day, no email. Tried calling, no answer. By this time, had to cancel doctor's appointment and couldn't reschedule because I had to fly back next day.\n\nI finally went to Max requesting a refund which was denied by front desk and referred to the Manager on Duty, Prakash Kumar Singh. The most arrogant, disgusting and disrespectful guy I have ever met. Instead of listening and trying to understand, he accused me with \"how do we believe you didn't get the email\". I offered to show my inbox and his response \"well you could have deleted it\". I offered to share my Deleted folder and his final accusation that so deleted the email from the Deleted folder!!\n\nOn top of that, he looked at the doctor's order and gave his so-called diagnosis that I am creating a fuss as the tests do not show I have any chronic issue so I shouldn't worry that much!! I asked him is he a medical professional to diagnose and he used his experience working in medical field. He then called his supervisor Mr Ajay Kumar who was very understanding and talked in a much calmer tone but Mr Prakash would override whatever his supervisor would say.\n\nNothing got resolved with all this chaos!! They kept saying I can have my reports and my argument was these reports are no good to me as it was not delivered in timely manner as promised by Max personnels. They reached out to GM Mr Sachin Srinivasan who agreed to give 25% refund which I was not ready to accept. Mr Arun Kumar assured me he will work on the issue on Monday and would update me but no phone call or email from him. I called him on Monday and was told to give him 24 hrs which again was useless as he didn't pick the phone after that.\n\nI have the proof of the employee who registered me on the receipt and the signature of the person who drew my blood. I told them to contact both employees and confirm I am telling the truth but they didn't care to double check the facts.\n\nOverall, it was a headache to deal with this much of unprofessionalism and disrespect of Mr Prakash and Max as a whole entity. I know they will still get patients and clients everyday but I will make sure to share my experience with all my friends in US and also ensure they avoid this facility.\n\nShame on the administration to not consider a request for Rs 2100 and shame on having employees like Mr Prakash who lacks basic courtesy and customer service skills."
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "Excellent staff, was taken care properly. Doctors and nurses are very helpful. Overall, great experience."
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "One of the worst hospital in Dehradun with Doctors having no experience or with fake degress, doctor with name \"Amnrish \" is a classis example .\n\nIf you have money and don't want patent to be treated well, go and get him admitted in this else there is no point in vistiing Max"
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "Doctors are really good in Max hospital, but the rooms are below average, beds and mattresses are so bad that the patient can develop severe back pain. I experienced it at the time of 2nd covid wave. I couldn't sleep on the bed. It was a torture. And recently when my daughter delivered her child, she was in extreme discomfort. Nursing staff is a mix of good and bad, under trained too."
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "Room no 2599- i was very anixious earlier bt here vevery one ia very co operative n helpful even the doctors are very good . I would highly recommend people ."
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "Have started my mothers treatment with Dr Nagender Sharma (oncologist)and am extremely satisfied with his expertise and most importantly his patience and way of treating his patient. Even being busy is readily available personally if any problem to be discussed. Thanks to his coordinator as well Mr Manish...for making things so easy for us and going out of way to help us in other departments also."
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "We went to this hosp in an emergency for my Mother’s treatment . She was was admitted after lengthy , cumbersome and time consuming procedures at the Emergency reception . The dealing Lady doctor was arrongant and rude in her behaviour with us. After two hrs of waiting, my mother was admitted in the CCU….we thought everything would be fine hereafter.., but the reverse was the truth. The doctor on duty just took half a minute to glance through the case file… did not even checked the patient … did not even speak to the patient and ordered Cardiac procedure to commence from next day. The CCU looked like a busy Railway Station … too noisy n crowded… nurses n staff talking continuously at top off their voice. The lenin, clothing and other essentials provided to the patient were third grade … patient was even not allowed to use the wash room…\n\nthis n much more my Mom suffered in her critical health condition… and she decided to leave the hosp irrespective of the consequences. We took the patient back due to extremely poor services at Max Hosp Dehradun.\n\nWe will never visit this hosp again… !!!\n\nGo on your own risk!!"
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "Max hosting has taken a patient of our family on 19.9.23 from day to night but after that they have leave the patient without any reason at night he has heart problem at night the patient has heart problem till now .My point is that why the has leave the patient at to night where the patient family members take him to which hospital and why they has take the patient"
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "I really very happy with the attitude of nursing staff. They are really very trained and helpful. They were available at first call. I really thank madam shallu, madam balbir, madam sunita and madam harsh. Really very supporting and efficient staff. I thank then all. Thanks to knowledgeable doctors team also..."
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "My Father's life was taken by the Dr. Sunil Dhar team of Max Hospital Vaishali Ghaziabad due to their negligence.\n\nHe was a fit man not having any kind of illnesses. He was admitted to Max Hospital, Vaishali, Ghaziabad for gallbladder surgery on 15th August 2023. Before starting of operation the Dr. Devesh Loshali from the team of Dr Sunil Dhar has given the wrong/high dose of anesthesia and due to which my father collapsed on the bed. In order to save themselves from legal consequences they dumped my father's body on everytime ventilator, although he has already died. They kept my father's body for three days at every time they narrate diffrent stories about my father health condition. They finally declared my father dead after preparing a different story on the night of 17th July 2023, so that nobody can hear the pain of us in the hospital which may ruin the hospital image. The death of my father was not only medical negligence but murder as the doctors knew very well that non-augmenting of measures which may occur during anesthesia which may lead to death were not available to the hospital clearly shows murder."
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "They won't treat you first but will make bills more than 25k even you enter the hospital. In my case I got admitted in emergency ward but they themselves make it stay of 3 days on paper.. I was there for abdominal pain.. they gave me no\n\nmedicine and keep me waiting whole the day\n\nand in the evening they took samples and forced\n\nme to shift in the ward which was not necessary\n\nin my case. And when I opposed to stay in the hospital they tried convincing me and made bil of 32 thousand just for 6 hours stay on emergency bed with few tests done. Pathetic service. They didn't even provide me prescription and lab reports. They just want to cut your pocket"
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "I strongly advise against choosing Max Hospital, Shalimar Bagh, for preventive health checkups. My personal experience with their highest package, Titanium, was terrible. Despite paying a significant amount, they didn't perform essential tests like X-ray, Pap smear, and dental and eye checkups. Furthermore, they didn't provide all the necessary reports and doctor consultations, causing immense frustration and wasted time. They even misplaced my stool sample, making me redo the test. The hospital's inefficiency and lack of accountability led to a highly unsatisfactory experience, lasting for five months and counting. I urge anyone considering this hospital to be cautious and explore other options."
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "I am Praveen pal and Suffering from colon cancer. I am getting treatment by dr. Sajjan Rajpurohit he is very humble, polite, and helpful. he has great knowledge of medicine and his coordinator bhai Sanjay Rana is also helpful and very good in behaviour when ever I met him he always has smile on his and give answers very politely and He always stand for help us"
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "Reached on 19 Jun for Cardiac Evaluation and seen by Dr Ripen Gupta (A very compassionate doctor and a great listner empathetic to the patient's concern. My Angiography was done and moved to CCU, Subsequently moved to room 1206 where an Efficient Miss Kim, Nursing Supretendent, Suprendent of House Keeping and Dietician.\n\nA fabulous hospital with excellent, efficient and friendly Nursing, House Keeping and Catering Staff."
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "My father Sh. Raghbir Singh is getting treatment by Dr. Samit Purohit ji. And I consider that he is the best doctor in all manners. He is very polite, Humble, Helpfull with very good behaviour. And he has great knowledge of medicines.\n\nAnd His coordinator Sneha Mam is also very good in behaviour and Nature.\n\nWhenever we want to ask them something they pic up the call and gives answer in very politely even on holidays.\n\nGod bless them a very healthy life."
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "I visited this hospital a few times with my mother who was undergoing radiotherapy. Very good doctors Dr Garg and Dr Priyadarshini in particular but waiting rooms crowded with no facilities for terminally ill patients and cancer patients.\n\nThe hospital is located in the filthiest area of Delhi with garbage depots outside with cows dogs and crows eating at any pickings. This very rich profiteering hospital should invest in the surroundings too. The Aam Admi party will do nothing. True 3rd world setting"
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "Brilliant hospital\n\nExtremely pleased with the hospital staff and medical care provided to the patients"
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "I am very pleased with Dr. Balbir Singh and his team. Keep up the good work and thank you for taking good care of me. Appreciate it."
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "Doctors, nurses were very cooperative, responsible and helpful. I haven't faced any difficulty in sico 1 these days. Ms. Jaspreet Kaur is very dedicated for her job and helped me, cared about me alot. Thank you very much all doctors and nurses!"
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "Hi\n\nIf you really want to kill your patient, than only come to Max hospital..Saket, They are money suckers.The blood bank denied to give blood to critical patient..They want blood, if you cannot arrange, they have denied to issue blood\n\nSecon"
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "My experience with Max hospital gurgaon is generally good. Though we found it bit expensive. We consulted Eye surgeon Dr. Nimarta mehra and carlodistic Dr. Sunil wadhwa. Both are polite and speak to the point. What I found great and special thanks for shilpi bharti"
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "Hi,\n\nMy mother's treatment is going on under Dr. Meenu Walia mam and we are satisfied with the treatment and the whole team of Mam is doing well. If we talk about admission procedure then my suggestion is that there should be a some easy procedure so that patient do not have to wait for a long time. Nursing staff is Good.\n\nMr. Shubham Singh at the\n\nFront office is very helpful and of a supportive nature.\n\nI would like to suggest that management should pay some more attention regarding the shortage of staff especially GDA staff and also the necessary items such as Blood Box and Nebulization machine as it is short as per my experience.\n\nThanks"
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "It's about surgery patient, and she was on liquid diet, not serve on time, it's suppose to be every 2 hr, last diet was late next day is surgery. Not discipline at all, this for food supply."
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "Only show off, janta ko loota ja raha hai hai. Minor treatment ke naam pr badey badey bill amount bda detey hain, garib aadmi to kabhi bhool kr bhi na jaye bhai is hospital main to."
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "The team is texting an apology message when my father is dead after their irresponsible behaviour.\n\nDoctors, nurse, staff all are just animals. They want money even from a dead body. I told them that I am aware that my father is dead, so please give me the body.... They straight forward denied that no we are putting him on ventilator and giving him blood also.they even say that we don't have ambulance for your patient...you have to arrange by your own. Me and mother have no other person there ..and my father was on ventilator......and they are just playing with us. They give me a bill where they mention that in 1 day they have given 32 units of blood to my father... Is that practically possible for a body to have 32 unit of blood in one day.... They are real monsters..... please I beg to everyone..... don't take your near and dear ones to this hospital if you want to see them alive"
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "I obsereved Doctors & surgeons are not so qualified. In them I found lack of huminity. They are only professional & how to earn money.They do not have kindness towards a human who is facing acute. In future they may be in hopeless condition. Overall huminity first is absence. Such thought should come from their eternal heart. Hai paisa is the funda of most Doctors. Overall I am.not satisfied. I wanted to rate but due to compulsion I am rating three."
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "Tower 2 8 floor bed no. 2829\n\nall Very good staff and security service is very good\n\nS/g Prashant kumar jha"
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "Worst hospital in all over India looted hospital, worts hospitality worst service worst treatment worst greeting gaurds se leke nusres + doctors tak worst behaviour even cooperation level 0% arguments 10thousad% treatment level looted no humanity as well it is reality of gabar is back movie Akshay Kumar waali na humanity hai na hi co-ordinate karne waala koi gaurds always behave rudely and they used to debate continuously and they always at their worst level if I talk about parking level to inside level of hospital totally bad impact of hospitality level (hospitality means give a good and well greetings to the guests or patients) and their hospitality means akad aith thamki rude behaviour and all bloody fck we just paying you and it matters bcuz if we are paying you and this is the main reason that your hospital earns money bcuz of us from our side you can earn and don't forget if aam public will stand against you na your brand and your hospitality gets fcked keep it in mind hope you will understand my points someday soon you will fcked up publically and your brand and hospital will get fcked off it's better to maintain best hospitality and services otherwise your brand company and your firm and your hospital will be on highlighted to bann it ??????????????"
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "Worst hospital ever in Delhi.My dad was suffering from liver cirrhosis n hepatitis b infection.We were told to go for an liver transplantation asap.We went for liver transplantation and I am the liver donor. After liver transplantation, my dad was doing fine then on the next following day he was kept on ventilator...doc informed my informed my mom that we have to go for acmu as he had an cardiac arrest.He went for acmu too then we just lost him.The doc here is just want to make money nothing else.No doc was telling the exact reason what had happened to my dad then they told us he had an organ failure n his urine output was zero.Dr Subhash Gupta is such an inhuman person over there, he was not even sorry for it..they were just making excuses and they were asking more money...these types of hospital are menance to our society.The staff are soo bad over there..they take soo much time to provide patient food also ..these docs are not savers they are just murders and do not have any humanity"
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "Deplorable service worst than a government hospital !\n\nAt the time of admission I was being followed and things moved fast. Once admitted, I have been waiting for achange of bed sheets.\n\n? Was given diabetes pill on an empty stomach.\n\n? Food is left where I can't reach. Had to order food from canteen.\n\n? Toilet has not been cleaned.\n\n? Cleaner leaves the toilet door open everytime he comes to flush and not cleaning.\n\n? Nurse came to draw the curtain and covered the EEG Camera\n\n? Have been trying to call a nurse since 1 pmand still waiting....its 2:37 PM as I type this review.\n\n??? ONLY PERSON WHO HAS BEEN PROFESSIONAL ANDEMPATHETIC IS\n\nMR. VIJAY.\n\nSORRY TO SAY THIS BUT THIS IS SHAMEFUL TREATMENT."
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "Meri mmy ki death ho gyi inki vjah se micu 6 floor mai maine apne kano se suna fentanyl naam se injection lgatey h jisse patient coma jaisi halat me chla jata h fir bolnge brain dead h infection hn\n\nAdhe se jyada yhan par low bp sepsis se mar rhe h sabka same reason kaise ho skta h\n\nJab tak target amount aapse lenge tab tak aapka patient jinda rhega uske bad mar dia jayega\n\nDr devrat rai dr manoj dr lovy gaur or micu k doctors ek team ki trah kaam krtey h patient ko upar pauchane mai\n\nJab milne ka time hota to care krke dikhate h baad me adhe patient careless se mar rhe h\n\nKoi bhi agar yhan jata h to meri bato ko mhsos krega"
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "I have come for pulmonary function test for my mother as adviced by pulmonologist. On coming to PFT room i was told that only one pulnonologist is available who has gone for bronchoscopy and will come only after 4pm... Other pulnonologist is on leave ..there r other patients also waiting for a long time ..\n\nSuch a big hospital and this is the situation... People come to private hospital so that services r better than govt hospital... And to avoid long waiting hours. There is none to even enquire who has come first and who has come later . Very poor services in PFT"
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "Mai emergency mai gya 11 March ko 10:55 p Dr ne pucha koi panel h Maine bola dgehs khne lga bed nhi h yashoda m le jao\n\n12 vje tak request Kari fir mmy ko attack aa gya\n\nVentilator par ger dia\n\n1 mhine ventilator par rkha 10 lakh ka kharcha\n\nBaad me bol dia nahi Bach payi\n\nBeech me mmy ko hdu me bhej dia whan dubara attack aa gya\n\nMmy ko bhukar rehta tha koi nhi dekhta\n\nTotally ignored krke rkhetry h patient ko life ki sbse bdi galti ho gyi max me le jakar\n\nEmergency me phle aapka panel puchenge fir admit krnge\n\nDr ne patient ko theek krne ki kosis bhi nhi ki\n\nDr lovy gaur Dr Manoj singhal dono itne chalak h na to neurologist ko bulaya na cardiologist ko apne aap decision lekar unpar experiments kar rhe they\n\nSbse bdi prblm apko btaun yeh sab mile hue h sab ki sab\n\nSo please Mt Jana\n\nAnd Dr lovy gaur micu 6 floor manoj singhal bhagwan tumhari maa ko bhi tumse dur krde"
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "I have a experince my wife got addmitted due to dwngue in this healthcare.\n\nVery prompt response for life saving and staff and emergency was wonderful. Hats-off to all doctors"
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "I'm highly delighted to share my views for MAX.\n\nMost advanced healthcare facilities are given at a reasonable cost.They are dealing with numerous patients daily in a well systematic manner.Highly Qualified and well experienced doctors and teams are available here 247.\n\nI highly thankful to members of MAX hospital liver transplant department.\n\nDr.Subash Gupta and Dr. Shalin and teams.\n\nThe staff behaviour is really impressive especially \"Dr. Vikram and Dr. vipul\". Both are so polite and caring in nature , and ICU staff all nurses and Doctor D.J. are excellent and dedicated .\n\nI am highly thankful to the staff and nurses 4th floor ward : Arshi, Reema, Kirti, Anjitha, arut, sekib, puroshtam, wouchan, sumet and Deepak and all of there with GD staff.\n\nAnd from the side of Housekeeping : Suman and another member, they are much taken of my baby care.\n\nI've never seen such helpful staff in any other hospitals .\n\nThankyou Max\n\nMust opt for Max hospital."
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "You take an appointment and when you arrive they just tell you the doctor cannot see you right now. No apology for not able to see. No reason provided nor any empathy for the patient. The coordinator was too rude in the urology department. No other time given as well. No courtsey to call or message on cancelling the appointment."
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "Couple of days ago i admitted my mother for bypass surgery. Ctvs ICU Worst nursing staff. Worst food provided to patient. Totally disappointed by MAX hospital facilities. I was called at 11pm for arranging blood platlets so that hospital can operate in morning. Not informed earlier so that patient's attendent can arrange any donar. food provided to patient was not good in CTVS. It seems that food is not fresh. Tea once prepared in morning served till evening to the patient."
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "The medical centre for foreigners countries like canada australia etc. is so helpful and the behaviour of staff innso nice expect one staff member weraning white coat with sea green dress i dont like their way of treating clients and students. She is being so rude with clients even i talked to clients they are often disturbed from her and we all request you yo change her .\n\nThank you"
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "Worst. You will waste your money. They are only here to mint money. There are huge price difference if you get chemo from Shalimar bagh it will cost only 21k but here they charge more than 28k and they do not ahve ambulance or emergency care service for any query they will send you to go Max Saket. The management, nurses are alwys talking then actually working. Do not go there as a small unit they only think about profit to survive. Doctor Jhulka is good but most of the time he own't even remember you name forget about case, nurses are always hurry to go home early. On duty doctor won't even take your call."
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "Its money minting press and they have perfect recipe for manking good balance sheet you can have good case study of gr8 business . There lack of coordination among staff and departments you have to bridge this gap if you want to get treated. They help you to come closer with your patient both physically and emotionally because after all you are the only responsible for all his/ her needs in hospital. Surprise are part of your stay you will get used too soon.\n\nAt last you will realize chal aa hi gaaye hai to krwa leta hu. And for 100 times and to 100 different people staff you have to tell them why you are here because padne mei time aur mehnat dono lagta hai puchne mei nahi."
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "I had a bad experience at Max Hospital Vaishali!\n\nCustomer service as well as biling counter staff are guiding properly ! either not having proper knowledge or don't want to guide ,\n\nDue to their their this attitude couldn't get my tests completed timely !"
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "Worst experience with Dr.. Anil Bhatt and Dr. Vaibhav Mishra who failed in performing Bypass surgery for a person who came just in without any heart attack.. Surgery was completely mishandled leading to complications and eventually death.. I believe Doctors could not diagnosed the patient fully before surgery whether his body and heart can withstand in surgery ir not.. All of them were in a hurry to do surgery..No recovery in ICU despite 5 days stay and on 6th day.. patient expired...Extremely Disappointed...."
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "All nursing staff so good.specialy thanks for doctor manu sharma.He is very good doctor in max hospital pediatrics"
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "Max healthcare brand is famous and reliable in India but all Max are not same Max mohali is worst ever, their doctors are not even looking after their ICU patients they prefer OPD patients first and secondly their ICU team is useless as they even not taking care patients on ventilator their pipe was going off but the nursing staff was not giving focus on them, as I mentioned it couple of time they only have one excuse “ oh koi chakkar ni kuch ni hunda wapis lga dinde aa” they even not taking care of bed sore , they just enjoin doing nothing in ICU. I will request the overall management of Max healthcare India please do visit in the hospital and see what’s going wrong. Even their death rate is high. Please please do something.\n\nRegards"
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "The security guard and the facilities provided by the hospital is just not acceptable.\n\nThey does not have the facilities for the attendents, even a single chair to sit. They don't even care for the patient."
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "Manju durgapal works very hard and smartly.she is very kind and helpful.she prick me paniless during collect my blood sample .keep it up."
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "What a pathetic place! I had booked a preventive health check and was clearly told that no other charges would be levied apart from the cost of the health check while making the booking. But on the day of appointment, the billing people insisted that I pay the registration charges before proceeding for the health check up. They just seem interested in taking as much money from people as possible. A total waste of time!\n\nHad appointment with Dr guptaa at 11.45 am finally called at 12.30 pm. Why have appointments, just have walk-ins and let it be absolute chaos."
    },
    {
      "source": "MouthShut",
      "hospital": "Max",
      "review": "I am very happy with there services, Dr. Sharad is is our dr. He is very humble in nature got very good treatment by him, Also nursing staff also very nice Food is also very good in taste and Dietician Shreya is very polite in nature and Done very good consuling And"
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Super Speciality Hospital",
      "review": "I had a wonderful experience at Max Super Speciality Hospital! The facilities are excellent, with clean and modern rooms. Booking an appointment was really easy, which made my visit stress-free. The customer service is outstanding; the staff is friendly and helpful. They truly care about patients. I highly recommend this hospital for anyone in need of quality healthcare!"
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Super Speciality Hospital",
      "review": "My experience at Max Super Speciality Hospital was disappointing. Postop care was especially poor and there was no team assigned for easy communication. We had to struggle to follow up for the next steps and for every small issue, they wanted us to visit the hospital so they could charge a consultation fee. This was all apart from the exorbitant surgery fee charged from us. Once discharge happened, treatment meted out was callous. Will not recommend this hospital to anyone."
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Super Speciality Hospital",
      "review": "My experience at Max Super Speciality Hospital was terrible. The services were extremely overpriced, far exceeding the quality of care provided. I felt like I was being charged for every little thing, with hidden fees that added up quickly. The lack of transparency left me frustrated and disappointed in a place that should prioritize patient well-being."
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Super Speciality Hospital",
      "review": "Hello Abhay ji.We are regular visitors to max hospital patparganj and our family has unfortunately been admitted many a times.  We have good and bad experiences and can reveal the factual feedback.We are still in Room number 1814 with our Mother smt. Rajni Goyal being shifted from MICU on 9th floor.Would have loved to meet you yesterday during your visit to Max Hospital patparganj. Hospital administration should take lead in inviting select customer/ patient.I..."
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Super Speciality Hospital",
      "review": "My experience at Max Super Speciality Hospital was terrible. The hospital was poorly managed, unclean and unhygienic. Doctor visits were delayed, and the wait was long."
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Super Speciality Hospital",
      "review": "Max Super Speciality Hospital has excellent facilities. The rooms are clean and well-maintained, and the staff is very caring. The hospital is equipped with advanced medical technology, ensuring the best treatment for patients. I would highly recommend it for anyone in need of medical care."
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Super Speciality Hospital",
      "review": "Dylasis department in IP extension Patpargunj max is pathetic in hygiene no AC working since 1 month only want to make money never go there"
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Super Speciality Hospital",
      "review": "I visited Max Super Speciality Hospital for a follow-up appointment and received excellent gentle care. The staff was kind and attentive, making sure I felt comfortable throughout the entire visit. Highly recommended!"
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Super Speciality Hospital",
      "review": "Max Super Speciality Hospital is an excellent healthcare facility with state-of-the-art equipment and a well-organised system. The hospital provides top-notch medical services and has a team of highly skilled professionals. The facilities are commendable, and the staff is courteous and attentive. Overall, a reliable choice for quality healthcare."
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Super Speciality Hospital",
      "review": "I went to the Emergency department at Max Super Speciality Hospital and was impressed with the short wait time. The staff was efficient and I didn`t have to wait long to see a doctor. Excellent service!"
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Super Speciality Hospital",
      "review": "Deeply Disappointed with Max Hospital Shalimar Bagh and Dr. Sajan RajpurohitMy experience with Max Hospital, Shalimar Bagh, during my father`s cancer treatment was extremely painful and disappointing. My father was under the care of Dr. Sajan Rajpurohit and his team. When his condition became critical, he was admitted to the ICU — a place where every moment counts and where the presence of the primary doctor is crucial.Shockingly, Dr. Sajan Rajpurohit never visited my father in the..."
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Super Speciality Hospital",
      "review": "The hospital recently increased its prices for day care rooms and along with it They have worsened their facilities. The patient doesn`t get breakfast or lunch anymore. An overly priced coffee is served cold. When asked to cover the medicines under the insurance, They denied saying ``We dont cover medicines to be taken home under insurance for patients who have HDFC ERGO insurance``.  When I personally contacted the insurance company they said they`ll cover everything, It is hospital`s fault for not doing..."
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Super Speciality Hospital",
      "review": "So I called at reception and that guy is asking me for money to get the patient registration I mean seriously wht the hell he said that as you are new patient you need to register your self first and for that you need to pay ..... I want to ask is it any app or a hospital.... Or is this a shop....."
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Super Speciality Hospital",
      "review": "# भगवान की शक्ल में यमदूत बैठे हैं गला काटने के लिए सोच समझकर जाना, आपातकालीन वार्ड के डॉक्टरों & कर्मचारियों का भी बहुत बुरा हाल है @ Dr.Inder Mohan Chug(Pulmonologist Senior Director Max Hospital Shalimar Bagh) & At Emergency Ward."
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Super Speciality Hospital",
      "review": "We had an excellent experience at Max Super Speciality Hospital. The supervision was really good, ensuring everything ran smoothly. The staff were attentive and always ready to help. It`s also easily accessible, which is a big plus. The facilities are top-notch, and the treatment we received was outstanding. I highly recommend this hospital for anyone needing care! There Robotic Hysterectomy helped our patient in fastest recovery. Thanks again to Dr. Ankita, Miss Suruchi and their whole team for providing..."
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Super Speciality Hospital",
      "review": "This is my second experience in especially HDU... Their staff is highly irresponsible and not at all caring towards patient... They don`t give medicine to patients and in case of any issue our patient have to call them for hours and then they revert... They are thoroughly lazy and useless and least bother about patients health and care...."
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Super Speciality Hospital",
      "review": "Max Super Speciality Hospital has a caring staff that provides gentle care to its patients. It is well connected and easily accessible. The regular doctor visits ensure proper monitoring and personalized treatment. Overall, it offers an excellent healthcare experience."
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Super Speciality Hospital",
      "review": "My father was admitted on 28/2/23 in T2 9th floor.. I would like to thank to all the staff nurse for their efforts and the way they are giving care for the patient,speacilly the staff nurse Neelu, pinky, Tenzin yega, shikha, pushpa and all the staff.."
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Super Speciality Hospital",
      "review": "Worst worst docter seema jain ,she gave me disease called vulvodynia ...which caused me burning and nerve pain in vagina...she gave capsule to put inside vagina which irritated my nerves .today i am suffering with nerve pain in vagina. Dont know from where she got her medical degree.Max hospital do not listen feedback or complaints we tell them about docter.sundeep bhat he does not reply back to email"
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Super Speciality Hospital",
      "review": "Genuine Feedback:-Most pathetic experience with Max shalimar bagh I have recently faced... I have never seen such a rude and unprofessional staff over there ..... Staff at Admission desk most rude people.... MICU3 staff just do lots of noise in ICU... pateint feel really uncomfortable there..... I will never recommend anyone max shalimar bagh.... They dnt care about your life they only need money.  Pathetic pathetic pathetic"
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Super Speciality Hospital",
      "review": "Deeply Disappointed with Max Hospital Shalimar Bagh and Dr. Sajan Rajpurohit and his team.My experience with Max Hospital, Shalimar Bagh, during my father`s cancer treatment was extremely painful and disappointing. My father was under the care of Dr. Sajan Rajpurohit and his team. When his condition became critical, he was admitted to the ICU — a place where every moment counts and where the presence of the primary doctor is crucial.Shockingly, Dr. Sajan Rajpurohit never visited my..."
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Super Speciality Hospital",
      "review": "Yesterday I got discharged from max hospital shalimar bagh I was admitted there for my uterus removal surgery. I never write a review but today I want to tell that how grateful I am to my dr. Suneet kaur Malhotra who treated so well that I am  feeling great and fine. Thanku so much.🙏.special thanks to ms. Rupa(coordinator)she helped like a family member taking care.Now for staff of 5th floor A BIG THANKS.caring...attentive...always with big smile...which melts your pain. I can`t find more words..so thank..."
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Super Speciality Hospital",
      "review": "This hospital is going down, it`s not a hospital but a mall, greedy doctors and unethical management."
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Super Speciality Hospital",
      "review": "My father is admitted to the hospital and has difficulty understanding Hindi. I was on the ground floor attending to something when, at 8:45 PM, the doctor came for his rounds. My father called me and said, ``Son, please come quickly; the doctor is here and has said something, but I can`t understand it.`` I rushed to the lift, but when I got there, the security guard ( **a lady named MADHU SAI** ) asked for my visitor`s pass. I explained that I had left it in my father`s room, so I showed her a photo of i..."
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Super Speciality Hospital",
      "review": "Worst hospital  max Shalimar bagh .If you don`t love your family ,go immediately max(suneet jain 9311174800)"
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Super Speciality Hospital",
      "review": "My wife got surgery on 13Dec24 by Dr. Seema Jain(Gyn).My Observation.Only a life lived for others is a life.Thanks her and her supporting staff.वह ने केवल एक उत्कृष्ट Dr. है,  मिलनसार दृष्टिकोण,निस्वार्थ सेवा, एवम मानवीय मूल्यों वाली एक बुद्धिमान टीम है।इसी तरह  Selfless मानव सेवा करती रहें, बड़ों का आशीर्वाद उनके साथ हमेशा रहेगा।राकेश जुयालपानीपत7983060288"
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Super Speciality Hospital",
      "review": "I admitted on 9th floor T2 , my experience was very good . Staff behaviour is so humble , Tenzin yega , Divya ,geetanjali and sehar four of them are very good . All house keeping is good gda . All are good .. I`m happy with hospitality ."
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Super Speciality Hospital",
      "review": "The worst ever experience I have got in my fifty eight years of life.They never show you your test reports, they never tell you exactly what happened to the patient, which medicines are being given. Their intention is only to grab money as much as they can. Please don`t try them if you are really careful about your health and wealth."
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Super Speciality Hospital",
      "review": "No good doctor ko bola Gaya hai customer ko bewakoof banao use Jada Paisa nikal skte ho utna niklo use koi fark nahi padta patient ko kuch bhi ho pls 🙏 jaise Paisa karb karna hai uske liye best hai 😡😡"
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Super Speciality Hospital",
      "review": "Max Super Speciality Hospitals of gastroenterology department is very poor"
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Super Speciality Hospital",
      "review": "Dr must be on time as per the scheduled appointment ......"
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Super Speciality Hospital",
      "review": "Ek number ka fraud hospital hai doctor bhi chor hai waha k"
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Super Speciality Hospital",
      "review": "Worst hospital and doctors are too never suggest even to any enemy"
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Super Speciality Hospital",
      "review": "Experience very good.housekeeping very very excellent 👌.Tapan and unnati very cooperative person."
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Super Speciality Hospital",
      "review": "Very nice services from doctors and nurses . Behaviour was very good of nurse nandini"
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Super Speciality Hospital",
      "review": "Scam hospital they are just to suck ur money not for treatment, kindly beaware of this hospital. Kangal bana kar chhodega aur uske baad bhi aapka marij theek nahi hoga aur ap dar dar ki thokar khate firoge.... Aisa hai ye hospital"
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Super Speciality Hospital",
      "review": "If anyone wants to get a preventive health checkup from Max Hospital, Shalimar Bagh, I would recommend them not to go.I have had the worst experience ever! I chose the highest package, Titanium, for my mother, costing a whopping 18k!I took this package in December! It`s the end of July, and I still don`t have all my reports and still haven`t had all of the doctor`s consultations!Let me take you through the whole episode!1. In December, I took the Titanium pa..."
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Super Speciality Hospital",
      "review": "My father addmit room number 2804  today he is discharge, i am very happy because my father feel good that`s why I appreciate one girl ms. Sandhya Gautam she is very supportive help full and she is providing food  in my father room all staff very hardworking nice i am come visit again I will see you all of you next time"
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Super Speciality Hospital",
      "review": "The management of the new, cancer dedicated building of the max hospital, Shalimar Bagh, is beyond pathetic. All the nursing staff is hired in bulk. And proved to be incompetent. My father has been admitted into this hospital 3-4 times and Every time we faced a tough time from the nursing staff.1. The nurse didn`t give my father insulin but claimed she did. Resulting, his sugar level spiked to 575.2. In another case, nurse gave 1250mg of levipil medicine. When he`s prescribed to ta..."
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Super Speciality Hospital",
      "review": "I`m so happy that Dr. SEEMA JAIN  Veteran gynecologist and her team had done my Normal delivery in Max hospital.I Had a very good experience with Max hospital.Staff is very cooperative and well maintained and well mannered as well.Dr.seema mam is not only a well experienced Obstetrician-Gynecologist but a wonderful human being as well. She took very good care of mine in my entire pregnancy and helped me in giving birth a very beautiful angel.I can say normal delivery is like a dream for ..."
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Super Speciality Hospital",
      "review": "I am fully satisfied with the hospital service. the hospital staff is also cooperative and helpful. Excellent treatment by the doctor,.  You don`t have to wait long like other hospital  Great customer service The equipment used by the doctor is clean and hygienic.  Infrastructure is also good and you easily reach their by  public transport means"
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Super Speciality Hospital",
      "review": "It was easy to book an appointment on my kids emergency sickness issue.. They have well coordinating staff ..they handle the panic situation of parents well.. Reasonable price and excellent treatment. Clean and hygienic place to visit during sickness notion."
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Super Speciality Hospital",
      "review": "Max Super Speciality Hospital is a well-regarded healthcare facility known for its commitment to providing high-quality medical care to its patients. The hospital has a team of experienced and highly skilled doctors, nurses, and support staff who work together to provide the best possible care. The facilities at Max Super Speciality Hospital are clean, comfortable, and equipped with the latest tools and technology."
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Super Speciality Hospital",
      "review": "We are fully satisfied with the service the hospital staff are very cooperative and helpful. Doctor treatment are very good the hospitalon a whole has a good environment and its very clean and very hygienic overall the experience is very helpful and the advise are good"
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Super Speciality Hospital",
      "review": "I have severe pain of stone in gall bladder from last 2018 & we coordinate with many hospital but nobody ready to operate due to high blood pressure but when we consult with doctor in max, they are check my case history & provide best treatment & within a week my blood pressure control then they have done my surgery. now I am relief from unbearable pain."
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Super Speciality Hospital",
      "review": "DR. Rajesh Upadhya  is a professional and highly experienced doctor. Understands the concerns and treats accurately. I have been taking treatment from Dr.Rajesh and have benefited from my chronic acute acidity and digestion problem. He has deep knowledge on the subject and works with perception.  Ms.Geetanjali his assistance is truly and a kind and helping natured person to guide and help the patience with the procedures."
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Super Speciality Hospital",
      "review": "Hello I m Neha my mother is cancer patient. The staff of oncology is very caring spl thanks to pantry section they provide good and healthy food special thanks to Ms farheen and her manager Mr Rajiv malhotra.he is taking good care of patients and time to time he interact with patient really I appreciate.Thanks max hospital for taking good care of patients....🙏♥️"
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Super Speciality Hospital",
      "review": "I m here in Oncology department.there are super staff as nurse or medicine.We are here bad no.2809 in oncology new building.here carring nurse Ramanpreet is super in behave and very hard worker and humble here in medicine Raveena dixit is also hard worker .such here is very good staff fo nursing."
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Super Speciality Hospital",
      "review": "House keeping staff Rahul is very helpful i am oncology patient is man is very carring and supporting"
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Super Speciality Hospital",
      "review": "Online OPD means nothing you faced such crowds for getting a slip for OPD ...You must come in morning because OPD reg start from 8:30 to 10:30 only.Ready for faced huge crowd NO COVID protocol follow here so must wear mask and all .Doctor are good in nature but population impact 😭"
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Super Speciality Hospital",
      "review": "Patients to be taken to emergency are regarded as loosers .. no one bothers .. the patient is not even allowed to enter the emergency reception area...but has to stay there with all the mosquitos..Kindly do not take your patient who is in urgent medical treatment there...Option of negative stars should be made available for Max Shalimar Bagh Emergency segment."
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Super Speciality Hospital",
      "review": "This hospital`s infrastructure is quite good and offers most services. It offers huge amount of green space which provides a good and comfortable vibe to patient . The doctors are excellent and friendly and answers any and all queries clearly. The nursing staff is very experienced responsive and friendly . Overall and amazing staff.Thanks"
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Super Speciality Hospital",
      "review": "Good communication skills, put you at ease to get your history and friendly nature. Explains health issues very politely. Doctor is nice and soft spoken. He spends time in symptom analysis and explains the problem well before writing his prescription. He thoroughly guided for treatment including my timetable changes and it actually helped me a lot. I would certainly recommend him."
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Super Speciality Hospital",
      "review": "Billing counter 3/4 members tyme 8 pm to 9 pm timing    date 24/8/2022 Wednesday  all are cheater and bad behavior with patients also cheap language please on the spot hard action and remove from job. Otherwise hospital day by day down to down this situation. in life I can't suggest and admit this hospital very very bad experience."
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Super Speciality Hospital",
      "review": "The nursing staff is very helpful specifically Anisha, she is very professional and remains concerned about each and every patient`s health and recovery status.RegardsRitu Singh"
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Super Speciality Hospital",
      "review": "Third class hospital.. rude staff.. above that its pharmacy closes by 8.30 pm. hospital pharmacy are open 24 hours.  if a serious patient is admitted in this hospital.. he will die for sure. because if this bakwaas hospital.. only minting money .that's it..I would like to give zero stars . they don't deserve even negative stars"
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Super Speciality Hospital",
      "review": "Dr. Ankita Chandana , is a boon to her patients. She is excellent in her work. The way she handles her patients is commendable. It hardly matters to her whether that patient is of any govt. panel or direct patient, she treats each and every patient equally and whole heartedly. I am blessed to be her patient  God bless you mam"
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Super Speciality Hospital",
      "review": "One of my friend had terrible experience there with her father,  ultimately they cheated them with a lot of money and her father lost his life."
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Super Speciality Hospital",
      "review": "Dr. Ankita chandana is a highly qualified and experienced gynaecologist.Her kind and empathetic attitude towards her patients leaves  no room for doubts and apprehensionsShe is truly an asset to the team maxGreat team of doctors at max shalimar bagh ! Highly recommended"
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Super Speciality Hospital",
      "review": "Dr. Anil Kumar Varshney is the best urologist I have ever met. Awesome person understand each and every situation of the person."
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Super Speciality Hospital",
      "review": "One of the best hospital in India having Best diabetes doctors.Any one suffering from diabetes should go for the treatment under Dr. Pankaj Aneja and Dr. Gaurav Bhalla .*****"
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Super Speciality Hospital",
      "review": "I admitted my wife Asha Jain (registered phone no 9650291090, SSN No. 040366640) at shalimar bagh on 2.3.2017 under the treatment of Dr Deepak Jain Nephrologist and was discharged on 8.3.2017. At the time of discharge it was written by the doctor to see him again on 11.3.2017 with some blood test reports.I contacted the said doctor on 10.3.2017 to know the time of visit on 11.3.2017. I was surprised to know that the said doctor refused to attend the patient on 11.3.2017 and asked to attend on 14.3.2017. I..."
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Super Speciality Hospital",
      "review": "Making money by cheating patients."
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Super Speciality Hospital",
      "review": "They are looting people at the name of investigations ..!Avoid max"
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Super Speciality Hospital",
      "review": "Nurse Dolly from MISU-2 and Geeta 3 really helped my father in the ICU for a faster recovery."
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Super Speciality Hospital",
      "review": "Sonia sindhu nurse... very helpful and soft spoken... very delighted"
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Super Speciality Hospital",
      "review": "Good staff of house keeping, maintenance , sisters are helpful !!!"
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Super Speciality Hospital",
      "review": "Meet orthopedic doctor appointments"
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Super Speciality Hospital",
      "review": "Excellent work by dr kk trehan`s team. fully satisfied"
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Super Speciality Hospital",
      "review": "Best hospital,Qualified Doctors and excellent management"
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Super Speciality Hospital",
      "review": "Best hospital. Best services. Excellent staff"
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Super Speciality Hospital",
      "review": "Excellent services given by the MICU"
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Super Speciality Hospital",
      "review": "Pathetic service, the doc in emergency had no idea what he was dealing with"
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Super Speciality Hospital",
      "review": "3rd class treatment in this hospital."
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Super Speciality Hospital",
      "review": "Worst experience ever. Make normal case worst."
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Super Speciality Hospital",
      "review": "A nice hospital, very helpful staff. Fast service.. Clean.. All doctor`s panel is bestest..."
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Super Speciality Hospital",
      "review": "Best Hospital with best care...Excellent team of qualified doctors"
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Super Speciality Hospital",
      "review": "Worst Hospital. Dhaku and all commission agents."
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Super Speciality Hospital",
      "review": "Very poor, service not satisfied..!"
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Super Speciality Hospital",
      "review": "H. k. Tapan ID 139"
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Super Speciality Hospital",
      "review": "Call is not pic my"
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Super Speciality Hospital",
      "review": "Make normal case worst"
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Super Speciality Hospital",
      "review": "Excellent team work"
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Super Speciality Hospital",
      "review": "Very good service"
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Super Speciality Hospital",
      "review": "Nice service"
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Super Speciality Hospital",
      "review": "Very poor service."
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Super Speciality Hospital",
      "review": "Very good service"
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Super Speciality Hospital",
      "review": "best hospitality."
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Super Speciality Hospital",
      "review": "Very caring"
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Super Speciality Hospital",
      "review": "Best hospital in Delhi."
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Super Speciality Hospital",
      "review": "Excellent hospital"
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Multi Speciality Centre",
      "review": "Had appointment with Dr guptaa at 11.45 am which finally came at 12.30 pm. Joke of appointment management."
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Multi Speciality Centre",
      "review": "Max Multi Speciality Centre offers a comprehensive range of medical services, featuring experienced doctors and skilled physiotherapists. While the costs can be on the higher side, the quality of care and advanced treatments justify the price. The facility is well-equipped and staff are attentive, ensuring a positive experience for patients. For those seeking top-notch healthcare in a comfortable environment, Max Multi Speciality Centre is worth considering despite its premium rates."
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Multi Speciality Centre",
      "review": "Preventative health check up.Overcrowded, long queues, nowhere to sit, everyone in a horrible rush. I`m not sure any of the tests were done responsibly given the rush. Some tests weren`t done as the doctor had gone home. Doctors too rushed through tests as they had no time. Horrible experience. Never again."
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Multi Speciality Centre",
      "review": "The care at Max Multi Speciality Centre is terrible. The standards are low and the staff seem indifferent. I wouldn`t recommend this place to anyone."
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Multi Speciality Centre",
      "review": "My all documents clear. but (dr ritika o.p.d)said not complete your documents and very rude behaviour and bad talk ..... plz take a action... im waiting before 2 days and today also Wait 4 hors .. and  only 1 minutes talk with me only 1 secend check my paper and say not complete.  I tell very litly mam my problem is thise plz try to understand but. she sey i don`t no go don`t waste my time  like that... i belong high family background  but now my situation is bad   but she not understand... im not coming ..."
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Multi Speciality Centre",
      "review": "Max Multi Speciality Centre is an excellent choice for healthcare needs. With short wait times, easy booking, and attentive staff, it offers gentle care and excellent treatment. The facility is clean, well-priced, and easily accessible. Highly recommended for anyone seeking quality healthcare services."
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Multi Speciality Centre",
      "review": "Top most multi-speciality hospital in Ongole. They providing treatment for Orthopaedic related issues, Gynachology, BP, Diabetes, genera physician, paralysis, physiotherapy, oncology and more. We can experience clean and hygiene environment with cooperative staff."
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Multi Speciality Centre",
      "review": "What a pathetic place! Just concerned with making as much money as possible from people."
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Multi Speciality Centre",
      "review": "Bad customer care,long wait without response , transferring call to other extnWorst experience"
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Multi Speciality Centre",
      "review": "Thanks doctor for the great treatment."
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Multi Speciality Centre",
      "review": "A   b ka whole square"
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Smart Super Speciality Hospital",
      "review": "Nishant dave and mandeep singh aluwalia have been very helpful and courteous in Admission of my mother sneh arora.."
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Institute Of Cancer Care",
      "review": "For the x ray for uk visa i m penning my bad experience, the radiologist seems inefficient , she needs to have thorough knowledge about reading the x ray clearly than give her opinionI am a doctor I went there for for a  tb test for uk visa  She mentioned some nodule I even consulted other radiologist with the x ray all radiologist whom I consulted  said its normal ,But In maxmed city lajpat nagar even the doctor who are sitting n earning money are cluless they read only the report done by r..."
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Institute Of Cancer Care",
      "review": "Very well maintained"
    },
    {
      "source": "JustDial",
      "hospital": "Max",
      "location": "Max Institute Of Cancer Care",
      "review": "Super service"
    }
  ],
  "review_count": 206,
  "news": [
    {
      "source": "Brave News",
      "hospital": "Max",
      "headline": "Resources for Patients and Families | Maxim Healthcare"
    },
    {
      "source": "Brave News",
      "hospital": "Max",
      "headline": "Max Healthcare Blog - Healthcare and Medical Blogs | Max Hospital"
    },
    {
      "source": "Brave News",
      "hospital": "Max",
      "headline": "max healthcare: Max Healthcare launches Max@Home, brings patient care to homes - The Economic Times"
    },
    {
      "source": "Brave News",
      "hospital": "Max",
      "headline": "Max Healthcare for Highest Standards of Medical Services and Medical Education | Max Hospital"
    },
    {
      "source": "Brave News",
      "hospital": "Max",
      "headline": "Publication"
    },
    {
      "source": "Brave News",
      "hospital": "Max",
      "headline": "Fact Sheet | Max Healthcare"
    },
    {
      "source": "Brave News",
      "hospital": "Max",
      "headline": "Allied and Support Services Programs | Max Hospital"
    },
    {
      "source": "Brave News",
      "hospital": "Max",
      "headline": "[PDF] Maxicare Healthcare Corporation - Free Download PDF"
    },
    {
      "source": "Brave News",
      "hospital": "Max",
      "headline": "Max Healthcare Sees Rs. 92.97 Crore Block Trade on NSE"
    },
    {
      "source": "Brave News",
      "hospital": "Max",
      "headline": "Best Hospital in Saket, Delhi, India for Cancer, Neurology, Kidney, Gastroenterology & Many Other Specialities | Max Super Speciality Hospital"
    },
    {
      "source": "Brave News",
      "hospital": "Max",
      "headline": "Maxhealthcare"
    },
    {
      "source": "Brave News",
      "hospital": "Max",
      "headline": "Max Medical Journal, Check Latest Medical Research, Reviews, and Guidelines"
    },
    {
      "source": "Brave News",
      "hospital": "Max",
      "headline": "Max Research Centre"
    },
    {
      "source": "Brave News",
      "hospital": "Max",
      "headline": "Clinical Excellence Reports | Max Hospital"
    },
    {
      "source": "Brave News",
      "hospital": "Max",
      "headline": "Max Healthcare Unveils Ambitious Plan to Add Over 8,300 Hospital Beds"
    },
    {
      "source": "Brave News",
      "hospital": "Max",
      "headline": "Max Healthcare Q1 FY21 Performance | Max Hospital"
    },
    {
      "source": "Brave News",
      "hospital": "Max",
      "headline": "Max Healthcare clocks 59% YoY jump in Q2 PAT; | Capital Market News - Business Standard"
    },
    {
      "source": "Brave News",
      "hospital": "Max",
      "headline": "Max Healthcare Q2 Results | Profit jumps 74% on higher outpatient, international patient revenue - CNBC TV18"
    },
    {
      "source": "Brave News",
      "hospital": "Max",
      "headline": "Medical, Nursing and Allied Health Programs | Max Hospital"
    },
    {
      "source": "Brave News",
      "hospital": "Max",
      "headline": "Max Healthcare Foundation"
    },
    {
      "source": "Brave News",
      "hospital": "Max",
      "headline": "How Max Healthcare is Expanding Patient Care in a Hybrid/Multi-Cloud World"
    },
    {
      "source": "Brave News",
      "hospital": "Max",
      "headline": "Maxicare Group ushers in the start of a unified era of complete care | The Manila Times"
    },
    {
      "source": "Brave News",
      "hospital": "Max",
      "headline": "Maximum Health - General Medicine Practice - Online"
    },
    {
      "source": "Brave News",
      "hospital": "Max",
      "headline": "Physiotherapy: Best Physiotherapy Hospital in Delhi, India | Max Healthcare"
    },
    {
      "source": "Brave News",
      "hospital": "Max",
      "headline": "LifesavER Plus - Premier Healthcare Provider in the Philippines | Maxicare Corporation"
    },
    {
      "source": "Brave News",
      "hospital": "Max",
      "headline": "Max Healthcare Bangla | International"
    },
    {
      "source": "Brave News",
      "hospital": "Max",
      "headline": "Terms and Conditions - Maxicare Health Services Inc."
    },
    {
      "source": "Brave News",
      "hospital": "Max",
      "headline": "List of Services - Premier Healthcare Provider in the Philippines | Maxicare Corporation"
    },
    {
      "source": "Brave News",
      "hospital": "Max",
      "headline": "Max Super Specialty Hospital, New Delhi | Top Hospital in India | Top Doctors| Specialities | Facilities | Services| Awards"
    },
    {
      "source": "Brave News",
      "hospital": "Max",
      "headline": "Benefits and Coverage - Premier Healthcare Provider in the Philippines | Maxicare Corporation"
    },
    {
      "source": "Brave News",
      "hospital": "Max",
      "headline": "Internal Medicine Videos: Treatments, Procedures, Surgeries, Expert Talks | Max Hospital"
    },
    {
      "source": "Brave News",
      "hospital": "Max",
      "headline": "Max Healthcare Immigration Medical Services, Medical Checkup for Visa in India"
    },
    {
      "source": "Brave News",
      "hospital": "Max",
      "headline": "Max Super Speciality Healthcare Group in India | Prices, Doctors, Patient Reviews"
    },
    {
      "source": "Brave News",
      "hospital": "Max",
      "headline": "Bio Medical Report | Max Hospital"
    },
    {
      "source": "Brave News",
      "hospital": "Max",
      "headline": "MEM GWU (Emergency Medicine): Fees, Admission, Eligibility, Syllabus & Scope"
    },
    {
      "source": "Brave News",
      "hospital": "Max",
      "headline": "Best Internal Medicine Hospital in Delhi | Max Hospital"
    },
    {
      "source": "Brave News",
      "hospital": "Max",
      "headline": "Maxicare Helpdesk - Premier Healthcare Provider in the Philippines | Maxicare Corporation"
    },
    {
      "source": "Brave News",
      "hospital": "Max",
      "headline": "Primary Care Clinic - Premier Healthcare Provider in the Philippines | Maxicare Corporation"
    },
    {
      "source": "Brave News",
      "hospital": "Max",
      "headline": "Max Healthcare Education: Degree, Diploma & Certificate Programs"
    },
    {
      "source": "Brave News",
      "hospital": "Max",
      "headline": "Hospital Amenities - Visiting Hours, Dos and Donts, Help Desk | Max Hospital"
    },
    {
      "source": "Brave News",
      "hospital": "Max",
      "headline": "Max Healthcare in Media, Latest News and Updates | Max Hospital"
    },
    {
      "source": "Brave News",
      "hospital": "Max",
      "headline": "About MaxAtHome: Trusted healthcare services at home"
    },
    {
      "source": "Brave News",
      "hospital": "Max",
      "headline": "Get Care | Premier Healthcare Provider"
    },
    {
      "source": "Brave News",
      "hospital": "Max",
      "headline": "Online Doctor Consultation in India, Video Consultation | Max Hospital"
    },
    {
      "source": "Brave News",
      "hospital": "Max",
      "headline": "(PDF) Patient Care Management"
    },
    {
      "source": "Brave News",
      "hospital": "Max",
      "headline": "California | Maxim Healthcare Services"
    },
    {
      "source": "Brave News",
      "hospital": "Max",
      "headline": "Products - Maxicare Health Services Inc."
    },
    {
      "source": "Brave News",
      "hospital": "Max",
      "headline": "Max Academics - Health Education and Training For Professionals"
    },
    {
      "source": "Brave News",
      "hospital": "Max",
      "headline": "Maxicare Best Care - The secret to living your best life"
    }
  ],
  "news_count": 49,
  "collection_date": "2025-11-20T00:24:03.292118"
}