{
  "hospital_name": "Fortis",
  "reviews": [
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Hospital Vasant Kunj Delhi",
      "review": "My experience in this hospital was so bad,that I won`t recommend anyone.In dis hospital there is 6 OT, 65 ICU beds but there is no proper waiting area for the attendant n visitors.they provided bed for attendant but only at 8pm to 6am only, and whole day we have to sit on the staircase coz there were only 8 seats outside the ICU for attendant  . They recommend us to wait in the waiting area of OPD that was on the basement and the ICU is in 3rd Floor, if they call the name in emergency how can we reach the..."
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Hospital Vasant Kunj Delhi",
      "review": "I had a great experience with Fortis Hospital Vasant Kunj in Delhi. The hospital has good prices, so I felt it was fair. Booking an appointment was easy and quick. The staff were friendly and helped me when I needed it. Overall, I am very happy with my visit to Fortis Hospital."
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Hospital Vasant Kunj Delhi",
      "review": "My experience at Fortis Hospital Vasant Kunj Delhi was terrible. The management was poor, and the assistance provided was unsupportive. I felt neglected and frustrated throughout my time there. I would not recommend this hospital to anyone."
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Hospital Vasant Kunj Delhi",
      "review": "I had a great experience at Fortis Hospital Vasant Kunj in the ICU department. The care was of high standard and the follow-up appointment was quick, with a wait time of less than one hour."
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Hospital Vasant Kunj Delhi",
      "review": "I went there for the emergency ward the doctor won`t even help me with the relief medication unless i stay overnight which i have to spend 35k.. if u want to live for another day please don`t visit"
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Hospital Vasant Kunj Delhi",
      "review": "Doctor are very careless behaving unprofessionaly in emergency first aid me they charge 13000 really guys horrible experience"
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Hospital Vasant Kunj Delhi",
      "review": "The quality of critical care and patient care services have severely deteriorated. My patient was neglected by ICU staff and doctors for more than 6hrs and was not give timely medication to stabilize patient condition. Apart from that billing deptt will keep chasing you even if there is small outstanding amount without taking the responsibility of providing the explanations. For even small things, you have to reach Patient experience deptt having insufficient experienced staff"
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Hospital Vasant Kunj Delhi",
      "review": "Fortis Hospital Vasant Kunj Delhi is a top-notch medical facility providing excellent treatment. The doctors and staff are highly skilled and compassionate, ensuring the best care for patients. The hospital maintains high standards of hygiene and safety, making it a trusted choice for medical needs."
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Hospital Vasant Kunj Delhi",
      "review": "Main apne father ko Chalta hua Lekar gaya tha unhe thoda breathing issue tha. Unhone Emergency me admit kiya Lung Infection batakar. Bola aap ghar jayen koi requirement hogi to aapko call kardenge. 2 ghante baad call kiya ke unko ventilator par rakhna hoga. Fir ek ek karke unko Multiple organs involve bata diye. Right leg me DVT ho gaya. Mind me Blood Clot bata diya, Heart Attack bata diya, Dialysis kardiya. Hum Roj ek hope lekar wahan jaate they ke aaj sab theek hoga. Magar sirf paisa kamane ka jariya ha..."
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Hospital Vasant Kunj Delhi",
      "review": "I consult there yesterday it was a good experience there. All the staff  and services was excellent 👌"
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Escorts Okhla",
      "review": "This hospital is full of jokers in the form of doctors and dietitians. My patient has undergone heart surgery here. I got a chance to talk to the dietician who was monitoring the diet post surgery. I asked what is my patient eating during …MorePhoto 1 in review by Kumar SambhavPhoto 2 in review by Kumar Sambhav1Principal ESCON1 review·3 photosa week agoNewIt was a pleasant moment for visiting the hospital as the part of our educational visit at Delhi. ..."
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Escorts Okhla",
      "review": "Fortis Escorts Okhla is a great hospital. The staff are very caring and always ready to help. They listen to you and respond quickly to your needs. The treatment I received was excellent, and the doctors are very skilled. I felt safe and well taken care of during my visit. I highly recommend this hospital for anyone who needs good medical care!"
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Escorts Okhla",
      "review": "Had a great experience as I had a long stay in hospital. My baby`s surgery was complex and another hospital had declined but Dr Iyer and team agreed to save the baby although they mentioned it would be a long battle. ICU care and post op care in ward was good . Nurses were friendly and smiled a lot. They also listened when i complained and tried their best to make me comfortable and satisfied. Nurse Boby was kind and prayerful and  checked up on me from day 1 and encouraged me to be strong.The..."
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Escorts Okhla",
      "review": "I had a great experience at Fortis Escorts Okhla. The hospital is very clean and well-organized. The staff is friendly and helpful. They took good care of me during my visit. I noticed there was good supervision everywhere, which made me feel safe and comfortable. The doctors answered all my questions clearly. Overall, I was very happy with the service I received at this hospital. It is an excellent place for health care!"
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Escorts Okhla",
      "review": "My experience at Fortis Escorts Okhla was exceptional. The immediate availability of medical services ensured prompt attention, which alleviated my concerns. The staff was professional and attentive, making the process seamless. The facility is well-equipped, providing a reassuring environment for patients. I highly recommend it for anyone needing timely healthcare services."
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Escorts Okhla",
      "review": "Fortis Escorts Okhla is a terrible place. The management is poor, and they don`t care about patients. Communication is bad; staff do not explain things well. Treatment does not work well, and I did not feel better. I waited long times for help, and nobody listened to me. I am very unhappy with my experience here. I do not recommend this hospital at all."
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Escorts Okhla",
      "review": "Hospital is just a complete business. Ni regard to human life. They say No to CGHS patients even in life threatening emergencies.  They just want money by showing false report. Unsympathetic doctors who are given daily targets of operations and bed completion fr cash patients. When cghs is not considered by these hospitals then Why a showoff that we consider panel for all possibilities. Government need to look into this scam where approach of all stupid sorts is tried to the BEDDING uncharge."
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Escorts Okhla",
      "review": "I had a terrible experience at Fortis Escorts Okhla. The staff was not attentive and I felt ignored. The place was unsanitised and very unclean, which made me uncomfortable. The treatment I received was ineffective, and the response time was slow. It is also hard to get to this hospital as it is remotely located. I do not recommend this place for medical care."
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Escorts Okhla",
      "review": "I had an excellent interaction with Fortis Escorts Okhla. The staff was very responsive and attentive to my needs. They provided me with all the necessary information and made sure that I felt comfortable during my visit. Overall, I had a great experience at Fortis Escorts Okhla."
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Escorts Okhla",
      "review": "My husband was taken to the emergency on 30th September2024, and tests were done. I paid 20,000 at the time of discharge the very same day , but when I took him again for a re checkup on 3rd oct 2024,there was no record of his admission and hence they had no record of his  ultra sound report. It is absolutely shameless, that in such a noble institute, this kind of a thing is happening, more over the hospital payment desk took 2000/-for the consultation with Dr Praveen Aggarwal, and Dr didn`t see him . It`..."
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Escorts Okhla",
      "review": "Fortis Escorts Okhla has excellent facilities. The hospital is well-equipped with modern technology and provides top-notch medical services. I highly recommend it for anyone seeking quality healthcare."
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Escorts Okhla",
      "review": "Fortis Escorts Okhla provides excellent accurate diagnosis, organized system, attentive staff, clean & hygienic environment, subsidies available, and great customer service. Highly recommended!"
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Escorts Okhla",
      "review": "Okhla fortis the best hospital  all departments  are good  quality  and nursing care are good  sister Pushpa and urologist  dr paresh Jain the best"
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Escorts Okhla",
      "review": "I like Fortis hospital uroday care department and sister pushpa dogra very good staff houses keeping boy.  Brijat that boy very good 👍👍👍. Rajiv gda boy also good"
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Escorts Okhla",
      "review": "Overall treatment is good, well maintained hospital with attentive staff and doctors. Good experience and great job everyone!!."
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Escorts Okhla",
      "review": "My child died just in 1 week when I chose fortis hospital Delhi, worst nurses and staff, they scold you when you try to ask or tell child condition, never go there. Save your child. A nurse took out the cord from my child`s neck and he got unconscious but no body admit it, just after 1 day my child died.he was my only child and fortis staff snatched him.I curse them always, I wish I could choose better hospital with better staff. May God curse them."
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Escorts Okhla",
      "review": "Pathetic hospital and pathetic staff"
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Escorts Okhla",
      "review": "Very nice behaviour and all nurses staffs or doctorsThanks for allSave my life ❤️"
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Escorts Okhla",
      "review": "Very well maintained hospital and one of the best hospital in Delhi. Clean and hygienic,  well connected, doctors are friendly and well behaved.Very good patient care taking service. Immediate availablity overall I can give him 5 star for their services"
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Escorts Okhla",
      "review": "Highly recommended cheater hospital fortis hospital cardiology department sukhdev vihar I had a terrible experience at Fortis Escorts Okhla. The Cardiology department is over-priced and the wait time for my appointment was more than an hour. On top of that, I was there for a scheduled medical procedure and still had to wait endlessly. The staff was unhelpful and the overall experience was extremely disappointing. I would not recommend this hospital to anyone."
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Escorts Okhla",
      "review": "Horrible management of Dr Ashok Seths opd. My father was given an appointment, he arrived from outstation for the given date and was told that his name is not even there. Multiple PAs we contacted, they only tossed us from one queue to another till my father was giddy and exhausted and we left. We shall never recommend this place to anyone. Big names shallow services...horrible"
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Escorts Okhla",
      "review": "Fortis Escort was the best hospital In Delhi NCR for Heart treatment. My Fater faced Angina pain and got admitted in Fortis escort. Dr. Praveer agarwal diagnose him with Heart blockage and suggested him By pass Surgery.We were afraid initially but then took the best decision for my father. Surgery was done by Dr. Y.K . Mishra. Post surgery staff was Cooperative and awesome. All nurses are from Kerela and They take care of my father very patiently. My father do his regular checkup in Escort Fortis o..."
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Escorts Okhla",
      "review": "We are fully satisfied with the services rendered to the patient. The hospital staff are very courteous and cooperative and helpful. It was a good experience and also the staff were very good.The overall experience with his hospital was very pleasing. This is one place i will recommend any close friend or relatives for any kind of treatment if required.👍👍"
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Escorts Okhla",
      "review": "Amazing experience to visit in the hospital. Wait time was very less. Response was very quick. Hospital staff was very much supportive. Doctors were very generous and kind. Treated by Doctors very well. I would recommend every one to avail the services."
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Escorts Okhla",
      "review": "I had been suffering an unexpected perianal abscess, which was not properly diagnosed by my gynecologist, however she suggested a surgeon and thats how i got lucky i think to met Dr. Shilpa Varma. i found her on practo only. and i was determined to consult her only because of the huge number of good recommendations she already had. and yes, all of them were true."
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Escorts Okhla",
      "review": "There is no doubt that this hospital is one of the best hospital in Delhi or we can say in India. The treatment cost is also one of the biggest factor why it is best. My grandfather admitted here for 7 days for treatment of kidney infection. They treated very well. The sisters are good and have very nice behavior with patient as well as attendant. But after discharge, I think medicine are not properly. They health is reducing day by day. The doctors are best and good in behaviour also. All depands on the ..."
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Escorts Okhla",
      "review": "Got services from urology department in this fortis hospital, doctors were very friendly in nature, they guide us very well without any hassles, environment was excellent, management was very professional. All over I love the experience, however god bless me so that I will never get Ill in future."
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Escorts Okhla",
      "review": "One of the best nephrologist. She`s a great doctor having both compassion and knowledge. Does everything within her reach to mitigate some of the costs that come with the treatment of a kidney patient. My friend was under her care and recovering well. Highly recommend !"
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Escorts Okhla",
      "review": "Have came the Hospital after lot of recommendation. The team of qualified doctors couldn`t perform angioplasty. Doctors not able to explain the reason for failure. No personalized service. My mother was made to wait for 7 hours for the procedure. Despite telling the nurse several timrs that she is diabetic, they kept her without meal for those hrs. And she almost fainted on in the OT with sudden drop in her blood sugar. It`s been 2 days she is kept at hospital and her sugar level now has shooted and there..."
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Escorts Okhla",
      "review": "Courteous staff knowledgeable doctors, conducive environment for recovery of patients,, reasonable charges makes it  attractive destination for Delhi NCR people. keep the good work on."
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Escorts Okhla",
      "review": "All the doctors nurses and staff at  FEHI okhla were wonderful, kind and understanding, I was admitted to the hospital for laparoscopic Cholecystectomy  and was treated with incredible care and skill by the Fortis Team."
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Escorts Okhla",
      "review": "Mr Kalsi performed surgery on me to aid with upcoming fertility treatments with my partner. The surgery went well and I healed well and it was successful and we are now expecting a baby, something that was impossible he made possible thank you."
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Escorts Okhla",
      "review": "Wonderful experience  Dr.  was a wonderful surgeon, and the staff was always helpful and kind. They ensured I had a smooth prep, surgery, and follow-up. I am so glad I chose (Clinic name) and would highly recommend to anyone."
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Escorts Okhla",
      "review": "I would like to write it down about my father experience which is few days back my father was looking for chest doctor and he got from just dial and doctor`s nature was very good because the moment when my father went there at that time doctor was treating like his brother I think you should also go there for the treatment"
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Escorts Okhla",
      "review": "Sincere people and service except few lower level employees who need to watch their behavior. And one suggestion for pharmacy department is please be informative and polite. They have to be experienced also medicine policies has to be recheck."
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Escorts Okhla",
      "review": "I had an appointment there this week. Everyone was nice. They took us right on time with very little waiting. The PA showed us the scan and explained the scan. The doctor answered all our questions. The PA and Doctor were very nice. The ladies who conducted the breathing test were very nice. We`d give them 5 stars so far. Respond to negative reviews hire new Administrated staff! there is a problem with so many complaints on line someone needs to read all of them..."
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Escorts Okhla",
      "review": "Fortis Escort is a heart Specialist Hospital in delhisekhdev vihar My Mother is undergoing for 7 years in escort and she gets all the test done and now she is feeling good health. Excellent service by this hospital they did the check up very satisfied with the diagnosis and the treatment the doctor was very professional and efficient and explained everything this my mother ask this hospital is very good and all facilities excellent treatment well connected caring staff also ver clean and hygiene.. ..."
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Escorts Okhla",
      "review": "Fortis Escorts Heart Institute (FEHI) is a multi-specialty having treatment facilities across every medical stream. It was established in 1988. FEHI has flourished into a medical-care center which has gained high credibility successfully, which is evident from the fact that it is frequented by several generations of Delhiites and also by international patients."
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Escorts Okhla",
      "review": "Excellent service by this hospital. I had problem in my bones . they did th check up very satisfied with the diagnosis and the treatment . the doctors was very professional and efficient and explained everything . excellent treatment ,well connected caring staff also ver clean and hygiene."
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Escorts Okhla",
      "review": "Have been here for nearly 4-5 times till now in last 6 years for my family members and myself. The admission process was fine and they have tried to consider all procedures hassle free and under standard (but somewhat flexible or human) protocols. Overall a satisfactory experience. Mine was always under the corporate health insurance every time, so relate this experience accordingly."
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Escorts Okhla",
      "review": "The doctors at this hospital examine your case from all angles and do not just rush you into surgery.They will even recommend alternative medicine if required. Treatment cost is very affordable for poor people also. All the test facilities are available."
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Escorts Okhla",
      "review": "Cleanliness doctors treatment are best . Overall best experience , the treatment was very good and very helpful staff . I am fully satisfied with the services rendered to patient . The hospital staff are very courteous and cooperative and the way of handling patients is excellent and so soothing that the patient feels immensely confident about their speedy recovery"
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Escorts Okhla",
      "review": "Bernie had an appointment there this week. Everyone was nice. They took us right on time with very little waiting. The PA showed us the scan and explained the scan. The doctor answered all our questions. The PA and Doctor were very nice. The ladies who conducted the breathing test were very nice. We`d give them 5 stars so far.Respond to negative reviews hire new Administrated staff! there is a problem with so many complaints on line someone needs to read all of them"
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Escorts Okhla",
      "review": "Excellent medical facilities and service. this hospital is very clean and hygienic and theris infrastructure and ventilation is good price is very reasonable staff is very supportive accurate testing great customer service"
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Escorts Okhla",
      "review": "Very good doctor and kind at heart. Gives maximum time to hear patient views. His clinical diagnosis is very sharp. Most of the times he avoids surgery and does not do unnecessary surgeries. And, after treatment, he himself calls the patients and follow up their condition, which is a rare quality we see in doctors nowadays. Thank you"
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Escorts Okhla",
      "review": "I was satisfied with the facility of the fehi okhla new delhi, staff was supportive and efficient in every manner like healthcare, hygienic."
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Escorts Okhla",
      "review": "Very bad experience with this hospital. My father was admitted and treated here.They told us that they will do treatment at approximate package of rupees 5,00,000 for peripheral bypass of right leg. It is a 8 days package if my father need further treatment we have to pay more.We arranged and pay for that but after 4 days they asked to submit 1,41,000. My father is in his room and do not require any further operations and treatments.Today is 11 Jan 2020 and my father still in hospital.<..."
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Escorts Okhla",
      "review": "Its the panel hospital for force line..... And gave excellent service from doctor and all stop,, the nurse staff is very coperative with patient"
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Escorts Okhla",
      "review": "Worst hospital in India. This is butcher market. They take money to kill patients. They killed my mom and gave us bill for 4 lacs for 3 days. Dr neeraj Gupta is worst doctor who would God punish for his sins. He told he is not on call when my mom was dying on ICU. Save lives by staying away from this hospital"
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Escorts Okhla",
      "review": "We had very good experience while, we were there in the hospital during getting treatment for my wife, Angioplasty was done by Dr. Praveer Agarwal."
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Escorts Okhla",
      "review": "I am so happy treatment is so good"
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Escorts Okhla",
      "review": "One of the best heart institute of India"
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Escorts Okhla",
      "review": "Good service.Excellent care."
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Escorts Okhla",
      "review": "Not the best"
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Escorts Okhla",
      "review": "Best hospital in the country"
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Escorts Okhla",
      "review": "Best services"
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Escorts Okhla",
      "review": "Fantastic environment."
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Escorts Okhla",
      "review": "Nice service, excellent job."
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Hospital Vasant Kunj Delhi",
      "review": "My experience in this hospital was so bad,that I won`t recommend anyone.In dis hospital there is 6 OT, 65 ICU beds but there is no proper waiting area for the attendant n visitors.they provided bed for attendant but only at 8pm to 6am only, and whole day we have to sit on the staircase coz there were only 8 seats outside the ICU for attendant  . They recommend us to wait in the waiting area of OPD that was on the basement and the ICU is in 3rd Floor, if they call the name in emergency how can we reach the..."
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Hospital Vasant Kunj Delhi",
      "review": "I had a great experience with Fortis Hospital Vasant Kunj in Delhi. The hospital has good prices, so I felt it was fair. Booking an appointment was easy and quick. The staff were friendly and helped me when I needed it. Overall, I am very happy with my visit to Fortis Hospital."
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Hospital Vasant Kunj Delhi",
      "review": "My experience at Fortis Hospital Vasant Kunj Delhi was terrible. The management was poor, and the assistance provided was unsupportive. I felt neglected and frustrated throughout my time there. I would not recommend this hospital to anyone."
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Hospital Vasant Kunj Delhi",
      "review": "I had a great experience at Fortis Hospital Vasant Kunj in the ICU department. The care was of high standard and the follow-up appointment was quick, with a wait time of less than one hour."
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Hospital Vasant Kunj Delhi",
      "review": "I went there for the emergency ward the doctor won`t even help me with the relief medication unless i stay overnight which i have to spend 35k.. if u want to live for another day please don`t visit"
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Hospital Vasant Kunj Delhi",
      "review": "Doctor are very careless behaving unprofessionaly in emergency first aid me they charge 13000 really guys horrible experience"
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Hospital Vasant Kunj Delhi",
      "review": "The quality of critical care and patient care services have severely deteriorated. My patient was neglected by ICU staff and doctors for more than 6hrs and was not give timely medication to stabilize patient condition. Apart from that billing deptt will keep chasing you even if there is small outstanding amount without taking the responsibility of providing the explanations. For even small things, you have to reach Patient experience deptt having insufficient experienced staff"
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Hospital Vasant Kunj Delhi",
      "review": "Fortis Hospital Vasant Kunj Delhi is a top-notch medical facility providing excellent treatment. The doctors and staff are highly skilled and compassionate, ensuring the best care for patients. The hospital maintains high standards of hygiene and safety, making it a trusted choice for medical needs."
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Hospital Vasant Kunj Delhi",
      "review": "Main apne father ko Chalta hua Lekar gaya tha unhe thoda breathing issue tha. Unhone Emergency me admit kiya Lung Infection batakar. Bola aap ghar jayen koi requirement hogi to aapko call kardenge. 2 ghante baad call kiya ke unko ventilator par rakhna hoga. Fir ek ek karke unko Multiple organs involve bata diye. Right leg me DVT ho gaya. Mind me Blood Clot bata diya, Heart Attack bata diya, Dialysis kardiya. Hum Roj ek hope lekar wahan jaate they ke aaj sab theek hoga. Magar sirf paisa kamane ka jariya ha..."
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Hospital Vasant Kunj Delhi",
      "review": "I consult there yesterday it was a good experience there. All the staff  and services was excellent 👌"
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Hospital Vasant Kunj Delhi",
      "review": "Great experience as a first timer . I barely waited to be helped when I checked in . The staff and Dr Arvind were all very friendly and helpful. I especially loved how Dr Arvind really took his time to explain my conditions with me as well as my treatment options . I had a great visit and the doctor`s demeanor has really put me at ease so I highly recommend this clinic ."
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Hospital Vasant Kunj Delhi",
      "review": "The hospital takes good care of even the smallest of amenities for its patients and attendants. All the staff of the hospital like billing staff, housekeeping staff, nurses, guards even the doctors are well mannered and efficient in their work. They treat patients well."
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Hospital Vasant Kunj Delhi",
      "review": "I admitted in this hospital 3rd time in very bad condition. My Doctor Dr. Ajay Aggarwal and his team, Nursing head Ms. Reena and her whole team, Hospitality Staff, Housekeeping team and all other staff are very supportive and helpful. I am very thankful for all of them."
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Hospital Vasant Kunj Delhi",
      "review": "Very good hospital with ample amount of car parking, barrier free entrance (easy access for differently ambled person), reasonable fee structure as compared to other private hospitals. Very neat, clean and green environment inside out of the building. Very helpful doctors, nurses and all staff. Almost all radiology facility, blood bank, medical store, emergency, general and private OPD, well equipped IPD with more than 350 beds. Modern and well equipped major and minor OTs, ICUs with one Canteen and one a..."
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Hospital Vasant Kunj Delhi",
      "review": "I had an appointment with Doctor.            Today at Fortis Vasant Kunj. He is extremely  patient and answered all my queries. I feel blessed to be in the hands of Doctor        .His team member Nancy is also very cooperative"
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Hospital Vasant Kunj Delhi",
      "review": "Doctors or staff sirf bill banate hai  patient ki sacchai nahi batate inko bs Paisa lene se matlab hai inki wajha se mere papa hospital m 95% or bad m 100% death ho gay the or . nhone hame bataya tak nhi .i.c.u mai rakhte hai ye sabhi ko darate hai or sidha i.c.u mai admission kr dete hai pls vasant kunj Fortis hospital m nhi jay . Bhagwan ki Kasam mere Mann se itni baddua nikalti h in doctor or staff jinhone mere papa ka elaz Kiya unke liye . in hone hame bataya tak nhi mere papa ki back side puri kamar ..."
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Hospital Vasant Kunj Delhi",
      "review": "Owner behaviour is very good.hospital is very clean & hygienic .he have sterilised equipment.he gives his service in very reasonable price in this hospital have patient subsidies available he provides quick service for the patient staff is very connected and experienced."
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Hospital Vasant Kunj Delhi",
      "review": "In aug this year I delivered a cute little boy through C section in this hospital and my experience was very good . Here doctors are so good, well experienced and they are very polite to me. Generally we have this opinion in our mind that govt hospital doesn`t give good service or they doesn`t care about the patients.  But in my opinion  this hospital is good. Doctors like priyanka yadav, neetu, rajesh nd there team is very good.😊😊"
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Hospital Vasant Kunj Delhi",
      "review": "Medicine is the science[1] and practice[2] of caring for a patient, managing the diagnosis, prognosis, prevention, treatment, palliation of their injury or disease, and promoting their health. Medicine encompasses a variety of health care practices evolved to maintain and restore health by the prevention and treatment of illness. Contemporary medicine applies biomedical sciences, biomedical research, genetics, and medical technology to diagnose, treat, and prevent injury and disease, typically through pha..."
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Hospital Vasant Kunj Delhi",
      "review": "We are fully satisfied with the services rendered to the patient. The hospital staff are very courteous and cooperative and helpful. The hospital is very neat and clean. The staff is very hard working and co-operative. the stay was excellent. Good Hospital. Good Staff and Nursing facilities. Good rooms and ICCU. will Recommended to all patients."
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Hospital Vasant Kunj Delhi",
      "review": "If you want proper treatment with good professional supervision, Fortis hospital is for you. Because they providing good facilities like, easy booking, attentive and supportive staff, organised system, well connected, decent coverage and well priced"
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Hospital Vasant Kunj Delhi",
      "review": "Worst emergency service, called for an emergency but person who received the call disconnected twice. I thought Fortis has good service but after this experience not anymore."
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Hospital Vasant Kunj Delhi",
      "review": "For isu attendants they blunly say they do not provide blanket pillow or bed sheet.to patents attendent They charge hefty amount foe ISU patents for  attendents their service is big 0  if possible i wlld like to give negative marking not even half star 100% times better is  max saket i am senior citizen but slept without these basic requirements"
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Hospital Vasant Kunj Delhi",
      "review": "We came here for two nights as my mother was admitted. The doctors and staff are excellent and my mother recovered after two days. I would like to make a special mention of Suman from Patient Relations who made the entire admission and discharge process seamless and took very special care of us."
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Hospital Vasant Kunj Delhi",
      "review": "I just visited your hospital and the service is excellent. One of your staffs, Mr. SHUBHAM BANERJEE of Patients Welfare Department is very much coordinating and helped me a lot. Thank you for your help and service at Fortis Vasantkunj and Shubham Banerjee."
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Hospital Vasant Kunj Delhi",
      "review": "Though their pathology department is good (of course) but the charges are astronomical. Moreover, the Doctors write all sorts of unnecessary tests and you are left with a feeling of being fleeced. It was good till last year but is becoming more and more commercial. Avoid Fortis for tests."
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Hospital Vasant Kunj Delhi",
      "review": "Cheaters is the right word for them."
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Hospital Vasant Kunj Delhi",
      "review": "Nobody is replying on emergency nos"
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Hospital Vasant Kunj Delhi",
      "review": "Excellent service, clean atmosphere"
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Hospital Vasant Kunj Delhi",
      "review": "A hospital with good and updated infrastructure"
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Hospital Vasant Kunj Delhi",
      "review": "I`m fully satisfied with your service."
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Hospital Vasant Kunj Delhi",
      "review": "Worst experience...."
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Hospital Vasant Kunj Delhi",
      "review": "Shashank tomar is fake person"
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Hospital Vasant Kunj Delhi",
      "review": "Really nice hospital."
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Hospital Vasant Kunj Delhi",
      "review": "Best qualities"
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Hospital Vasant Kunj Delhi",
      "review": "No body answer"
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Hospital Vasant Kunj Delhi",
      "review": "Need discount on medicines"
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Hospital Vasant Kunj Delhi",
      "review": "Good hospital."
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Hospital Vasant Kunj Delhi",
      "review": "Very good.."
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Hospital Vasant Kunj Delhi",
      "review": "Very Good services"
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis Hospital Vasant Kunj Delhi",
      "review": "Caring Hospital."
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis C Doc",
      "review": "My experience with Fortis C Doc was excellent. The hospital has a well-organized system, making it easy to get help. The staff is friendly and very connected, so they work well together. I felt comfortable and safe during my visit. The services are good and quick. Overall, Fortis C Doc is a great place for healthcare needs!"
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis C Doc",
      "review": "Koi bhi staff shi nhi h...or TPA ka paisa bhi refund nhi krte...koi na jaye yha"
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis C Doc",
      "review": "They don't take calls, they say they are busy, and always inattentive. So much for a specialized fortis brand. Its useless trying to reach them if the need arises."
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis C Doc",
      "review": "I had an appointment for my dad with Dr. Anoop Mishra at Fortis C doc. It was wonderful experience. He explained everything in details. I am very much satisfied.Also Ms Shagufta, staff at Fortis was very helpful and cooperative."
    },
    {
      "source": "JustDial",
      "hospital": "Fortis",
      "location": "Fortis C Doc",
      "review": "Not happy with the facilities provided by the staff of Fortis-C-Doc Chirag enclave"
    }
  ],
  "review_count": 114,
  "news": [
    {
      "source": "Brave News",
      "hospital": "Fortis",
      "headline": "About Fortis Healthcare Limited - Chitkara University"
    },
    {
      "source": "Brave News",
      "hospital": "Fortis",
      "headline": "Navi Mumbai News: Doctors Use V-V ECMO To Save Patient With Severe Lung Failure AT Fortis Hiranandani Hospital In Vashi"
    },
    {
      "source": "Brave News",
      "hospital": "Fortis",
      "headline": "Healthcare and Medical Training Programs | Fortis"
    },
    {
      "source": "Brave News",
      "hospital": "Fortis",
      "headline": "Fortis Hospitals Group India"
    },
    {
      "source": "Brave News",
      "hospital": "Fortis",
      "headline": "Fortis Hiranandani Hospital, Vashi Successfully Performs First ECMO-Supported Recovery in Patient with Severe Lung Failure and Kidney Disease - Authentic Press Network News | APN News"
    },
    {
      "source": "Brave News",
      "hospital": "Fortis",
      "headline": "Fortis Healthcare: Book Appointment online - HBG Medical Assistance"
    },
    {
      "source": "Brave News",
      "hospital": "Fortis",
      "headline": "Fortis rolls out e-consultations for remote patient care in 23 hospitals across India - Express Healthcare"
    },
    {
      "source": "Brave News",
      "hospital": "Fortis",
      "headline": "Fortis confident of maintaining high occupancy levels – Medical Buyer"
    },
    {
      "source": "Brave News",
      "hospital": "Fortis",
      "headline": "Fortis doctors achieve breakthrough in curing sickle cell disease through bone marrow transplants"
    },
    {
      "source": "Brave News",
      "hospital": "Fortis",
      "headline": "Fortis Hospital, Mulund Launches 'Ojasya'- A Holistic Wellness Initiative - The Tribune"
    },
    {
      "source": "Brave News",
      "hospital": "Fortis",
      "headline": "Fortis Hospital, Mulund Launches 'Ojasya'- A Holistic Wellness Initiative"
    },
    {
      "source": "Brave News",
      "hospital": "Fortis",
      "headline": "Clinicians At Fortis' S.L. Raheja Hospital Successfully Perform First Bone Marrow Transplant"
    },
    {
      "source": "Brave News",
      "hospital": "Fortis",
      "headline": "Fortis Healthcare: India’s 3rd Largest Healthcare Giant | History"
    },
    {
      "source": "Brave News",
      "hospital": "Fortis",
      "headline": "Fortis Healthcare PAT jumps 82.4%, revenue 17.3% in Q2FY26 – Medical Buyer"
    },
    {
      "source": "Brave News",
      "hospital": "Fortis",
      "headline": "Fortis Hospital in India: Prices for Diagnosis and Treatment, Reviews | MediGlobus"
    },
    {
      "source": "Brave News",
      "hospital": "Fortis",
      "headline": "Fortis Healthcare Q2 Results: Net Profit Surges 82.4%, Beats Estimates"
    },
    {
      "source": "Brave News",
      "hospital": "Fortis",
      "headline": "Fortis Healthcare Limited India ➤ treatment and examination ⚕️ prices for MedTour"
    },
    {
      "source": "Brave News",
      "hospital": "Fortis",
      "headline": "Behind Fortis Healthcare's ambitious new journey to solidify its position in India's healthcare industry - BusinessToday"
    },
    {
      "source": "Brave News",
      "hospital": "Fortis",
      "headline": "Fortis Gurgaon - World-Class Healthcare for Kenya, Maldives, Oman - Medical Tourism in India"
    },
    {
      "source": "Brave News",
      "hospital": "Fortis",
      "headline": "Fortis Healthcare Ltd (BOM:532843) Q2 2026 Earnings Call Highlights: Strong Revenue Growth Amid Operational Challenges"
    },
    {
      "source": "Brave News",
      "hospital": "Fortis",
      "headline": "After a spectacular rerating, what next for Fortis Healthcare?"
    },
    {
      "source": "Brave News",
      "hospital": "Fortis",
      "headline": "NCDRC Holds Fortis Hiranandani Hospital Liable For Deficiency In Service Over Failure To Investigate IV Fluid Reaction Leading To Patient's Death"
    },
    {
      "source": "Brave News",
      "hospital": "Fortis",
      "headline": "Supreme Court issues notice to Fortis Hospital in brain injury compensation case"
    },
    {
      "source": "Brave News",
      "hospital": "Fortis",
      "headline": "Fortis Hospital Bangalore - International Patient Services - Contact Directly here"
    },
    {
      "source": "Brave News",
      "hospital": "Fortis",
      "headline": "Fortis Hospital Kolkata - Best Doctor List 2025 - Best Doctor"
    },
    {
      "source": "Brave News",
      "hospital": "Fortis",
      "headline": "Fortis Hospitals in India: List of Top Fortis Healthcare Hospitals"
    },
    {
      "source": "Brave News",
      "hospital": "Fortis",
      "headline": "Fortis Hospital Bangalore - View Doctor List, Address - Medsurge India"
    }
  ],
  "news_count": 27,
  "collection_date": "2025-11-20T00:24:03.290826"
}