{
  "hospital_name": "Medanta",
  "reviews": [
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "Went to consult for ACL reconstruction surgery and had the worst ever experience with this person. Did not have enough time to even explain to us how much is wrong, and what is the process to fix it without surgery if any and recovery time and what are the implications. Did not even read the MRI report and asked us to get new MRI. Also, asked us to leave after just 5 mins saying he has more patients waiting."
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "Worst doctor marya. Consulted for knees replacement worst attitude hasty decision and no willingness to listen to the patient! Horrible!"
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "Aggressive, Forceful, Impatient, & Manipulative. Unwilling to listen. Mislead me about her timings & her schedule using her secretary.\n\nWas extremely manipulative and forceful towards Psychological Testing during the initial consultation without listening.\n\nUsed her secretary to bill me for Psychological tests in my first appointment with her before our session even started.\n\nSpent the whole session inquiring about my family's professional/economic & personal details(job, house cost, investments, etc). Left no time for me to explain my problem and my reason for consultation."
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "Dr Randhir Sud, just avoid going to this doctor, Arrogant, egoistic, and rude, we had visited him for second opinion for my mother surgery, as our treating doctor had advised to get surgery done as this can become cancerous in future, we visited\n\nhim and he said no need for surgery and got us convinced , here we are after 2 years cancer is detected. He is just a money minded doctor , who can even give a good opinion so a person can have a good life. He is a glorified crook. Being a doctor he dosent even know when a disease can turn in cancer in future. Just to overrule other doctor opinion he ruined my mother life.\n\nHe will pay for his karmas and world will see\n\nAnybody wants more information can contact me. 9779110066"
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "Unfrofessional rude doctor he dont even hear the patient properly. He dont listen you carefully just write the test and medicine and that is it."
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "Please find Details of the complaint and Not Responded even after 3 Months\n\nDear Sir/ Madam,\n\nGreetings Of the Day!!!\n\nSince 9 Months ENT Coordinator Ms Sarika Not Giving Date Of appointment Deliberately for Surgery As CGHS / ECHS Patients are not being treated well. The Coordinator has been contacted many times but confirms that People of CGHS and ECHS are waiting since 2017 onward. This can be understood that Deliberately ECHS/ CGHS patients not being treated well . The Appointment List Is also not updated . Even when she was communicated about the updating of the list as during this long time some of the patients might have got treated at other place and they may not have informed. She got angry and started misbehave . Even she was informed that A complainant may be lodged against her in Medanta To Superintendent or Dr Handa She confirm that She don't care and she don't afraid of any Complaint\n\nTelepathically I informed to Medanta but did not get any Response.\n\nRequest to look in to it\n\nThanks & Best Regards\n\nRajkumar- +91-9975160881"
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "My name is Sharjeel from Srinagar Kashmir\n\nMy father developed a complication in right limb and was diagnosed of arterial blockage . Dr Anil Bhan a kotex cardio came for a visit to srinagar and he advised an emergency surgery at Medanta and told that he would go for grafts and normalise blood flow . 14 November 2019 my father was admitted and Dr Anil Bhan changed his statement and advised for an open heart first . On completion of the surgery he again advised to be prepared for limb surgery that was already advised and performed limb surgery after 4 days without ascertaining the condition of patient . After limb surgery they told us the patient is fine but he developed swelling in the body that was termed as a normal post operative symptom that later worsened. Dr Firdous from Kulgam kashmir was addressing us and he continued with his inhuman procedures . Dr Firdous is the way to divert kashmiri patients . He was givin the duty to deal with us . When we complained about the condition of the patient they diagnosed him of acute pancriatites as they performed a CT that was never shared with us, after 5 painful days they changed the statement and diagnosed the patient of SEPSIS and put him on ventilator . When the condition of the patient worsened they accepted that they had ruptured a gut while performing surgery and within a week performed another surgery taking it to 3 surgeries instead of one. In these 38 days they killed us everyday moving the patient to ICU on ventilator and number of surgeries making a good amount of money from it. On the 38th day on Dec 21 my father expired just because MEDANTA had to make money, now i sometimes think that they might have taken out his organs also . Just because they had to make money they killed my father and it’s not only my father but many patients might have faced it or will face it . The killers of my father Dr Anil Bhan, Dr Firdous, Dr Ather\n\nI request to everyone please do not go to this hospital if u want to save a life\n\nIt happened with me and i don’t want this to happen with anyone else\n\nIf anyone has any question call 9682152554"
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "This Is The Bad Condition Of The Hospital.\n\nMy Friend Was Admitted About 1 Month Ago, In 5 Days, What Is The Problem.\n\n\"It Is A Not A Hospital It Is A Hotel\"\n\n'It Plays With Human Life Here'\n\nThere Is No Care For The Patient And Fee Is Absolutely Should Be Received In Time.\n\nDo Any Test It Takes More Than 2 Hours. \"THE HOSPITAL SERVICE IS VERY USELESS\""
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "I took my mother on 6th January for OPD visit under Dr. Randhir Sood. She had stomach pain and was in great discomfort. After seeing her, Dr. Sood recommended to admit her immediately to the ward and we did so. She was admitted at 10:56am and doctors team came for visiting around 4pm. Till then she was in great pain. After examining doctors suggested for the surgery and said we need the previous CT scan films by tomorrow and left. Whole night she was given just normal salines and DNS and metrogyl iv infusions.\n\n7th January around 4am, she was not feeling well at all. I told sisters to check her but they said they do regular checkup for all patients around 6-7am and i have to wait. I was not even allowed to check her blood tests reports. They were so rude. Her bp started to fall down and then they call doctor and took decision to shift her to ICU9.\n\nThe worst phase of my mothers life actually started from there. When they took her to ICU9, they asked me to sign consent form for centre line arterial line and ventilator. They were so prepared in advance for what to do with the patients. They tried there hands on and on and around 10am they told me that they examined her through XRay (which we never got) and found that her intestine got ruptured and immediately need to operate her. With no other option left, we allowed and operation on high risk was done for 3hours.\n\nThey told she is fine and maintaing her bp but still in danger. We saw her graph of improvement going for 5 days. On the 6th day of operation, they took her for CTScan on UG floor andshe was exposed to infections and on such an unstable condition they performed SLEDD dialysis. Her bp again fluctuated from this. From that only her health started to deteriorate. Again after 8hours of sledd session, just to make money, they told me to pay for CRRT dialysis. We agreed. But again her bp started to fluctuate and this time she couldnot fight back and she died.\n\nI cant explain how much in pain she was. They just treated her like an experimenting body. They inserted one catherer one one side other cattherer from the other side. Whole body was actually punched. She was a great fighter but couldnot fight the pain the medanta people gave. She was conscious and wanted to speak, she wanted them to open her she tried she expressed but these people were so so so sooooo heatless that they didnt even care. Unfortunately she left.\n\nAnd talking about the transparency, everything in this hospital is just soooo one sided. Being attendant you will not even get to know what are they giving to your patient. They have 1 counselling session in the morning for 5min and 2visinting hours for 15 each. Other than that whatever they are doing is just in their hands and is just so one sided. But during her last hours, they called me to show that they are trying to give her chest compressions. Just to be assure and show that they are trying.\n\nPlease Please Please do not go to this hospital ever ever in your life. Please save your patients life by not going there. They are just so rude mean and know how long they can stretch treatment to earn money. All medanta people whom I dealt with are just a ms. I could have saved my mothers life if i would not have been to medanta where they just did experiments on my mothers body.\n\nPlease do not ever go.... this is not just my story but is a case with every single person standing in front of ICU9. Doctors have told to almost every family that ur patient is suffering from serious infection and we couldnt find culture and antibiotics are not working. The same case with everybody. But do not go to this hospital ever. Use your money wisely and save a life."
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "They took 5 hours for full body checkup.\n\nThey said reports will be on website in evening same day.\n\nWhen ever I am trying to login it's showing errors.\n\nCalled their executive, she kept me on long hold and then simply told me to drop e-mail.\n\nI e-mailed them and have been waiting"
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "All Greedy people are working there only. No beds available for CGHS employees always but on cash payment there is entire hospital is available. Hospital authorities want to earned money through easy way (I mean to say cash) and don't want to carry out CGHS procedure. This all cash payment would become Black money and should be in high taxable."
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "Medanta Hospital is very good. My younger brother suffered with a brain tumor in 2014, all the doctors refused. Then his surgery in Medanta went successful, after that we come to know that he had cancer, we got cancer treatment. Now he is absolutely fine. Thanx God almighty & medanta"
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "My father was suffering from Gangrene andDr\n\nVirendre K sheroen, Dr. Krishna and Dr. Rajeev parekh was handling the case. They amputee my father's leg and after 4 -5 days they gave discharge. It was such a horrible hospital that I can't express. They don't care abt the patient that's the reason I lost my father 15 days of the amputation\n\nThey inhuman. I would strongly recommended not to visit medanta for gangrene. After spending money still I lost my father.They always handled every situation of my father when we used to tell his problem after discharged as if nothi"
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "Myself a pediatrician was diagnosed a kidney cyst on ultrasonograpy in my city agra. Although there are so many urologist in agra but I chose medanta thinking I will be given best care here.... I consulted a urologist here and he asked me to go for CECT scan... He advised me to get CT scan done in medanta as according to him medanta gives better n detailed report..... Money was not issue for me as I was seeking best in every aspect of treatment.... Cost of CT scan was Rs 10000 (almost double cost of normal diagnostic center) same day they provide me the report and as a doctor I can say that way of reporting was not up to the mark.... It was similar to what my most of known beginner radiology student friends make.......as a doctor I can point out mistakes\n\n1)Kidney cysts are classified on Bosniak grading but they didn't give grading of my cyst\n\n2)it was contrast enhanced CT scan.. And ironically they didn't comment on contrast enhancement in cyst...\n\nI tried to meet radiologist who reported my CT But supporting staff was always there to misled you... First they said you can meet radiologist.... Later they said radiologist don't meet anyone....\n\nFinally I consulted my treating physician there.. And he also seemed to be in hurry n no more interested in counseling...... As a doctor there were lots n lots of questions in mind but I wanted to discuss on 4 or 5 things... But he got irritated from starting so I didn't ask him anything...\n\nThis was the experience of a doctor in such big corporate hospital of big city.... God help those common man who don't have much knowledge in medical science..... I can say that I don't know about other people but in my case it was not good experience.. I could get better treatment and consultation in my city.... Good luck to all"
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "I would like to start by saying that this hospital is as beautiful as Tajmahal. Anyone would applaud when they will see the infrastructure. It’s a beautiful place where these Doctors conduct there business. If you are planning to go there for the treatment I would highly suggest otherwise as you might be bankrupt after the treatment. Doctors are extremely unprofessional with nurses, they talk to them like they are dogs, but well what else you can hope in India. It’s deeply rooted in there mental structure that nurses are not human beings and all they do is filthy jobs. But well neither do doctor respect nurses nor do nurses respect other nurses. They talk in a very disrespecting manner most of the time. Now let’s talk about the treatment they provide there. Doctors and nurses lie to there patients all the time. The treatment and care level is not even average. Like I said there are not doing humanitarian jobs it’s just money hoarding business. People I would ask all of you to think multiple times before you step in this hospital and then regret all your life. This hospital sucks big time."
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "Till today, I had avoided writing my negative feedback of Medanta, but today, once again its unforgettable experience came to haunt me, which has forced me to pen the pathetic services offered by this Hospital which is actually a Hotel, not Hospital.\n\nI had visited this Hospital on the recommendation of our known to Doctor for the treatment of my mother which turned out to be a nightmare for us. Sharing below my experience of this nasty Hospital so that people could get to know about the reality of it.\n\nDR. Praveen Chandra was recommended by our Doctor for the treatment. DR. Praveen Chandra suggested that EPS RFA must be performed. But he didn't perform it himself, it was done by a Junior Doctor.\n\nAt the time of discharge, neither DR. Chandra nor the Doctor who performed surgery, visited even once to check the condition of my mother.\n\nAssistant of Dr. Chandra had advised Nurses to prepare my mother for Surgery(Blood test, ECG) to be performed. I was busy in other formalities of Hospital and when returned after 2 hours I got to know from the assistant that Surgery can't be performed today as the nurses had not prepared my mother for the surgery.\n\nWhen asked nurses why this was not done, they replied that they were not instructed by the doctors as to what preparations were required. Doctors were busy in Gossiping with each other and Whatsup.\n\nDuring Surgery, my mother was kept awake as it was required. She got terrified when another colleague of doctors started coming inside, again and again, asking \"AREY ABHI TAK KHATM NAHI HUA\".\n\nThe doctor also said once during surgery \"ARREY WO COMPONENT NAHI MIL RAHA, USSEY DHUNDO\".\n\nSince I shared my negative feedback with their staff members, I was not even given a feedback form Staff who takes care of Refund is rude and doesn't know how to speak to the visitors\n\nI had given my Aadhar Card photocopy for a refund and also received a refund voucher in which my complete name Narender Singh Bisht was printed, still, I received a cheque in the name of Narender Singh which couldn't be cleared. Now Mr. Sunil Kumar who takes care of all these things says that policy has been changed and cheque can be released only in the name of the patient.\n\nThere is no place in the hospital where Poor and Middle-class family could eat inside. There are 2 cafeterias in the hospital which has famous food joint but nothing which could be served to the poor and middle-class family. A samosa with tea would cost you Rs.124\n\nTherefore, I request people to be cautious while visiting this hospital for treatment. They are more interested in giving treatment to offshore patient and money making. The hospital is already receiving much negative feedback which is indeed true.\n\nPatient ID - MM01276106"
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "It is very worst hospital there is no any value of human life it is only mony macking hospital. My cousin admit in medanta hospital last one and half year but still I am not confirm about disease. And if you want discharge then it is 5 hours process. And after treatment when u will come for routine checkup then doctor will force for admit and they tack minimum 50000rs in one day.\n\nNote- see image there is no any experience paramedics staff."
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "Hospital is ok, the doctors are good.\n\nMy father had a cardiac surgery there. Dr. Trehan and Nagendra Chauhan ae very good.\n\nBut I did not like the para medical staff. These people are extremely careless.\n\no The staff provided us incorrect patient reports.\n\no We had to pay extra money for the tests which were never done due to staff negligence.\n\no Paid huge amount in emergency ward People come here for their genuine problems, I would appreciate if the staff starting behaving more sensibly ."
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "Medanta nursing staff are not helpful and patient oriented. We expect humble, caring and dedicated nursing staff from such a Hospital. Most of the nursing staff behave carelessly and doesn't pay attention even after many reminders. I believe either hospital has shown carelessness in hiring the right people or Medanta has not inducted or trained them properly to work dedicatedly."
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "Medanta Medicity is a good hospital and has wold class infrastructure and technology no doubt but what blankets all these good things about hospital is the attitude of doctors towards patients, coordination among staffs and cooperation between departments which is at its worst. I think the name and fame of the hospital has gone high upto such an extent that nobody bothers about the way the hospital is working and its effects on the patients and family.\n\nI had recently been to Medanta Gurugram for my Mother's Total knee replacement surgry which was previously reviewed and scheduled for surgery by Dr SKS Marya a month before. But due to the negligence of surgeon and no cooperation and coordination among staffs and other departments we cancelled the surgery and discharged my mother because we were in no mood for taking chances or being an experimental animal. Pointers on what made us took this decision are mentioned below:\nDr SKS Marya never turned up to visit the patient even for 5 mins before the scheduled surgery.\nJuniors doctors took the matters in hand and kept us informing that Dr Marya will visit the patient on rounds but never happened.\nJunior doctors kept lying and finally when we confronted a day before the surgery one doctor accepted that Dr Marya wont be operating on my mother but some other doctor will.\nRadiologist during xray and cardiologist during the echo test questioned my mother that why are you getting TKR surgery done because you are fit and fine and its not indicative in you. But when my mother said that Dr SKS Marya has given a go for surgery they kept quiet and said please dont take our names in front of doctor. Patient lost will and trust for the surgery.\nWe wanted to talk to dr Marya on phone but was told that we can't and when we said we want a discharge then Dr Marya himself called on some junior doctor's phone and said he wanted to talk to us. Inspite of telling everything he never turned up and said if you dont want to get the surgery done you can go and come back when you wish to.\nMy question being a doctor is this the way how operating doctor behaves with the patient? Is he so confident about his skills that without visiting the patient and doing a clinical examination he will directly see the patient in OT? Patients comes from far off places just on name of Dr Marya and is it good to transfer cases to junior doctor without patient's knowledge and consent?\n\nMedanta Medicity hospital management, you may a 7 star hospital and you may have state of the art interiors and facilities with advanced medical equipments but its all of no use if your doctors and staffs are not upto the mark. Its same like if the cook is overconfident and negligent he will make worst food even if he is working in a start hotel with advanced equipments and techniques.\n\nFor me its a no no for Medanta Medicity hospital\n\n-Dr Rahul Kumar"
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "My father had heart attack some days back and now he is under control but I planning to take my father to Dr. Trehan for consultancy please suggest because after reading so many reviews about the medanta and their doctors I am bit scared.As we know Dr Trehan has good name in the field of heart care when I called to hospital for an appointment they said everyday he is available. I am afraid that when I will go they will ask me to visit some other junior doctors.\n\nPlease readers and reviewers your reviews and suggestions are very important for me to take a decision."
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "MEDANTA- No human life value - Please be-aware of this hospital. We have lost our mother due to their un professionalism and Dr Sxxx(Gastro) THE MURDER Dr. Rxxxxx Pxxx THE KASAI. My mother went to Medanta on her feet as she was having pain due to bowel moment in her stomach. We first met Dr.Rxxxxx Sxx(The murdered) with her reports the first thing he said was “she has to get the operation immediately and ask us to admit her at that time only.” And we on the concern about our mother could not understand that it was just a trap to get he admitted in the hospital. Then they did operation and put a colostomy bag on her stomach and ask us to come after three months for checkup so that they can remove the bag. After two months we took our mother again to the Medanta hospital(DAAKU) but at that time Dr. Rxxxxx Sxx was not there and we have to meet Dr. Rxxxxx Pxxx(THE KASAI) he also ask us to admit her in the hospital(DAAKU). After couple of days when Dr. Rxxxxx Pxxx(THE KASAI) came on the round in the evening he then said everything is fine and he told us that she is improving so fast and her BP, Sugar, Pulse ETC all are normal now and they ll do the ultrasound tomorrow and then they ll plan to remove that colostomy bag. We feel so relax that time. Next day they shifted our mother to scanning room and without our consent just in greed of money they started doing endoscopy test of our mother.(Later we consulted other doctors and they said they should not have done this endoscopy test as there is no need of it that time.) and during that endoscopy test their unskilled trainee doctor Dr. Vxxxxx(xxxxxx) puncture the intestine while doing the endoscopy test and they didn’t even tried tell us this thing and suddenly after the test our mother started to get dizzy her BP was abnormal suddenly and her pulse was so low that time. We asked them and they didn’t even inform us anything but they also tensed that time and we heard them talking with their team that patients intestine was burst due to endoscopy. A series of junior doctors tried their hands on her. They then came to us and told us that they have to immediately do the operation and And again just to be out of picture and to save themselves they shifted her to ICU. Then after 4\\5 hours they call us and ask us to come outside the operation theatre that surgon said tat operation was unsuccessful and they could not repair the burst intestine and she is on ventilator that time. When we ask them several questions like she was alright in the afteroon now suddenly this thing happen they told us that she ll heal automatically. We were not having any other option that time. When they let us go to see our mom what we saw is she was lot of pipes in her stomach and mouth also they had put centreline on her neck and she was still unconscious that time. In the next morning when she was still in the ICU on ventilator, our mom was not able to speak but she wrote everything on paper that she was well and she was not having any problem of Sugar, BP, Asthma etc and now suddenly she is on ventilator there is something wrong which doctors did. Our mother was then unnecessarily given sedatives in ICU for centre line and some other procedure was getting done on her which was not at all required. We were keep on asking Dr. Rxxxxx Pxxx(THE KASAI) again and again that has happened to her when she was the one, who go for the ultrasound test on her foot and now suddenly she is on ventilator. He just keep on manipulating us by saying fake things to hide their mistake and earn more money from us. Our daily bill was around 1 lakh those days. Then day by day her health was getting more worse and finally when we consulted other doctors about it and when they told us the whole back stage drama we were shocked and ask the doctors of Medanta and then they told us to to get her discharged and take her in an ambulanve to our city. On the bill matter we were told by Dr. Rxxxxx Pxxx(THE KASAI) to meet Axxxxxxx(xxxxxx) for discount as it was hospital staffs fault due to which our mom is in this position now. Then Axxxxxxx played a game with us by sending us to the 11 floor too meet her daughter Rohini for discount and she did the same by sending us to Axxxxxxx. These Mother daughter has played with us like a football for 3/4 days. and on the last from the bill of 18 lakhs they have given us the waiver of 10 k. We sentimentally splash the money on their face and took our patient to our city in ambulance in very poor condition and she was then again directly admitted to another small hospital in our city. She left us all after one week from then. At the last she was killed by Dr. Sxxx(a killer), Dr. Rxxxxx Pxxx(A KASAI), Dr Vxxxxx(xxxxxx)( junior doctors good for nothing- playing with human lives and learning medicine). She came to Medanta walking on her feet and although after paying them 25 lakh rupees she came out in an ambulance. This is all due to negligence/mishandling of the situation by the hospital. We took her for a treatment but they killed her. She went in conscious state since she never came out of sedation .heavy doses of antibiotics and sedation had caused on her brain. I hate the hospital the doctors whose negligence cost my mom her life. Its my request if the doctors are delaying the process, seek another hospital. The quality of the hospital isn't the same anymore. Better check for others opinions. The ICU was a grave where every single day a patient would die. My mom was one of them. I lost her for wrong treatment. We never thought she would never come back.I can’t explain the type of hell this Medanta is- full of infections.(Patients were coming there for some other treatment and were getting problems increased day by day, time by time, every patient is getting bedsol in their ICU. We have to punish them. We are finding ourselfs helpless. Many people are unnecessarily loosing their money because of them. They keep dead bodies of patients who came with hope to get well in intensive care(ICU) just to charge money an d remove evidences to find that the patient died due to errors by doctors, this is not a hospital but a house of criminals and murderers Please help us in punishing these peoples like Dr Sxxx, Dr Pxxx, Dr Vxxxxx Dr Sxxxxx etc. There are lot of people like us who are suffering .Please take some actions against these people. Is it right to play with some ones life for money? please do not do this. Doctor is a noble profession. how much money do you need for living? it will all be left here. Such a Shame. I hope a day will come when Medanta- The Medicity will no more stand up as a hospital. All I can say is that ILost my Mother and my loss was their gain. “Justice is to be prevailed”"
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "I really had an amazing experience while my visit to Medanta Hospital. It has a world class infrastructure, best in class medical care and the staff attitude is soo amazing, they treated me so well during my visit. Every procedure is well managed and got myself checked without wasting my time in queues."
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "I had my naniji Admitted in Medanta gurgaon for heart treatment& doctors told us to go for the bypass surgery. She had constant pain after the surgery and doctors kept on telling us thats its a normal pain after surgery. We brought her back to home and she constantly had the severe chest pain etc. Unfortunately she died within few days.\n\nWe tried our best to talk to doctors many times during surgery but it was very difficult to talk to the main doctor. Also they will never tell you the real name of the doctor who does the operation until you pressurize them alot. Dr. Trehan just sits there as a guidence teachers for his newly hired students surgeons who performs major surgeries without any clear knowledge. While we were talking to one of the heart surgeon(Dr Arvind) he infect said this line to us: “That he is very unfortunate to be a surgeon”. He never answered our queries properly before or after the surgery. Improper info can cause deaths and severe problems with the patient or a care taker.\n\nBeware of this money making hospital. They will ruin your body until for no reasons. They dont have expert doctors. Most of them are students testing on patients life."
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "I believe Medanta is fully capable of providing all latest medical treatments under one roof.Today my father had Angiography done by Dr Naresh Trehan and I am very thankful to you Sir.It all went well, reports are normal(no angioplasty required) and we are happy to find one of the best Cardiologist after so intense research. Everything from his admission to discharge went extremely well.\n\nI live in USA and My only query is if you are providing 256 Slice CT coronary angiography in your hospital then why did you use the traditional invasive method?And if it is recommended for patients aged 55 plus then still I am wondering if the patient have not right to take the call?What if the patient wants to go through non invasive process first i.e CT angiography and then be mentally prepared for Angioplasty if the report says so!\n\nOR if CT coronary angiography is only for young patients then shouldn't it be mentioned on your website?After so much of research we found that new facility available on your web and my parents visited you as it was not available anywhere in Bihar.\n\nMy parents did whatever was suggested by respected doctors.Although it was very well taken care off and everything was good but needless to tell this old method of angiography takes more recovery time than the advanced process.I am looking forward to get explanation .\n\nThanks"
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "Medanta - The Medicity\n\nVery bad experience, doctor was uncooperative, very bad behaviour, only money matters for them, my aunt was admitted twice there from 26 Oct 17 and she remained in pain till her last breath till 2 Dec 17. With poor decision making, no proper treatment was given. Faculty remained waiting for the doctors decision and made us to wait for whole night for it when patient was in critical situation and still they remained inactive. Even after the death Doctor assumed to made dialysis(fake operation) and again hope of fake recovery was given at 7 pm and at 9 he declared sudden death of the patient.\n\nAfter that they wrap up the body in bandage and discharge. Such cruelness was shown by them to a lady Patient."
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "Medanta is probably the best hospital for heart patients in north india. My father got admitted to medanta in 2013 for a bypass surgery which was very successful. The hospital has the best infrastructure and also the best facilities for the patients. Its is a very big hospital with highly qualified staff and doctors. Doctors are very friendly and cooperative with the patient and attendents. The cost is a little expensive but rest assured that you will get only the best facilities and care. So anybody looking for the best should go there."
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "Hello Friends!I would like to my personal experience in this hospital. I will go to guargaon my friend in the hospital his mother was admitted. I can see the infrastructure in this hospital. This is a digital clinic hospital. All staff are well dressed. Speak in good english. The is very big & consuming 2000 beds in the hospital. This is Five Star Hospital. The interior are very good like feels Five Star Hotels. The hospital is very beautiful & well maintained. In the hospital outside area are very clean beautiful garden . People can sit & relax inside or outside the building. In the hospital canteen workers are well maintained & food are pure hygienic. But the food are very costly. Overall this the best hospital in Delhi-NCR"
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "Dear Readers\n\nEmergency services at Medanta Hospital is very poor. They put trainee staff in emergency and that person doesn’t how to handle the situation. We consider doctors next to god on earth but here in Medanta Hospital doctor start arguments with attendent\n\nThey are least bothered about Service to patients they do focus how bill can be increased\n\nAt last either nursing staff or doctor don’t comunicate with each other at shift changing time. They forget to x ray done of my mother when she was addmit in hospital. I came to regarding when I saw the final bill. I not scaring you but try to tell you true story. This may be a life saving drug than amazine the situation\n\nPlease try to avoid this hospital"
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "My father had a heart problem and I consulted Dr. Pravin Chandra for the same. He did his angioplasty and now my father is healthy and absolutely fine. His staff was also very cooperative. Hospital is one of the biggest centre of north india capable of handling any medical emergency"
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "I never thought it was possible to use that term to describe a person until I met the doctor in question.\n\nMy father has just been diagnosed with small cell lung cancer.\n\nWe brought him to medanta last to last Thursday for consultation and diagnosis . The dr in question was gruff and extremely high handed with us and refused to even look us in the eye while speaking to us.\n\nShe prescribed a series of tests among which there were two biopsies, of which one proved to be unnecessary on seeking other opinions, which later she also admitted was not needed.\n\nAfter admitting my dad and waiting four days we finally managed to get a colonscopy. we had to keep following up to get an update on it. When we finally collected it we were informed it had been ready since days and it was pending clearance due to payment for additional tests that were done. This was shocking as we had been constantly following up and we had been told that we could pay when we came to collect the report. The report showed fast growing small cell lung cancer . We requested to be able to speak to the doctor since time was of importance. She flatly refused and asked that we should book for an opd appointment for Monday . We had to travel more than 40 km from our home in noida to get her views on the report. She told us only palliative chemo was possible. We told her we would prefer to get the treatment in a noida hospital based on her advice as travelling so much was not an option for my dad. She mentioned the chemo that was needed in this case and said we could collect the print out from outside her office.\n\nWe were shocked to see that the opd note had no mention of the chemotherapy she had talked about but only mentioned that we should get an MRI done and meet her again(this wasting several other days again). How long do we have to wait before we can start the chemo that is so obviously required.\n\nWhy would a human being waste time in a case where every day could mean falling immunity and manifestation of more and more symptoms for the patient like effect on bones that she herself highlighted. Only someone who is pure evil would take such sadistic pleasure in playing with emotions of those helpless in the grip of this vicious disease. She's lost the human touch and should be banned from a profession who's primary concern should be to save lives and alleviate pain where the former is not possible."
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "My cousin was admitted in this hospital .he was suffering from viral fever.there I found that its very unhygiene hospital.bad odour coming from the surroundings.many patients werd lying on the floor.rooms were unclean.nurses are very arrogant .they were behaving unprofessionally.we told them to give us clean room but they didn't listen us.doctors doesn't comes to visit the patients on time.the medicines prescribed by the doctors were very expensive. I don't recomment to anyone. This hospital service is worst."
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "My uncle admitted in medanta hospital 2014 heart bypass surgery success so I shere this subject my experience it's good company but have to work long time their maneger were also helpful the working environment very friendly our department very cooperative contain is very good and rates are very responsible medanta is huge hospital from a patients patients come from out of India people come from different different countries Afgnistan, naziria, etc.at doctors give a treatment all types of treatment liver, heart, lungs, brain etc. So I am experience is medanta Gurgaon is a good hospital.\n\nGood bye friends"
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "Hello friends! I wanna share my personal experience on this hospital. My uncle was admitted there that's by I was go in this hopital. When I was go in it I was noticed some thing like that its infrastructure, its infrastructure is very bad, lake of bads and many infrastructure is broked. Its staff behavior is not good all doctors& nurses behaves not good and never care for patients.\n\nIts fees so high and Its ambience is very bad. According to my overall experience its a very bad hospital because its take too much charges for medical care. Please don't go there I am not recommended it.\n\nThanks."
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "The chemist shop in Medanta was an awful experience for me. Whatever medicines the doctors prescribe, the chemist shop gives the opposite of whatever brand he has available with him. Inspite of the fact that salts in the medicine can be over or under dosed.The chemist didn't even informed me once that he doesn't have those medicines so can he give some other brand medicines.\n\nIt actually wasted my time and money buying my medicines from that chemist shop. MEDANTA should actually look into this matter and cancel the license of such money hoarders who think their sale is more important than the health of the customer."
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "Hello everyone My name is Yogesh Kumar Dhingra and I am from New Delhi, India.Today I will share my reviews on Medanta Mediclinic Cybercity.The hospital has less services available.Infrastructure is up to the mark.This hospital charge a lot for every service they product.Staff's attitude is not too good.Doctors are not always present.Less number of nurses.\n\nNot good medical care is provided.Emergency services like Ambulance are provided.Hence I will not recommend this hospital for you.Thankyou everyone."
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "I was admitted to medanta for my heart surgery back in 2014. It is not easy to get an appointment with Medanta doctors. But luckily I got mine with one of the renowned doctor of cardiology department, Dr Balbir singh.\n\nThe hospital is very well maintained . The outside area is beautifully maintained with flower and garden where people can sit and relax. Inside the building, it is beautiful. Doesn't feel like a hospital. There are eateries as well from KFC to Ccd and many more .\n\nComing to the wards and ICU they are good and also everyday cleaned . Dieticians come and ask you about your diet and give u a proper diet till the time you will be admitted .\n\nEvery three hours they will feed you with some meals . And food is hygienic. They take good care of you.\n\nIt is a bit expensive compared to other hospitals in Delhi and Gurgaon\n\nAs the saying goes everything has its own flaws, even medanta has.\n\nThe staff there are good and hard working but for me when I was admitted in ICU, the second day nurse, who was allotted to me was very rude and didn't even show up when required to do my daily necessities.\n\nBut overall a good hospitality served .ot"
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "I requested an appointment regarding my right knee meniscus tear on this portal of Medanta on 20 th June.It is 26 th June today and there is nil response from the operators of this facility.It appears as if the operators are more interested in sabotaging this unique concept of eOPD of Medanta and there is no one to care about.Probably other reviews about the Medanta staff are also true.Worst experience."
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "Every person has its own experience. In any profession there may be some errors or misunderstanding. My experience with Dr.sud is overwhelming and I feel he is one of the best doctors in India.I went to medanta for my sons gastro problem. I found dr sud to be very composed and experienced doctor. Just two days of medicine and my son responded positively . He is a happy man so all of us. We r proud to have dr. Radnhir sud in India.God bless the doctor"
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "We went to this hospital after my cousin brother was referred there. Infrastructure of the hospital is one of its kind. It has one of the best infrastructure and almost all the facilities are available there fr the patients as well their family members. Medical care is a pretty regular to what you get in every private hospitals nowadays. You get medical attention but you have to wait for it for too long. Even if you have an appointment you may have to wait for hours and people without any appointment may be attended before you if they know someone there. Medical care is of a descent level if you get it properly. Staff attitude is too ignorant. They kind of ignore your queries and after running behind them they still do not support you well. Staff in a hospital should be a little bit understanding and helpful which the are certainly not."
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "These big hospitals are not meant for normal middle class people I think but this should not be like this only.They have full infrastructure but with time they should cut down their fee or test charges so that every normal person can afford good treatment in a good hospital like medanta .Medanta will charge u one time fee of around 1500 excluding tests and if some tests are done then the wallet will get empty and no body will dare to go again to this hospital .Fee should be reasonable and affordable for a normal person also."
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "Medanta is a multi speciality hospital with high standard of medical care having qualified staff.medanta is good inall aspects\n\nMedanta is a cyber clinic hospital\n\nSupports digital india\n\nGood medicos and staff selection process\n\nGood beds system\n\nGood management system having well equiped instruments"
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "Medanta is by far best hospital in terms of facilities they provide and also the kind of infrastructure hospital has. The rooms are very spacious and clean, not only this the staff is also very helpful and have all the latest technology for any kind of treatment. I went medanta for my heart check up and I was glad to see the kind of experience doctors have. Medanta is surely a good hospital. Also my brother got injured in a car accident so he was taken immediately to medanta and his case was handled on priority basis by the doctors."
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "Hello friends I want to share my experience with medanta mediclinic cybercity hospital that is gurgaon. My uncle is suffering from throat cancer and has admitted in medanta hospital. His treatment is going on but I noticed that you are doing daily test and try to make huge amount of bill daily. They are not doing essential test but they also doing extra test on daily purpose. I don't know how they always make bill more than there estimations. No doubt they are providing good quality but they should think about others also.This hospital is very expensive."
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "Mr. Sultan Ali(MM00936549) underwent CT scan on 17/4/2017 at Medanta, reported by Dr Sonal Krishan. The report of the scan mentioned four residual tumors in liver. We went to Interventional Radiology Deptt in Medanta where the scan was reviewed and we were told that there are five tumors in liver and the missing fifth tumor was shown to us on CT images on the screen. The IR deptt went ahead and ablated all five lesions(Thank God the IR doctors evaluated the scan themselves and did not rely on Dr Sonal Krishan's report).\n\nThis is gross medical negligence to miss a tumor in a patient. We request the hospital to refund the money charged to us for the CT scan as it has been reported wrongly."
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "Dr. Nitin Sood is extremly bad. My cousin, aged 28, went for leukimea AML M5 treatment. Doctors, specially Sood could not identitfy that he got sepsis. No treatment for sepsis was started and he died in a couple of days. He had developed blisters on skins and was operated upon without giving any antibiotics for sepsis. He vomitted blood within hours of operation. Later in his death cause, they simply mentioned sepsis as the reason."
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "To elle_pisces\n\nI am sorry I do not agree with your opinion about Dr. Jyoti Wadhwa. My grandmother is diagnosed with breast and bone cancer at Medanta. She is going under the treatment& supervision of Dr. Jyoti Wadhwa. She is diligently doing her job and her behaviour is very soft while handling her patients. She answered each and every query made by me."
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "I am kidney transplantation patient suffering from ckd stage 4. Medanta did nothing except doing all kind of stupid tests not even required for a transplant just to earn money. Please go anywhere else but definitely NO MEDICITY.The doctors are not capable enough especially the nephrology department."
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "I had an appointment with doctor varun mittal in the urology department. but the behavior of this guy is very bad .This moron shout on me, disrespect me a lot. which is quite unexpected from a doctor of medanta. The doctor has some attitude problem, I personally suggest don't take the appointment from doctor varun mittal.i ahve never seen doctor like him. medanta hospital should have to review this kind of situation. Sometimes people learn a lot but still, they forget to learn how to respect other."
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "I want to tell u the medanta is most adavance hospital in healthcare industry.The hospital is 1600 beded & the building is very big.The lot of greenary in the hospital.Canteen, shops, bank, atm, park is also for visitors.The doctors is very experienced.Dr.Trehan is no.1 in cardiac surgery.The cancer treating team, ortho team is one of the best team in india having success rate of 80% .The staff is very polite & helping.For poor people there is rebate for treatment.Alover hospital is excellence in medical care & reason able pricewise."
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "Medanta is one of the finest and trusted hospital in India which provide world class treatment to their patients. Medanta provides the best doctors and dedicated sporting staff for their patients. They come with the new and advanced technology which makes Medanta the best place for treatment. When I visited medanta for the angiography and angioplasty of my father, doctors were very kind to answer my question related to the process and expenses, I remeber how Dr. Rajneesh Kapoor was trying to comfort us before the Operation"
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "Medanta is the most finest hospital I have come across. it has everything and apart from that best technology of the world. I would like to suggest this hospital to everyone as its the most amazing place to get urself treated for any kind of disease at they pay utmost care and attention towards the patients health.\n\nIt has infrastructure, all the technology, best doctors and the rooms are really big and spacious . they are hyginic too unlike other hospital, it has clean washrooms and everything.\n\nGreat going medanta, keep providing treatment like this only to your patients:)"
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "Addressed to: Mr. Anil Bhan, Mr. Praveen Chandra, Adminstrative Staff@ Medanta – YOU r ROCK\n\n@Medanta- as you say with pride on the moto being Dedicated to Life ”Yours & Your Loved One”, though as a most recent experience I had with Medanta team, I think that the institution should change there moto to “Medanta- “Dedicated Life of poor patients”\n\nPardon the choice of words but treat this as a feedback as the experience I had to “bear” was something I pray, people who believe in this institution of Health and renowned names of being certified as Dr. should never have. Let me brief the journey ……\n\nAs I used to hold a high of Medanta totally because of the strong panel of Dr. and super specialty services and that was the reason to opt for a medical check up for my mother. As an outcome, the one of the reports reflected that there possibly could be a cardiac problem as a symptom. And then started the journey, tried calling the Medanta hotline but the wire was always hot and I couldn’t really get a slot from the Dr.\n\nCardiac problem is not a usual discussion we have in our families, as a result I had to consult an alternate Cardio surgeon who recommended CT Angio for my mother. As I was Robotouchnded by the flashy building and the thanks to Technology on prompt SMS updates from Medanta, I again chose Medant for CT Angio. As an outcome my mother was recommended that we should go for a detailed angiography.\n\nI again tried reaching out via the hotwire of Medanta, but OPD’s are really difficult nut to crack when you as individual really need something in need. Consulted a friend who had a experience” good” @ medanta and I was introduced to the savior Dr. Anil Bhan via the only good soul I met @ Medanta Mr. Hotil Lal.\n\nI was wow’ed as I got an appointment the same day( March 21’2017) and here I am with my mother having an appointment with Dr. Anil Bhan. I was on time, but I was told that a critical surgery in place so I will have to wait though I could see the Dr. walking in and out and meeting patients scheduled. The wait was long one and my watch clocked exactly 1 hour though the Cred824ential of Dr. Bhan in his cabin with his photograph with visionary Late President Abdul Kalam was a good feedforward for me . As a diligent patient, my mother shared the case history to which Mr. Bhan recommended that CT Angio doesn’t make any sense without even looking at the CT Angio and we should go for a detailed angio… and that’s where as they say the making of the great salad started – I took an prior appointment for 9:30 AM from Hoti Lal ji to book a Cardio-\n\nMarch 22’2017 @ 10: 15 AM…\n\nI reached Medanta late by 20 minutes and Dr. Anil Bhan approved the admission and here we were up for a ride- We reached Admission Desk “2” after the TPA submission and I was told that there is a scarcity of the rooms and I will have to wait for 1 hour. For records, my watch said 11:45 AM at that point of time ….@ 2PM after 3rd reminder I was informed, that some clearance is happening why don’t we go and have some lunch. We had lunch and I had to ask the attendant with a modulated voice and the reply was same that he is trying…to which I reverted that we are done and we left .As a courtesy I informed Mr. Hoti Lal as well on same. As I reached the parking lot, I got a call from the attendant and Mr. Hoti Lal that the room is available now and please come back. I had a chat with my mother and decided that lets go as to a normal operating family a cardio is not like a weather fever you got. I thought its fine I am happy that atleast there is someone bothered as I got to know that the room got upgraded on Dr. request as the other room wasn’t available but finally we got the room @ 3:00PM. I felt …hmm…\n\nDear Sister walked in and took all necessary readings and I was told, we will go for Echo and Angio in sometime. After Echo session, my mother was take for Angio @ 4:30 PM and I accompanied. I was asked to wait outside the lab on Floor 3rd as attendants are not allowed in the lab. I was told its not a major procedure and it will take about 1 hour…. & Then waited.waited.waited…finally @8:00 PM my mother was sent to ICU and I was asked to come after 20 minutes. Neither the criticality or the outcome was shared with me as an attendant on outcome of the angio. I controlled and was able to make my way to ICU and to my surprise what I found was disgusting….my mother’s bed was aligned to a corner with no one to attend….remember “Dedicated to lives.bla bla bla” with sisters making fun of an international patient as he dint know Punjabi…. On me reminding them that why don’t you move my mother to her room, I was told that they would need a sign off.and that sign off took like over an hour with no dinner served to a diabetic patient. When my mother reached room, I asked her how was the treatment and now comes other bummer…… she was waiting outside the lab from 4:30 PM to 6:30PM on wheel chair. I was fumed but over neither I was not informed on what to expect whereas other customers who had a severity were recommended a stent at the same time and attendant were called inside.\n\nMarch 23’2017 @7:00 AM….\n\nThe sister came in and we were told that Dr. Bhan is waiting for us in the sisters waiting area. We went there and it was like a role play with Dr. watching a heart beating on monBrianbalakumaranr and we were directed to sit. Dr. Anil Bhan asked my mother on how she feels and she was recommended that we should go for stent as there is a blockage in RCA. I intervened and asked what’s the severity and if Dr. could help me understand how would he define the risk. Dr. shared that there are symptoms and he would recommend an angioplasty. He suggested that we should talk to Dr. Praveen Chandra as he would be conducting the angioplasty. I was never shared what’s the severity and what’s the blockage percentage etc. etc. etc.\n\nAs I wasn’t convinced I shared that we would need a discharge and would not want to go for angioplasty and the interaction changed all of a sudden. A fellow Dr. from Mr. Praveen Chandra’s team came and said in that case Mr. Bhan can only give you discharge and not Mr. Chandra. I again interjected and shared that If we don’t want to go for a procedure why should I seek a sign off from different Mr’s. or Dr. @ Medanta. Finally Mr. Chandra walked in with his team @ 10AM and recommended that they will be going for angioplasty, to which I declined. Mr. Chandra shared that its our choice though May would be late as I had shared, that if need be we will have it in May. My question was if May was late, why wasn’t the procedure done the previous evening when angiography was done to which I dint get a reply. I was told that direction was to just to Angio.\n\nWhen I said no, the Dr. started walking out though the fellow Dr. suggested that we should recommend medication to which Mr.Chandra said .yeah go ahead. Fellow Dr. prescribed some medicine but when I shared that few medicine are not allowed for my mother, he shared that these are standard advocation and its on our choice …I said.what the crap!\n\nFinally the discharge request was sent to the billing @ 12:30 and here we were for another chaos where the team had no clue on if the approval was there or where is it stuck but finally……. I mAnasultanged to get the aishwaryasingh23ment sorted by 3:40 PM and I am back on the floor where my mother was waiting in discharge lounge for clearance and reports.\n\nA gentlemen came where he intended to bring all the reports together with medicine but to my surprise, angiography reports was missing. When we asked that this was the only reason we had come here, we were told that probably its at the Dr. Desk. By that time we were frustrated but I thought to go down and settle the access card cash and guess what when my mother came back with the attendant with reports- it just had printed copy with no X-Ray and CD of the report.\n\nSo.To Medanta…This is what you did claiming. That you are Dedicated to Life…. I would say…. STOP PLAYING AROUND!"
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "Hey friends,  MEDANTA is one of the best hospitals of our country. having very neat and clean rooms, coredoors, gardens, bedrooms.  and having very well infrastructure.\n\nand the most important thing is the doctor's. yes, I can assure you about doctor's. medanta is having THE CREAM OF SPECIALIST. the best doctor's in india. better the aiims doctor's.\n\nn also they are providing good hygiene.\n\ntheir coredoors, bedrooms, cafeteria are very neat and clean.\n\nthe food they provide to the patients are of a proper diet plan prescribed by the doctor's.\n\nhaving different specialist for different disease or problems.\n\nmedanta is focusing on their quality of treatment and mostly hygienic environment and food. what the india wants.\n\nso people dont go abroad and spent too much money.\n\nbecause we are having one of finest world class hospitals in our country.\n\nthank you.!"
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "I have been visiting there, and this is the one of the top hospital overall Delhi ncr, the world class infrastructure provides by hospital administration, and the main things medical care are the world class superb doctor superb, nursing staff, administration staff all staff are cooperative and caring, Plastic surgery department is one of them where I gain much results and services and effective treatment given"
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "It has been 3 months now since my father left us.We are still not able to overcome the loss.Days in hospital still haunt us. We still remember how treatment was done in a reputed hospital.The hospital is completely commercial and patients are just minting machine for them. They have no humanity. Lack of communication is a big problem from nurses and doctors .No care and inefficient staff.\n\nPatient went to hospital for ICD/Pacemaker implant which is a simple   procedure.Due to doctors inefficiency and careless attitude I lost my father after staying in hospital  for 15 days  which costed me 16 Lakh rupees.(11 lakh for ICD which is of no use now)\n\nI had send them mail/talked to  their feedback cell but didn't got any answers for below queries.\n\nFollowing questions were asked:\n\nMy questions:\n\n1) There are discrepancies in death summary report. As per report'Patient was admitted in with severe chest paint' .This is not true, patient was not having any chest pain he was admitted in stable condition in a room. He was admitted to place ICD and we were told that he will be discharged after 3 days. Why wrong information has been written in summary report.\n\n2) Dr. X(Who implanted ICD) went on leave for a week after ICD implantation. We were told patient will be taken care by Dr. Y(Surgeon) and there was no backup for Dr. X .\n\n3) Third day after operation, due to medication, patient’s had lot of stomach ache and loose motion. This led to patient’s health deterioration . His other parameters also went down and he went into serious condition. We feel negligence in this situation further led to patient’s death.\n\n3) Patient was in HDU and had asked for water; he was given water after half an hour.\n\n4) Communication from Nurses, resident doctors was very weak. They hardly had any information and for every question they used to tell us to ask Dr.Y who was very difficult to reach.\n\n5) During whole process it looked that no doctor was in command, always got conflicting statements. It looked like they had made up their mind that patient is seriously ill and has to go and they had no answer .It seems trainee doctors have been put in ICU.\n\n6) It was told by doctor on 19/10/2016 that ICD will take 2-3 months to work. If that was the case then why was it not communicated to us initially? Why it didn't work?\n\n7) What was the reason that a critical patient was shifted from ICU 4 to ICU 5? We got conflicting statements for this question. Just because new patient had come he was shifted that time patient was on ventilator and balloon. We saw lot of carelessness in handling from staff at that time\n\n8) The day patient expired, why there was no incharge doctors(Cardiologist/Senior doctors) present at that time when patient was critically ill\n\n9) We were never counseled by doctor what was the cause of death? It was said due to low blood pressure. Won't  recommend this hospital."
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "Seems completely commercial and every actions seems for money. No care and responsibilities being shown after treatment date. Staff are not polite may be as they are facing issues through management.\n\nAs it located in the high posh sector in Gurgaon what they charge and what they treat are not justifiable. I will not recommend as the experice of 3 times very bad. As this medicity have many options nearby I recommed to try others."
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "I am penning down my 3 day experience at the so called India's one of the Leading Hospital Medanta. My mother had Arrhythmia Attack(Improper beating of the heart, whether irregular, too fast or too slow) she was immediately hospitalized at the local Hospital. However Our local Doctors recommended for atrial fibrillation is called \"maze\" surgery. In this operation, the surgeon makes small cuts or burns in the atria that prevent the spread of disorganized electrical signals. So here we were, From the start the Doctor who is supposed to be this disease Expert consultation did not guide and clarified and simply said tomorrow is your operation. With no clue and trust on the doctor we went ahead and prepaid and got the admission formalities done on the same day to be admitted the next day considering the queue and time consuming activities at Medanta. On getting admitted the other morning we were allotted single room The operation was scheduled at 4.30 pm My mother was taken near the OPD and she was waiting at the lounge for 3 hours finally the operation started around 8-8.15 pm. We were not given any clue or clarity or any kind of counselling how severe the operation would be wch my mother and Us were not mentally prepared. The operation was traumatic more coz of lack of proper counselling. Also, the attendant was asked to vacate the room and wait at some waiting lounge despite taking the room. From start to end no clarity n process were explained all the time we kept wondering what will be next. Also to get her discharged we waited for 7 hours as the doctor was not responsible enough to visit even once and discuss how is my mother feeling. It was such an unorganized and struggling experience while we were wandering from one counter to another(Considering How well spread Medanta is in 43 acres) to get the processing done.\n\nOverall we witnessed so much miscommunication and mismanagement and above all the kind of attention required from the doctor to patient was missing. Will never recommend this hospital to anyone"
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "Medanta is the best hospital in Ncr. doctor are very good and staff r very Experienced my personal experience in this hospital very good. Very neet and clean. doctors comes a time in a appointment and others facilty r very good etc taxi , canteen, hospital room, patient caer everything is perfect . Medanta hospital Lab so caer in patient and give a report for a three hour, same day u check a doctor your report and any problems u go the Medanta help desk and tell us problem they r very help us"
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "It is one of the biggest and one of the best multispeciality hospitals of India. It is open 24/7 hours a week and is the biggest hospital of Harayana state. I took my grandfather there being hit badly by a truck and he got recovered within one month only. The doctors of this hospital are very friendly and they treat the patients with great care. The nurses are really one of the best ones who takes great care each and every moment. I will always take my family there only whenever they are ill. It has so many rooms that it never gets full occupied with patients. It is one of the biggest building hospital of Asia too. And the great point here is that accident patients are directly treated firstly without taking any advance money or registering any police F.I.R report. I would strongly recommend you to visit this hospital whenever anyone from your family gets ill.\n\nIts address is:- CH Baktawar Singh Road, Sector 38, Gurugram, Haryana 122018\n\nIts phone number- 0124 414 1414"
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "This hospital is one of the expensive hospital in India. This hospital provides all the medical services. This is a very big hospital with many floors. Infrastructure of this hospital is nice. But considering the Medical care, this is the worst hospital. Yes, one cannot believe on me. But in reality as they show their standard, the medical care is very poor. I suggest personally to go to any other hospital than this. This is too expensive with poor medical care. Worst hospital in India."
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "I am sharing real experience with this hospital.\n\nOne of my friend's father went this hospital for heart checkup and later dialgnosed with 3 valves blocked and quoted about 3 lakhs cost for operation then we go to few more hospitals and found only 1 valve blockage.\n\nSo please dont trust them in one quick time.\n\nOtherwise hospital is well eqipped and docters are very good but top management is greedy for money."
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "This is the best hospital in india for heart surgery\n\nLiver trans plant & oher facility.\n\nGood staff services provides.\n\nGood health checkup facility\n\n& proper nurse care for patients.\n\nI have also donate in blood in medanta hospitals. The best hospital in delhi . But verry costly & not other patients are admitted."
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "Its excellent hospital in delhi, hving all medical facilities and a unit of highly experienced doctors.\n\nInfrastructure is also good\n\nStaff members are also co-operative. U hve to spend a bit more but get excellent medical care there\n\nBest doctors around the globe are serving there\n\nClean and sterlized infrastructure"
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "Medanta as we all know that is brain idea of very respected and talented Dr. Naresh Trehan. But I am sorry to say it only made for money making but not for helping others\n\nPros:-\n\n1) The hospital has well infrastructure and large campus\n\n2) The doctors are highly qualified and from abroad also\n\nCons:-\n\n1) Staff behavior towards patient are worst as they don't even have manners\n\n2) The hospital charges double amount of money for the same problem compared to other hospital.\n\n3) Some doctors are not even serious while treating the patient they even don't properly listen to them\n\n4) They don't have any proper support for poor patients, so only if you have lots of money then u can go to this hospital."
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "Its really best in india. Dr Trehan sir. I salute u .\n\nMy frnd's father has liver cancer . we travel everywhere but we could not satified by any one. and last someone suggest us to visit MEDANTA .\n\nWhen diagnosis strt the team of doctors ready for handle this situation was amazing . I really thanks to all doctor to save a life. and prey for you live long and serve for nation.\n\nActully we all get nervious but doctors always say us that he will good soon.\n\nAt last operation was sucessful and my frnd's dad is fine and workng well.\n\nBest doctors best treatment .\n\nThanks. MEDANTA."
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "Is this doctor's facility costly, as well as ensure they give you an additional serving of poor state of mind towards patients and guests. My experience is from being a Visitor at the healing facility, and subsequently from direct data from a patient too. Specialists give cosmic costs for operations that at other legitimate doctor's facilities cost significantly less. Moreover, on the off chance that you are as of now are conceded [ and in this manner vulnerable to move] then be prepared to give a lot of money to the healing facility. However, regardless of how much cash they make, they will guarantee that each time a patient's relatives or family come to visit, not just do they get unreasonably charged for stopping [ yes a healing center that charges for stopping - as though individuals go come here for a Picnic! ], and on top of it guests get pestered by rude'gate attendants'. In the event that you go to managers for any help, its like conversing with a divider - they gaze directly through you, including senior heads, some of whom are \"Specialists\" yet don't have any sympathy or sound judgment understanding in them. Best to Avoid - there are other much better doctor's facilities in Gurgaon and Delhi - if healing centers, for example, these succeed, then I think even nonnatives will one day quit coming to India for treatment."
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "Medanta The Medicity is located in the rajiv chowk sector 38 Gurgaon.This is thebest hospital that I ever seen in my life because you can feel the atmosphere like five star hotel.Infrastructure of the hospital is very well designed and very huge.Every department like cardiology, Hepatocare and many other division have their own buildings.\n\nHospital has best doctors and staff for care of patients who are admitted in the hospital.Hospital provide best medical care to the patients and staff provide their best to their clients.\n\nThere is large no of staff works in the hospital and they treat patients very well.They are familier to the patients and doctors give best suggestion to the patient which is right for them."
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "Hi companions These are the contemplations which ring a bell, in the event that somebody asks me… would it be advisable for me to go to Medanta? Are the specialists great there? Well the main answer is… you can put your trust in God, however not in Medanta. What's more, why do I suspect as much? I lost my mom because of the sheer carelessness and the easygoing methodology of the surgery group and the nursing staff of the healing center. Basically they attempt to panic the general population like you may have that and this, at long last they don't say anything is there, take some rest you will be okay. This is not in any way fair.bad encounter. Much obliged"
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "If you want your loved one to die from SEPSIS just admit them to MEDANTA's ICU. They killed my Father after keeping him admitted for 14 days in hospital and their inefficient doctors could not diagnose anything. When after days of frustration we asked them what is going on, they killed him and said he died of SEPSIS. Worthless killing factory it is not a hospital. I lost my father but request others to take your loved ones to doctor whom you know well, do not go on Hospital's name, it is doctor who matter not brand name of hospital."
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "My father, Mr. Abdul Muqtadir Choudhury had an incidental detection of left lower polar renal mass. Subsequent CT showed heterogenous enhancing solid globulated mass measuring 55x53mm arising exophytically from the lower pole of left kidney with involvement of lower polar cortex and medulla.\n\nWe met a lot of doctors in and around Guwahati, and considered a lot of treatment options in hospitals across the country. Finally we zeroed in on Medanta, keeping in mind the positive reviews that we'd heard about the hospital in the field of robotic surgery, especially robotic nephrectomy.\n\nDr. Rajiv Yadav explained to us the treatment option and told us that in view of clinically localised renal mass, partial nephrectomy was preferred. We were relieved after this consultation with Dr. Yadav because a majority of doctors in Guwahati had suggested radical nephrectomy.\n\nMy father was admitted under Dr. Rajiv Yadav on 5/10/16 at Medanta. We were given a comprehensive overview of the surgery, the possible benefits and complications of the process of admission, the duration of stay, the procedure itself and likely outcomes and complications.\n\nLeft Robotic Partial Nephrectomy was done on 6/10/16 under GA by Dr. Yadav. The post-operative period was uneventful and my father started recovering as expected. He was discharged on the morning of 10/10/16 and we stayed in Delhi for two more days before returning to Guwahati on the 14th of October, 2016.\n\nRobotic nephrectomy is something that we did not have much idea about, and we were almost ready for an open/laparoscopic surgery as advised by most doctors in our hometown. We're glad that we finally chose this option over all others. I would recommend partial/radical nephrectomy to anybody who has been suffering from similar health conditions.\n\nWe are grateful to Allah that my father is back home today after a successful surgery. We're extremely grateful and thankful to Dr. Rajiv Yadav and his team at Medanta - The Medicity for the exceptional treatment and care provided by them. I extend my heartfelt gratitude to them, and wish them greater success.\n\nMr. A. R. Choudhury, Guwahati."
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "My father went through a live saving treatment in Medanta a week back. He was diagnosed of Dieulafoy lesion, a rare illness of which there is no documented treatment but only immediate first aid. We are natives of the hills and it takes a person six hours to reach Delhi. The only person to be given credits of having my father all hail and hearty today is Dr. Rajesh Puri. Having been treated by him before as well, Dr. Puri left no stone unturned to have my dad being brought to Medanta as early as possible. The most relevant fact is that he did not wait for the patient to arrive to the hospital as he knew it would be too late by then, Dr. Puri made sure from miles away that the patient is been given the right amount of first aid during the journey by constantly directing the attendant, attending my dad. This as a matter of fact, became the most important factor of life saving treatment of my dad. My recommendation is, that one should always call the doctor/ hospital before hand(even if one’s place is half an hour away from the hospital) to start with the process of first aid as soon as possible, as in my dad’s case we realized that the telephonic vigilance by the doctor throughout the way saved his life. After the patient's arrival Dr. Rajesh Puri only focused on how he would start the treatment, his priority became the life of my father and not his position, as a doctor. We witnessed him rushing to the blood bank himself and bringing bottles of blood as he didn’t want to waste a single minute of the patient’s life. That was the dedication this doctor possessed. Whatever I am expressing is nothing compared to what Dr. Puri has done for my dad and our family. Not any amount of thank you would be enough to him and his service. Further I would not hesitate to thank deeply Dr. Naresh Trehan, Dr. Sunil Mishra, Dr. Sheilly Kapoor and Dr. Rajneesh Kapoor for their constant support and the manner they treated my father.\n\nI would like to thank the administration of the hospital. They were always prompt and vigilant in their approach. The nursing staff took immense care of my father. Even when he was being treated in the ICU for two days, the staff was always by his side as a family. That dedication and diligence helped my dad recover sooner and also helped us stay stress free during his recovery. The mess incharge Mr. Ravindra Chauhan and his team not only took proper care of the patient's meal but also catered nicely to the attendant’s diet.\n\nAll in all Medanta, Medicity gave us a homely environment and helped us take back healthy memories. Thank you Medanta for everything."
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "I jump at the chance to share my own experience, which happened in Medanta healing facility with my father as of late. I am not discussing specialist's or medicinal facilities, but rather here I am expounding on the reasonableness of normal men. Hospital is for just wealth not for poor, and it is only to mint cash. We went there as my father was experiencing Kidney issue, in any case they composed nine tests which incorporates x'ray of foot, for treatment of Kidney they alluded to oncologist and additionally phrenologist in spite of letting them know that my father was experiencing Kidney issue. They just felt free to took a few test, facilities were far to the point that me and my father experienced a considerable measure while moving one facililty to other. Toward the end we were so depleted. We spent more than forty thousand in these tests. Specialists are great, yet hospital is not for poor it is just for rich individuals."
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "Medanta hospital is the name of latest medical science . Dr trihaan is really Heart of this hospital. My a few relatives has gone to medanta for treatment. After treatment they were very satisfied because all were very impressed by their staff. This hospital is not cheap but as far as it is concerned medaanta respect imotions and fellings. In this hospital feelings does matter. All facilities and moderm eqipments are mere issue if feeling does not matter. Best of luck Madaanta."
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "My husband was admitted to Medanta Medicity in critical condition with an infection in brain.Dr Atma Ram Bansal and his team of doctors gave him a very good treatment and saved his life.Words are not enough to thank Dr Bansal.My husband is back home now and is on his way to recovery."
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "I took my wife to the hospital for some tests 5-6 times and still to go. I found it a well organised hospital. The Gynaecologist Dr Mrs Jain, s behave is so soft and healing. Overall atmosphere is looking good. Its off course costly but still the amenities are good so money kept at last.\n\nI took my wife to the hospital for some tests 5-6 times and still to go. I found it a well organised hospital. The Gynaecologist Dr Mrs Jain, s behave is so soft and healing. Overall atmosphere is looking good. Its off course costly but still the amenities are good so money kept at last."
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "I am an Emergency physician from a family of 21 doctors with our own hospital in kashmir. My father is admitted right now in room no:4832 at medicity.\n\nHe is a post complication of CABG which was discoverd two days back and now admitted for an urgent angiography. I am sorry to inform you that this has been a very painful and alarming experience for me. I am a specialist at a NABH and a JCI accredited hospital; which makes me well aware of the protocols and procedures.\n\nFor starters; the entire situation was very emotional for the patient and the family;  but being educated and in the medical field; we accepted it and went ahead with the angiography. We were promised the best cardiologist for the procedure which was very kind of our admitting ctvs consultant. As you know an angiography is an awake procedure; my father was alert and aware the entire time. I dont know why a femoral approach was done instead of a radial inspite of a big bounding pulse.\n\nA junior trainee was given the procedure unsupervised! It doesnt matter to me how many angios he has done in his life; but a complication post CABG should have been done by a senior consultant.How can you let a trainee do a procedure unsupervised? The trainee gave it multiple attempts, voicing his disgust and joking with the nurses; causing severe pain to my father. My father had soo much pain that he went into bradycardia(I will specifically mention the heart rate-32!). This was followed by a frantic call by the trainee to the senior consultant who came in and did the procedure. Also to add that trainee admitting out loudly that he hasn't studied the procedure; \"maine ye padha nahi\". I am flabbergasted and outraged! .This was the last thing I would have expected from a brand that'Medanta medicity' is. Right now my dad is having decreased vision in the right eye and there is no ophthalmologist to examine him. I wish I had a chance to treat them at my center and show them how things should be done. The nursing and transport team are very courteous. I am seriously considering legal options. This review coming from a doctor makes it more significant.Please do not send me an apology letter madicity(pun intended) . It has no significance now."
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "Diana Ssaxena. In the last week. I wish I could rate this hospital less than 1 star.\n\nBooked an appointment at 1 pm\n\nNo efficient administration or consideration for senior citizens 5 hours wait without food! No information regarding the wait time . Not recommended.\n\nThis is another money making hospital concerned with GOP.\n\nAll administration staff are inefficient . The receptionists kept lying that doctor will come shortly which took 5 hours!\n\nMy question is if someone is in dire need of medical help, is this the protocol?There is no element of care/ concern.\n\nMy father 70 years old who is just recovering from angioplasty was made to sit from 1 pm till 5 pm/ no basic test like BP/ECG/ oxygen etc was done . We were asked to wait in one area for 1 hour then moved to another room for another 1.5 hours and so it continued till 4:45-5pm.\n\nThere is no patient doctor confidentiality!\n\nIn Dr Trehan's room apart from us there were 5 more patients and doctor started showing the report(cd of angioplasty done in max hospital) In front of all other patients. This was highly unprofessional . He didn't even bother to say basic consoling words like don't worry we will take care of you.\n\nHe could not decide what needs to be done so he called another doctor who looked as lost as others. Finally they prescribed a test worth 16, 500!\n\nHe neither checked the history of my father's health that he is an ILD patient, I had to highlight this information\n\nNeither did he check the medication or as mentioned before did any preliminary test to asertain whether his ecg is normal or oxygen level is enough!\n\nThis hospital is a money making racket .\n\nThe hospital may look expensive and claims to be multi speciality but honestly they lack the basic human element!\n\nBig scam\n\nI advise you to refrain from coming to this hospital\n\nI was very disappointed"
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "I went to Medanta with a minor health problem for which I was taking medicine and improving. At Medanta the neurosurgeon asked me to meet 4 other specialists. Each of them asked me to carry out dozens of tests of the body part which was not at all diseased.\n\nToday when a normal patient can gather enough information on google, you can not use this village's quack technique to extract money out of patient's pocket. Soon, people will stop visiting Medanta."
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "Dear Dr. Trehan,\n\nI am your patient for the last18 yrs when you were in other hospitals and now in medanta.\n\nas advised I am undergoing EHC every year and show the result to your team Dr. alloted by you.(Dr S.Mittal).\n\nThis time, when I went for EHC on 21st  of May-16, I find there is lack of interest in handling the patient.They were not allowing time to put off the sleeper/shoes or put on the cloths properly after ECG or ultrasound. some of the places, they were insisting for another test ei-at Ultrasound they were insisting for CECT as because last time it was also held but this time it was not recommended.Similarly Mr. Fotedar was insisting for TMT only and not ready for strss ecco- the reason as I understand was to complete the patients  before lunch time.\n\nThe behaviour of some of the staff was also not co-operative.\n\nThe Dr allotted to me has also seen the reports very casually, first he did not saw the stress Eco report and prescribed continuance of medicine but on my insistence he saw the report and said ok.\n\nso I request you to kindly develop the behavioural attitude of staff and while taking test there should not be any thing such which create a feeling that staffs are interested only to complete their patient list without taking care the quality of test.\n\nlastly charges- In society a feeling is being develop that Medanta is charging too much and have develop a way for minting money by recommending the tests not required.\n\nRegards,\n\na.b.sinha"
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "These are the thoughts which come to my mind, if someone asks me…should I go to Medanta? Are the doctors good there? Well the only answer is… you can place your trust in God, but not in Medanta. And why do I think so? I lost my mother due to the sheer negligence and the casual approach of the surgery team and the nursing staff of the hospital.\n\nPlease don’t think in any way that I am posting this because of sheer frustration and anger. No! I am posting this, so that the loss and grief our family is going through, others don’t go through and be extremely cautious, if ever you plan to visit Medanta for any treatment.\n\nHere are the facts, which am sure will be enough to enlighten everyone and have a different perspective towards Medanta now~\n\n— My mother had to undergo a Mitral Valve Replacement Surgery at Medanta, post consultation with the Doctors there. Now valve replacement surgeries nowadays are as common as getting a surgery done for cataract. And this was not an unplanned surgery. We had planned, consulted for 6 months, before getting her operated.\n\nShocking fact number #1\n\nWe got her admitted on 6th Feb 2016 in the hospital. Admission process done, payments made. After two days, we receive a phone call from the finance team that we need to deposit another 4 lac immediately. They tried to create a situation of panic for us… Panicked, we scrambled to arrange for money. However, upon enquiring as to why the additional money is required, we were told that she needs to undergo CBAG process, which means, that not will she is to undergo an open heart surgery, but a ByPass as well. After much confrontation with the team of doctor’s from the Cardiology department and subsequent investigation it turns out that IT WAS A TYPO ERROR FROM THE NURSING STAFF! Because of a B the nursing staff added instead of writing CAG, a procedure for BYPASS was also added worth another 4 lac! To a layman, who wouldn’t understand, the person would have ended up getting a ByPass done too for no reason at all.\n\nShocking fact number #2\n\nMedanta is like a proper corporate set-up. The hospital manages to lure in patients from across India, basis of the brand image it carries. And why not, afterall, Dr.Naresh Trehan is considered one of the most renowned heart surgeons in India. Anyone usually going for a heart related operative procedure is admitted under the name of Dr. Chandra. Fact? We never ever saw or met Dr. Trehan. Whenever, we asked from floor doctors, if he will be there during surgery, if he would be overseeing the operation, we would get to hear a confident lie from the staff that of course he will be there. In fact, we didn’t even see his second-in-command team of surgeons. We always got to meet a different doctor and mostly a junior doctor. And it is usually these junior doctors who are performing the surgery. Bunch of amateurs have a free reign to practice their skills, clear their doubts and gain experience at the cost of life of a loved one. We never got to know, who performed the surgery on my mom.\n\nShocking fact number #3 and the most important one\n\nPost-surgery, the doctors perform a series of tests to ascertain that the valve and the heart is working properly and the patient can be discharged. After my mom came back home from the hospital after spending 2 weeks, she was recuperating well for 1 month~ of course the pain, the frustration is always there… you cant move much, you have to sleep straight for atleast 1.5 months. But my mom took all of these in her stride with the only motive of getting better soon.\n\nBut this was not to be. Just after a month, she started complaining of breathlessness and other symptoms, which she had before she was operated. We took her to the hospital, and after a thorough check-up it was revealed that the Mechanical valve which was fitted, was not working. A blood clot had formed, and can be possibly treated using a process known as Thrombolysis. We agreed to it, despite knowing the risks involved. My mom was immediately put on a ventilator and the process was started. The first day we saw some positive results and thought that this may work. However, by the second day her health started failing.\n\nThe doctors refused to take her in for surgery, saying that she is in no condition to be operated upon and it is all wait and watch.\n\nBy the third day, doctors told us that your patient is critically sick, so we can’t do anything. We will probably give it another shot and see if her condition improves. And this is what was shocking…\n\nWhen we had gone to see her around 2 pm, her hands and feet were cold and we told the doctors as well. but they dismissed this by saying that her pulse is dropping so we need to give another try. Later on my father, who is a Doctor himself, told us that her pupils were dilated already and it was just the ventilator which was providing the support.\n\nThis means… that the doctors at Medanta are so money crazed, that knowing that nothing can be done to save her, knowing that she is clinically dead, they still went ahead and administered the clot busting drug(Thrombolysis) worth 1LAC into her!\n\nThis is how low the doctors at Medanta can go to make money, to meet their targets.\n\nYes, you heard it correctly. For the uninitiated, doctors at Medanta are given targets that they have to convert 60% of their visiting patients into ‘in patients” Do whatever it takes, scare the people, who will get scared and do as the doctors at Medanta would say.\n\nI urge all my friends, family and colleagues to please spread this message and share with as many people as you can and I only hope that you don’t have to write something like this!?#?PleaseShareAndSaveLife? Medanta, The Medicity"
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "Medanta is one of the biggest hospitals of asia , yes you hear it right among all ober asia. It has top class faculties in every single department. The doctors are highly educated and sensible enough to suggest a patient good advice and thought process.\n\nThe hosital accomodation is also up to the mark and in cleaniness it also gets marks. The staff is very much cooperative and show their careing nature towards patients and their attendents. Many patients also come all across the globe for their treatment because they get satisfactory result here.So, you can check this out if you or anyone from your family is not well."
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "My friend is admitted there for last 16days. they have kept him in ICU. tests and treatment has already reached about 8.5lacks+yet nothing is diagnosed. they are suggesting one test then other. and yet not able to find the reason.\n\nhe had high fever with rashes on body when admitted. and he still have fever even though doctors could not found the cause.\n\nplease suggest what should we do?"
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "Worst experience with Dr.Arun Garg, Neurologist. He does not even listen to the patient. Does not even bother to hear about patients concern.\n\nThe word for him is WORST, WORST. I don't understand why they become doctors if they do no even bother to hear the patients. On the hospital side, money making hospital, totally dis-organised hospital. Will never refer anybody to Medanta Hospital or Dr. Arun Garg."
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "Poor Administration, make money only, No senior doctor or Dr. Naresh Tehran at surgery time\n\nMy father in low  got treated in this hospital for by pass and Valve repair  .However, despite that we were charged normal rates which are very high.Despite our many complaints we received no response.When surgery is done they told only Valve repair 3-4 times even they write on paper also before surgery we give all money 5.5 lac but when we fight for why they charge more if no By pass surgery  but after few min other doctor come and they told they did by pass surgery and same think write on paper .this is medanta .\n\nthey just want to make money from people.Most of Doctor  wants to make fool the innocent people. If they give advise for surgery to anybody then plz. don't follow their advise."
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "Well in 2015 my relative had a serious health issue.\n\nI don't want to mention the disease but it was a serious problem and all of our relatives were worried about him.\n\nThen our family doctor here in oashmir suggested us to go for medanta. I think it is one of the best hospital available in india right now they treatedy relative and he was back to feet with 4 months that was just incredible.\n\nDoctors are well and renouned one and the hospital staff is also great. The best thing about that hospital is ots cleaningness which is just amazing. Infrausture of the hospital is also very high. But only flaw is its lilitle expensive as compare other hospitals otherwise everything is perfect over their."
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "Medanta hospital environment was super cool, centralized air condition, facilities are like 5 star hotel. All these comes under the patient bills.\n\nNormal people who came here for treatment can't afford it. Treatment wise they use to write several tests, recently my uncle visited the hospital due to heavy pain in palms.\n\nImmediately they listed about 6 tests to be done immediately, even they didn't explain why they are asking that many tests. Simply they said, once reports came only we can speak anything.\n\nWhole day he spent on taking tests from the laboratory. After showing the reports to the doctor, he said due to heavy work did in last few days he got the pain and he suggested home remedy for killing pain and wrote pain killer tablets also.\n\nAll these words cost him around 8500/-, this is how they are cheating innocent patients. Simply they try to scare the people like you may have that and this, finally they say nothing is there, take some rest you will be alright.\n\nThis is not at all fair."
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "Poor Administration, No grevenices redressal Mechenism\n\nMy wife got treated in this hospital for Hysterectomy.We are CGHS benefiiciries .However, despite that we were charged normal rates which are high.Despite our many complaints we received no response.They have not returned to us the excess money charged. Sushma Goel oprated upon on 21thDec.2015 As for medical facalities are concerned The nurses are too young and too immature.Most of them are trainees only."
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "Medanta the medicity situated in gurgaon(Haryana) founded by DR, Naresh Trehan .\n\nit is onw of the multi specilaty hospital in delhi NCR.\n\nits like a five star hospital. all facility in under one roof .\n\nmy uncle god admitted there for heart surgery, when all doctors of meerut denied them to operate they suggest to go medanta hospital gurgaon.\n\nthe doctors did his operation well and now he is in very good condition\n\nthe atmosphere of hospital is very clean. all employees did there duty very well\n\nthe doctors is very specialist in their feild. many international patients came here for there treatment\n\nthe hospital is quity costly the operation charge is too high.\n\nbut the cost is not more then a life\n\na good hospital with all facility"
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "One of the most hilarious hospital . In my case, they can't even figure out whether I m sufering from appencitis or not in a long duraion of 6 months . Fake doctors with fake smile . I m so disturbed that I started fighting with my parents just because of these fake doctors . Seriously they are not even sure on what they are saying . Sometimes they say yes nd sometimes they are blank . It is same like the hospital in GAABAR IS BACK . I promise that if I would have some power this hospital would be my first target ."
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "From last 3 years I have visited medanta every time, each year for my yearly medical check up\n\nAccording to me medanta is a great organization for those who can pay their requirement.\n\nBut they gives you a better service as they take payment.\n\nThe staff of medanta is good and friendly.\n\nBest thing about medanta is they are taking your all record in very easy method.\n\nSo you can check your last year status and compare your currently status by last year.\n\nInfrastructure of medanta is great."
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "High handed attitude of the security guards at Medicity.\n\nPatients and their families are anyways stressed . Don't need poorly trained, rude security personnel adding to it.\n\nCustomer service . Medanta 2 thumbs down!"
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "*Medanta The hell city** and Mr. Trehan is the **champion of unnecessary bypass** surgeries.\"Mr Trehan\" I am not using doctor word(as he is no more a doctor now) is one of the biggest name of medical world is now a salesman/businessman who is misusing his fake fame(fame which he has earned using his PR skills and not because of his medical profession) to run a pathetic money oriented hospital named \"Medanta The Hell City\" and slurping money from patients pockets by giving them panic and false advises of unnecessary surgeries. All his life he has done unnecessary surgeries of patients.Especially for heart he has done numbers of unnecessary by-pass surgeries to make money. He has done surgeries even on completely normal arteries by giving wrong medical advices to patients for his own good. And Poor patients and there families think he is a god and get ready for treatment suggested by this A$h**e.\n\nThe lines written above are not my instant reaction or frustration but an outcome of my research and views after visiting number of other Doctors(whom I visited for 2nd opinion in my case), friends, office college and relatives(other victims of Medanata hospital) and few other people who I met in the hospital only(victims like me) during my stressful stay of 15 days post-surgery of my loved one.During my visit to one of a very senior cardiologist of a very famous hospital of NCR, I came to know that he had collected CDs of patients who have been unnecessarily operated(open heart bypass surgeries) by Mr Trehan and there is a huge list of such patients.Majority of these patients would have recovered with just medications only, if they have consulted another cardiologist.\n\nAnother partner in crime and a Super Duper Intelligent person is MR R.R Kasliwal, who act, think and talk like a cardiologist but in actual he is no more than a technician. If you don’t believe me then go to him and try to ask few genuine questions and look his reactions/answers and you will know by yourself.Kasliwall is famous in medanta for Angiography but I hardly believe he knows how to do Angiography because the reports he share with me was incomplete(may be it was intentionally) which I got to know after showing it to another doctors.\n\nAlso the figures mentioned in the reports were inflated to scare the patient, he hide lot of good details who could have given me a hint to avoid the unnecessary operation of my loved one. they make some changes in report and inflated the details so that if you have gone to another hospital for 2nd opinion, the doctor will say the say by looking at the reports.These kind of doctors act like pimp to hospitals and can fell down to lowest possible level of humanity just to achieve their monthly business targets by playing with the lives of your loved ones.Not sure why Goverment is keeping a blind eye towards such scandanls else the **person like Trehan and Kasliwal should be in Jail**. These so called \" doctors\" are more dangerous than a terrorist to our society."
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "My mother was suggested open heart arotic valve replacement surgery.our bad luck we took her to medanta . During consultation we were made so scared that we agreed for immediate surgery . When we got her admitted the package was told 4.26 lak and we were asked to clear full bill before surgery as soon we cleared the package amount they operated my mother.\n\nThe surgery was done by the so called king surgeon N.Trehan . He claimed the surgeory was a success but till 3 days she was not shifted from icu 2 and an artificial pace maker was attached to her . When we enquired that if everything is ok why are they not shifting her to icu1 they got scared by our questions and shifted her to icu1 on the 4th day  after surgery . The scene in icu1 was pathetic there was only 1 nurse for so many patients . The doctors claimed they will shift her to room the next day but to our 5th day after surgery they called us and told that she had a cardiac arrest and we should inform our relatives. They also claimed that due to cardiac arrest there is a clot in her brain and 50% of the brain is dead and was put on ventellator, pace maker and balloon support. She struggled for her life and 11th day she had 2 more strokes and early morning before opd starts they declared her dead.\n\nMy only question to this butcher shop is my mom was only 59 with no chalestrol problem no diabeties no bp problem no blockage then how come she had heart attack after successful surgery . And if her heart was that weak then why the hell did you operate.\n\nMr Trehan pls b true to your profession we know you have started up a business and need payback but not on cost of someones life SHAME on you and Your family who supports you in this.\n\nI m posting this because what we lost will never come back to us but others please save your loved ones\n\nMedanta is not a hospital but it is a business house . They have contacts with dr's in other cities who refer patients to medanta and get a handsome commission of the total bill. And the management here will call u now and then to clear the bills on daily basis\n\nThese people changed all her reports at the time of disharging the body . My mom passed away in icu2 and we immediately took her body home and they claim that my mom was in morchary\n\nShameless people"
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "I d an appointment with dr neelam mohan for my 7 month old baby, she arrived late, hardly spent any time in taking history and physical exam before jumping to complicated investigations, was busy on phone most of the time, was  losing temper and using slangs, asked us to strip our baby completely that too on a winter morning just to check his weight.I happen to be a doctor myself, so I cud immediately sense that smthin  is nt right.\n\nI called a couple of my pediatric colleagues and took a second opinion, they all said that the tests which she advised were not only useless and expensive but harmful as well for the baby, I was very disappointed with Medanta and I would suggest that people shudnt blindly run after big market names and if u sense some foulplay or if ur doctor is rude or reckless, just change ur doctor"
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "Today I went to Mendanta Gurgaon to meet Dr Vijay Kher, but before him I have been advised to meet Dr. Ashish Nandwani a naphorologist. I went with latest test reports of blood and kidney which includes DTCA also but instead of giving me any advise he has written irrelevant tests which includes Eye test, HIV, viral infection which have nothing to do  woth kidney desease. I had already done HIV test just 6 months back but it seems doctors have instructions to loot patients atleast by 5000 Rs. whosoever comes before treating him.\n\nI am really very upset. The height is that when I met Dr. Vijay Kher also, he has also asked me to get these test done and not advised any medicine. The entire day is wasted and after coming back and wasting 8000 Rs. I am at the same place where I was. My kidneys are damaged by 50% but the doctors are not able to advise any medicine and not able to tell as to why this has happened?\n\nWe should really think before going to medanta hospital.\n\nSandeep Saxena"
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "Dr Naresh Trehan with super special abilities and international fame does not have any sympathy for Indian Patients.\n\nMy father in law, who is no more with us because of these cruel doctors, Dr Naresh Trehan, Dr Rajneesh Kapoor, Dr Tusshar and Dr Yatin.\n\nMy father in law had a heart attack on 13th nov 2015. He was further recommended for Angiography in which two arteries were found to be blocked by 100% and one by 90%. A bypass surgery was to be done.\n\nWe took him to Medanta Hospital Gurgaon, thinking that it was the best in the country. Doctor performed PET scan after 2 days of admission and concluded that only 15% muscles were dead and rest could be regenerated post the bypass.\n\nOn 24th Nov 2015 they took my father in law for bypass in the morning at 8am. The operation as told was supposed to take max 6hours. It was Dr Trehan who was supervising his team of doctors in the operation theater. After an hour, they called me and said that my father in law's heart valve also needs to be repaired which was a dynamic decision and we were asked to deposit value surgery charges and ring charges. Previously we were told that valve leakage was not major and could be cured by medicines. They continued the surgery till 4:00 pm and we were not given any status even post 6 hours'max' window. Our nervousness was increasing with every minute and we tried contacting many other doctors including Dr Rajneesh to know the status.\n\nFinally, at 4:00pm Dr. said that the operation was done but the heart was not reviving and the patient was critical. They shifted my father in law to an ICU on ventilator support.\n\nNext day, in the morning they told us another operation needs to be performed since there was bleeding and blockage. They operated for 2-3 hours and told that my father in law was still critical. This operation as was told to us was performed under Dr Trehan.\n\nOn the same day, 25th we stood for 3 hours outside Trehan's cabin to meet him. Finally he met and told that the heart was found to be weak when it was opened and the patient was critical. We were surprised to hear as PET scan report said differently.\n\nMy father in law was only 57, non diabetic, non smoker, non alcoholic. They put him on dialysis on 25th evening.\n\nNext day there was no sign of improvement when we went to meet him. He was on ventilator and pace maker. Hard to say whether he was alive but his body started turning blue. When hospital was closed for OPD and there was less crowd they called us as 9.30 pm and said that my father in law's heart collapsed and declared him dead after an hour.\n\nSome open questions, was bleeding occurred due to doctors' mistake during the first operation? Why we were not told about the risk? Was value repair a strategy to get some more money? When you do not have time to visit patient's relatives outside your cabin, were you serious enough while operating? Is it only the name and fame that has created trust in Medanta, the Medicity and Dr. Trehan?\n\nLife could be a play for you but ask someone who has lost everything!"
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "I like to share my personal experience, which happened in Medanta hospital with my uncle very recently.\n\nI am not talking about doctor's or medical facilities, these are beyond expectation and supper, but here I am writing about the affordability of common men.\n\nhospital is for only riches not for poor, and it is just for minting money.we went their as my uncle was suffering from Kidney problem, however they wrote nine test which includes x'ray of foot, for treatment of Kidney they referred to oncologist as well as phrenologist despite of telling them that uncle is suffering from single Kidney problem they just went ahead and took several test, facilities were so far that me and my uncle suffered a lot while moving from one facilities to other. at the end we were so exhausted. at the end when we left the hospital their was a big hole in the pocket. we spended fifty thousand in these test. doctors are good, but hospital is not for poor it is only for rich person."
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "I had gone to visit the health and wellness department(dental) yesterday with a prior appointment with Dr. Vandana. Once I reached I came to know that she was gone for her lunch break at 3:30 pm and I will have to wait. Why are appointments given if the doctor is not available to see patients at that time? My back right teeth were hurting and some skin is coming in between the teeth which bleeds while brushing and is otherwise painful to chew.\n\nAfter specifically telling her about my medical history and how my wisdom tooth has not been extracted I was told to get an x-ray done before further recomendation. The x-ray was from the front and does not show my right side of the teeth and if there is any tooth which has not emerged. She recommended I eat augmentin(which is a antibiotic) and somer medicine for the pain and if that does not help she will remove the last tooth. How does removing a healthy tooth solve the problem of some skin coming between my back teeth? And how will that solve my wisdom tooth from coming out right? She has not even seen an x-ray from the side to check if the problem can be resolved without removing someone healthy tooth.\n\nAn ENT doctor had recommended I visit a dentist and they can remove the skin coming from the back teeth but she had no time to listen or even explain what she prescribed to me.\n\nWhen I asked what if the medicine doesnt help she told me she will remove the teeth!\n\nI forgot to mention that she had changed her room in between telling me to get my xray done  while in room 31 to room 19 and was having tea with a colleague while I stood there the whole time and left with a prescription! Can anyone imagine going to a doctor with your xray and standing while she is chatting and writing a prescription and gives it to you with a dismissal to leave."
    },
    {
      "source": "MouthShut",
      "hospital": "Medanta",
      "review": "I visited Medanta hospital for my self.the doctor asked me to come again after 6 days .WHEN  after6 DAYS I went to the reception to pay fees the receptionis tsaid, \" today your first review is free of cost.\n\nAs per MEDANTA POLICY\".I was happy.so after waiting for hour my turn came.i gave my feedback and doctor started discussing the case  but suddenly in middle of discussion she asks\"wheres your registration form?\".I told that as per receptionist I dont need to pay.doctor\"WHAT?YOU HAVE TAKEN SO MUCH TIME."
    },
    {
      "source": "JustDial",
      "hospital": "Medanta",
      "location": "Medanta Mediclinic Defence Colony",
      "review": "Worst in all respects. They will keep you waiting for 4 to 5 hrs more after appointment time. Dr Rajiv Parikh think himself beyond god. Avoid medanta chain and find other options."
    },
    {
      "source": "JustDial",
      "hospital": "Medanta",
      "location": "Medanta Mediclinic Defence Colony",
      "review": "HI , I am Priyanka , i really need to connect you guys but no one was responding , i tried many times on customer care and hold the line atleast 20mints but no one responding so its my humble request with you kindly contact me on this ...8527899211. Its urgent please."
    }
  ],
  "review_count": 102,
  "news": [
    {
      "source": "Brave News",
      "hospital": "Medanta",
      "headline": "Medanta launches Advanced Surgical Heart Failure Clinic to support complex and end-stage cardiac patients - Express Healthcare"
    },
    {
      "source": "Brave News",
      "hospital": "Medanta",
      "headline": "Medanta Hospital Delhi | Best International Patient Guide & Care | Shifam Health"
    },
    {
      "source": "Brave News",
      "hospital": "Medanta",
      "headline": "Patient Attendant Services at Home - Professional Care by Medanta"
    },
    {
      "source": "Brave News",
      "hospital": "Medanta",
      "headline": "Book Appointment with Medanta - The Medicity, Gurgaon for ENT, Transplant, Orthopedics, General & Laparoscopic Surgery, Oncology"
    },
    {
      "source": "Brave News",
      "hospital": "Medanta",
      "headline": "Medanta Hospital: A Symbol of Medical Brilliance"
    },
    {
      "source": "Brave News",
      "hospital": "Medanta",
      "headline": "Treatment in Medanta Hospital | MEDAVIATE"
    },
    {
      "source": "Brave News",
      "hospital": "Medanta",
      "headline": "Global Health Ltd (Medanta): Pioneering Healthcare Since 2009"
    },
    {
      "source": "Brave News",
      "hospital": "Medanta",
      "headline": "Medanta-The Medicity, Gurgaon | Top Super Specialty Hospital in India| Top Doctors| Specialities"
    },
    {
      "source": "Brave News",
      "hospital": "Medanta",
      "headline": "Medanta Hospital Gurgaon – Best Multi-Specialty Hospital in India"
    },
    {
      "source": "Brave News",
      "hospital": "Medanta",
      "headline": "Medanta to set up hospitals in Gorakhpur, Varanasi and Allahabad | eHealth Magazine"
    },
    {
      "source": "Brave News",
      "hospital": "Medanta",
      "headline": "Medanta Hospital Gurugram: Exceptional Care & Expertise"
    },
    {
      "source": "Brave News",
      "hospital": "Medanta",
      "headline": "Medanta Noida Hospital Opens: Advanced Care in Delhi-NCR"
    },
    {
      "source": "Brave News",
      "hospital": "Medanta",
      "headline": "Medanta Hospitals Q3 results: PAT rises 15.6% on higher patient volumes | Company Results - Business Standard"
    },
    {
      "source": "Brave News",
      "hospital": "Medanta",
      "headline": "Medanta Hospitals’ revenue up 14.9%, PAT 21.1% in Q2FY26"
    },
    {
      "source": "Brave News",
      "hospital": "Medanta",
      "headline": "Medanta - The Medicity - Leading Healthcare Institution | Health Voyage Global"
    },
    {
      "source": "Brave News",
      "hospital": "Medanta",
      "headline": "Medanta Hospital in India: Prices for Diagnosis and Treatment, Reviews | MediGlobus"
    },
    {
      "source": "Brave News",
      "hospital": "Medanta",
      "headline": "Medanta The Medicity Gurugram India"
    },
    {
      "source": "Brave News",
      "hospital": "Medanta",
      "headline": "Medanta reports 15% revenue growth in Q2 FY2026; Expands network with launch of Noida hospital - BioVoiceNews"
    },
    {
      "source": "Brave News",
      "hospital": "Medanta",
      "headline": "How Many Total Branches of Medanta Hospital in India"
    },
    {
      "source": "Brave News",
      "hospital": "Medanta",
      "headline": "Medanta Hospital Online OPD Appointment 2025: Doctor List & OPD Timings - AIIMS Registration"
    },
    {
      "source": "Brave News",
      "hospital": "Medanta",
      "headline": "Medanta Hospital Patna: A Beacon of Healthcare Excellence - Netram"
    },
    {
      "source": "Brave News",
      "hospital": "Medanta",
      "headline": "AIIMS New Delhi, Medanta, PGI Chandigarh feature among world's best hospitals 2025"
    },
    {
      "source": "Brave News",
      "hospital": "Medanta",
      "headline": "Medanta The Medicity - Hospital in Sec 38 Gurgaon, Haryana - Check Address, Images, Number, Appointment"
    },
    {
      "source": "Brave News",
      "hospital": "Medanta",
      "headline": "Step-by-Step Guide - How to Download Your Medanta Health Reports"
    },
    {
      "source": "Brave News",
      "hospital": "Medanta",
      "headline": "Medical Care - Metta Welfare Association"
    },
    {
      "source": "Brave News",
      "hospital": "Medanta",
      "headline": "DLF, Medanta to develop 400-bed multi-specialty hospital in Delhi | Health News - Business Standard"
    },
    {
      "source": "Brave News",
      "hospital": "Medanta",
      "headline": "Medanta – The medicity, Gurgaon | Medserg"
    }
  ],
  "news_count": 27,
  "collection_date": "2025-11-20T00:24:03.288599"
}