{
  "hospital_name": "BLK",
  "reviews": [
    {
      "source": "MouthShut",
      "hospital": "BLK",
      "review": "Consulted with Dr. Poonam Khera who was pushing for biopsy ASAP on a Friday. Scheduled for Monday. Sunday evening got a call that since insurance approval is pending to reschedule for Tuesday. I have no information as of Monday evening. Also, after first visit, got SMS with link for feedback. The assistant asked to copy the message. When I later clicked the link to express my disappointment, I see that feedback had already been submitted on my behalf."
    },
    {
      "source": "MouthShut",
      "hospital": "BLK",
      "review": "Date 31 Oct. 2025\n\nAdmission time as per hospital record- 8.30 am.\n\nEven after procedure being done in the morning in Cath lab. Problems being faced by patient(me) since then).\nNo single room allotted even after waiting since hospital reporting time even after confirming till 4.45 pm.\nWithout disclosing me they shifted in Double & unhygienic room which have least amenities & hygiene.\nDirty Bed sheet, blanket etc is still on bed of previous patient, not changed even after asking.\nroom intercom is not working. Complained about this at nursing station atleast 8 times.\nwashroom is dirty.\nevening tea/coffee is not served.\n7 Attendant’s bed sheet/ blanket also not served.\n\n8 No routine medicine is given at 7 PM.\n\n9 No dinner is even served in temporary room.\nafter checked again & again by me at Admission desk, no one is helping. Talked at reception-. They advised me to meet MOD Mr. Kshitij, he is not on duty yet. No serious or senior person is available.\nRoom allotted to me at 9 pm sharp.\nHospital harassed me as a patient after doing procedure in the morning by making me run for the room which was committed to me before procedure. Admission desk at A1 on ground floor & Bed manager is the main responsible who harassed me most.\n\nRegards\n\nSandeep Gulati\n\nMax ID- BLKH.594745"
    },
    {
      "source": "MouthShut",
      "hospital": "BLK",
      "review": "My daughter had pain in her stomach so she went in emergency. There they did ultrasound and said that she has a cyst in right side. Dr abd all were confused as her pai was in left side and reports said of right side then we got a ct scan in panipat. The ctscan report said that the cyst was in left side only. It was so sad to know such a big hospital but they give such a wrong report. A big misguide to patients"
    },
    {
      "source": "MouthShut",
      "hospital": "BLK",
      "review": "Misbehaving counter staff lady to his all patients in opd 7 opposite dr ajay kumar cabin timing 3.30 pm on 14.01.2025 in BLK Hospital"
    },
    {
      "source": "MouthShut",
      "hospital": "BLK",
      "review": "These idiots, made a fake surgery of my sisters knee, when i noticed displacement of patella , I informed the doctor but they denied and said ye aisa hi hota hai apko dekhne me farak hai, today one more surgery done and another hospital to fix the issue which doctor Chaudhary denied said it is not an issue.\n\nTum Bkl marogay koi ni ayega bachane , tumhari niyat khraab hai, bas paisa bnana hai kaise bhi kr k, bkl khi k ."
    },
    {
      "source": "MouthShut",
      "hospital": "BLK",
      "review": "No as per new rule all CGHS beneficiaries are required to register in CGHS site as patient in empanelled hospitals to avail cashless treatment. In BLK don't know why CGHS site never opens and patients could not be registered as patient of that empanelled hospital to avail cashless treatment. Other hospitals already registered the patients and I have received message regarding this. Many CGHS beneficiaries are strangled for billing and finally land up in making payment for treatment. So much hardships faced by CGHS beneficiaries. They need to take suitable action in this regard that CGHS site works properly in their hospital. My treatment is getting delayed because of this."
    },
    {
      "source": "MouthShut",
      "hospital": "BLK",
      "review": "Flour supervisor his name is mr. Amit is a good person to serve his patent . Nursing staffs are also cooperative and kind. I specially wants to thank Dr. Roiy for his kind treatment towards us."
    },
    {
      "source": "MouthShut",
      "hospital": "BLK",
      "review": "My brother Vijay Khatri was also admitted to BLK max hospital after being brain hemmorahage . After his discharge from there, he became a dietician her. Name SAIMA and recommended a very good diet to us, after which my brother's health improved a lot. He has recovered a lot. For this we thank Dietitian SAIMA WHO from the bottom of our hearts. May God give you long life."
    },
    {
      "source": "MouthShut",
      "hospital": "BLK",
      "review": "I am a super citizen aged 82 years and Delhi adm card holder On 5th July at 6:15pm i went to emergency with my son and daughter in law i was very well treated at the gate and was immediately taken to the causality where the housekeeping staff made the bed in no time and doctor examined me after the nursing staff checked all my vitals without wasting time There was rush of patients but each one was taken care by all the staff The general surgeon was called I DIDNT ASK HER NAME a well qualified doctor with warmth and care she examined me and assured us that there’s nothing to be worried about She prescribed some medication and wrote discharge I am so thankful to each and every person who has given me utmost care I pray to God for everyone’s well being GOD BLESS U ALL\n\nTHANKS A LOT ????????"
    },
    {
      "source": "MouthShut",
      "hospital": "BLK",
      "review": "Vinit rajni and anita is very helpful and give good service, all of them from fnb department. Very good service."
    },
    {
      "source": "MouthShut",
      "hospital": "BLK",
      "review": "Attentive and helpful staff. Sandeep and Atul ji were very helpful and good care of patient and attendants."
    },
    {
      "source": "MouthShut",
      "hospital": "BLK",
      "review": "Excellent staff and medical care taken of patient.\n\nStaff members who take care of the patient are really helpful and working from their heart.\n\nSpecially Sushma ji and Deepa ji from cleaning staff are genuine people there to help people."
    },
    {
      "source": "MouthShut",
      "hospital": "BLK",
      "review": "My experience at B.L. Kapoor Memorial Hospital was pathetic as I took an appointment for my wife with Dr. Denish kansal, Director & HOD (Centre For Women Health) but on the appointment date the doctor was not available and my wife was referred to her Dr. Supriya (junior practicing doctor) and she didn't paid any attention to her.\nInpatient Department\nThe staff were unprofessional and unhelpful, and the facilities were not well-maintained.\nThe wait time was excessive, and the quality of care I received was below average. The doctor seemed rushed and didn't take the time to answer my questions or address my concerns.\nNo, I would not recommend this hospital to others.\nThe hospital needs to improve its staffing and facilities to provide better care for its patients."
    },
    {
      "source": "MouthShut",
      "hospital": "BLK",
      "review": "Excellent service hospital staff nurses doctor all'service hospital best'of best' but f&b service is very"
    },
    {
      "source": "MouthShut",
      "hospital": "BLK",
      "review": "Good Evening.\n\nToday i visited the hospital and got some investigations done in BLK hospital. Ms.Girina and Ms. Sagarika from the ACD desk were very cooperative and were very fast in providing us their services. Had a very smooth experience."
    },
    {
      "source": "MouthShut",
      "hospital": "BLK",
      "review": "We are admitted in hospital since 2nd Nov and were blessed with a baby on 3rd. We are still admitted in hospital with 3 days old baby but the services are pathetic . Our house is 10 mins away from BLK therefore we chose BLK but within hospital it take resident doctors over 30 mins to attend the patient. The doctors come in and tell us that you are not in a hotel that you would be attended quickly. Today the kid was bleeding profusely due to umbilical cord dislocation but doctor took 48 to mins to check, in between we took him to NICU to get help but the doctor in NiCU told us to go back to room and wait as he won’t see the baby because he was not under him and registered under different doctor."
    },
    {
      "source": "MouthShut",
      "hospital": "BLK",
      "review": "Never written any reviews on anything or anyone, but I really wanted to write this for that one Doctor. My uncle was admitted to BLK hospital because he was having some serious issue, so he had to be admitted for around 5-6 days. Of course staying in the hospital for quite a long time was not my cup of tea and I never like hospital's because the staffs and doctors they have some serious ego issues that need to be fixed. But this one Doctor completely threw my thoughts out of the window, every morning he does his rounds so cheerfully which lightens up the mood of the patients and even the attendants coz as a family even we go through a lot of things. So down to earth always ready to clear our doubts, he always have this smile on his face, no matter how many questions we throw he always catch them all. One of my brother is a doctor and he is planning to go for specialist and he said he wanted to be like the Doctor he has become an inspiration for him. I believe doctors should not only use their brains while dealing with a patient need to give room for the heart too to listen. Dr Chandragouda Dodagoudar (Medical Oncology) may you become an inspiration and a hope to many like you have been to us."
    },
    {
      "source": "MouthShut",
      "hospital": "BLK",
      "review": "Management experience is good and cooperative. Charu mam is very good. Got appointment on time.my experience is very good before also. Helpful and cooperative staff."
    },
    {
      "source": "MouthShut",
      "hospital": "BLK",
      "review": "My experience with blk max very painful.\n\nI was here Sunday to Wednesday .\n\nI was in pain' of migrane.\n\nFirst day whole day doing test and waiting for reports. Till reports i was facing big pain' Dr. Atxxx parxxx have not time values for there patient. His juniur Dr. Saying 9am Dr. Will come but he come 12.30. first day\n\n2nd day same situation. After that Dr. Hxxx no time to listen Dr. Patient.\n\nHe is doing experiment with many medicne but no relief on pain. And also he feel us as he irritating with us . Forth day without listening me Dr. Tell that u are fine u can go home . I tell him that last night also I can't sleep due to big pain'. But he ignore that. Till then I also fade up of there system and behaviour. All staff in night is irresponsible. If we need Dr. They have no answer.\n\nI was feeling very helpess last night when I need most of Doctor and I am in Delhi capital of India with most reputed and big hospital BLK Max.\n\nThis is worst then government hospital.\n\nAfter they raise a bill of 135000 for 4 th day . Also they have not given any information of my admit to TPA.\n\nSo TPA tell us that this is hospital responsibility to inform if he admit and patient. So TPA create many queries.\n\nNow 3 pm to 9.30 pm I am sitting without medicine without any Dr. Help.\n\nAfter my request TPA approval the payment and I come back home.\n\nSo I request to all first check all reviews about Dr. And hospital then get admit in this hospital."
    },
    {
      "source": "MouthShut",
      "hospital": "BLK",
      "review": "Dr Nidhi Khera is a dedicated and compassionate doctor. She treated my daughters PCOD problem very skillfully. My daughter is really fortunate to get treatment from her. Her friendly behaviour with her patients is very heart touching."
    },
    {
      "source": "MouthShut",
      "hospital": "BLK",
      "review": "My sister went there for consultation regarding her chronic back pain. After paying 1700 opd fees, the doctor was rude and uncooperative. He didn’t examine her properly, was in a hurry, ridiculed her concerns and never bothered to answer her any queries. He was so unprofessional even after paying so much for the consultation, like he was doing her a favour. The same applies for the physiotherapy, rather than answering her question, all they wanted to do was show her the package for treatment saying “ we’ll tackle it, you should sign the package” no wonder doctors get beaten by the patients. They take their ego to such a high level and their rudeness is unbearable. And before anyone point finger for doctor violence, I am an MBBS doctor too, and have worked in governor hospital. There is no situation where you have to consult a patient in that manner."
    },
    {
      "source": "MouthShut",
      "hospital": "BLK",
      "review": "Agar aap k pas Mediclaim policy hai to bhi aap say extra charge liya jayega staff untrend hai bathroom aur Safai vyavastha poor hai sara staff had say jyada rood hai bas"
    },
    {
      "source": "MouthShut",
      "hospital": "BLK",
      "review": "I got Herpes zoster severe one and visited my favourite hospital as usual BLK MAX. Although i had always recommended Blk but this Sr dermatologist Mr Hemant Sharma doesn't fit to be in such a reputed hospital. After a week of antibiotics dose when i visited again he didn't even bothered to look at the infected area and continued the dermocalm lotion, the lotion is good for a week but after that it needs some moisturizer and not that itchy one. My pain got worse then i visited private dermatologist and there i got better treatment. Please don't visit this Sr dermatologist Hemant Sharma if you want to get cured."
    },
    {
      "source": "MouthShut",
      "hospital": "BLK",
      "review": "My father is an existing patient of dr. Ajay Ajmani. For billing we had to wait 20-25 minutes. But in this time we did our billing from pcd desk where it took just 5mints. Dr. Prescribed my father some text although he is not in fasting so we were planning to come next day. But Ms Godavari suggesed us to do the billing now and she will send one lab executive to my home to collect the sample. I did the same . My father sample had collected from home and on revisite day received alll tests reports .The concept of PCD DESK is very good even the staff are very good. Specially thanks to Godavari .she is extremely energetic. She safe our on round of hospital"
    },
    {
      "source": "MouthShut",
      "hospital": "BLK",
      "review": "Very rude customer care, they disconnected my call very rudely within one minute.\n\nI was just asking about the reports for a very serious case.\n\nOther customer care call said they cannot find a report, which is only few days old.\n\nMy father was admitted 3 times approx 1 lakh bill everytime, they happily took 3 lakhs from me but they don't even have the patience to talk and provide reports?\n\nWhen doctor come specially for the visit for which they are charging me everytime, doctor doesn't stay more than a minute or two, they don't answer questions properly, even for such a case where heart surgery is needed?"
    },
    {
      "source": "MouthShut",
      "hospital": "BLK",
      "review": "Hi,\n\nI'm sharing my last 2days back personal experience of this hospital after spent 5days in this most worst hospital. my mother got sever headce so we went to the hospital through emergency after 2-3 paracip injection she doesn't get relief so doctors advice to admit so we did the same . after admit next day doctor came for round Dr.Rajiv Anand he is most most pathatic, arogant, egoistic mannerless doctor i have seen..jise 2-MRI whole body check-up ke bad he didn't understand the main cause of disease. Then he started to give steroids to my mother and after that my mother get migraine stroke all of sudden, i called almost 10 times to the nurse doctor since midnight but nobody came after thay when i shouted nurse saying doctor is calling u , they are like stupid my mother is not in that condition ki i leave her when i shouted after loose my temper one JR is came and he is neither understand English nor hindi then alomost in afternoon Rajiv anand is came and said you are shouting and you are not coperating blaa blaa if you have emergency then shift to the ICU . ye log sunte nh medicine nh dete upr se chilate hai.Dr. Rajiv prescribed Tapentadol nasal spray and he didn't say that its SOS only sister came every day and gives medicine which is prescribed by doctor so i know ki kon si kb deni h. 3rd day sister give that nasal spray to me that put it a one drop in her nose i did it the same she said after 2 sec my mother got unbearable pain and doctor didn't came, he came 11 arround and conpletly denied that he didn't said to give her in ok condition you are lying and he is shouting on us neither he discharge us also we forget to ask something so i ran behind him to ask some so again shouted us ki ye tarika hai doctor ko bulane ka .on 5th day we avoid her medicine nd my mother feels good so we got discharge finally. Then at the time of billing the so called \"Rajiv anand doctor\" extra visit charges on my discharged day nd then he is also denied because of him we got discharged 10:30 at night..so giys this my genuine nd personal experience of this doctor and hospital please don't visit that hospital because they are only making money they don't care how's ir patient how his/ her life imp to their families. nursing to doctor all are pathatic worst manner less rude bribers. also i have seen the same stories those patients who are in my mother's room. one lady shifted from icu and because of doctors nurse she suffered loss of blood bad worst condition .\n\nplease dear whosoever read this please be careful tho this hospital and doctor specially doctor rajiv neurologist and his team their degrees are waste because they dont have manners to treat patients."
    },
    {
      "source": "MouthShut",
      "hospital": "BLK",
      "review": "Dr surendra kumar dabas.well named doctor in b.L kapur hospital.my father was there just for hernia surgery.he convinced us for robotic surgery & we believed in him.he punctured large intestines while trying robotic surgery & wasn't even able to proceed & he did manual surgery.how can any hod doctor didn't came to know that he punctured something inside the body.total medical negligence case.as a result, my father died due to septic in multiple organs.he is a murderer & he didn't even realized it.Don't go to such inhuman pathetic doctors or hospitals.they will kill you for money.be careful.he spoiled a happy family.he doesn't know the meaning of excruciating drastic pain which we are going through right now.god will Make you know...\n\nGod will also say the way u said 'galti ho gayi'"
    },
    {
      "source": "MouthShut",
      "hospital": "BLK",
      "review": "They will just let you die. All they want is your money. Staff will not respond. Medical facilities are not available. Won't even give you good food to eat & will not bother if you're able to eat their packed thali food."
    },
    {
      "source": "MouthShut",
      "hospital": "BLK",
      "review": "Hi friends , this hospital has very good infrastructure.\n\nBut the staff is bad and slow . Very poor communication among them . Leads to complete disaster."
    },
    {
      "source": "MouthShut",
      "hospital": "BLK",
      "review": "Third class hospital in the name of Mr. B.l kapur Lahore. Just like Pakistani. Estimate give less because we can admit patient and after that payment is more than 5 times that patient have to give. All this procedure done start from emergency than doctor than admission counter and after discharge on billing counter. Please don't take claim reimbursement your file here."
    },
    {
      "source": "MouthShut",
      "hospital": "BLK",
      "review": "Patient Name: Ashok Kumar\n\nMRD No.: 60511\n\nEmergency No.: 3407334\n\nAdmit Date: 8th Feb 2021\n\nAdmit Time: 4:54 PM\n\nReason of admission: High BP 190/80\n\nI along with the patient (my father) went to BLK Emergency ward as per the above-mentioned date and time. Dr. Sargam attended my father when his BP was 190/80 they gave medication ( Tab Amlogard 5 MG + Arkamin 5 MG ) and advise us to wait for an hour meanwhile they investigate the ECG on the side bed which was in the passing way of other patients and attendant. But god gracefully ECG was absolutely fine as per Dr. Mayank who was available at the emergency desk.\n\nAfter almost 1 hr they allotted a bed (Bed No. 9) we waited patiently over there and the BP was 180/80.\n\nAgain they repeated the medicine Amrogard 5 MG around 6 pm and advise us to wait for another hour. There was no other investigation that has been made not even the temperature check by the nursing staff except the medication, ECG, and bed allotment till 7 pm. We requested them to connect the Monitor so that we can also check the BP and Pulse rate. But they paid deaf ears to all our requests and we were left with no other option. After so many requests to Dr. and nursing staff to monitor my father's BP they came up with cannula when I asked why is this needed they told me we have to inject 2 gastric infections. After this activity, they check the BP again, and it was 170/80, and then they injected one more injection to low down his BP, and that all they have done.\n\nAround 7:15 Dr. Mayank approached us not to check my father but to advise admission, when we ask the reason he said Dr. Sargam suggested it so, but we denied it as my father was feeling perfectly fine and ECG was also fine.\n\nHe again suggested us to wait for an hour and again we waited patiently. At 8:15 we requested them to discharge my father and around 8:30 we got the bill of 6030 INR.\n\nIt was a great shock to us as we had to pay such a big amount at the emergency center for 3 tablets + 3 injections + ECG and a Cannula worth Rs 800 - 1000.\n\nMoreover, when we saw the bill summary the 1st thing we noticed was laboratory service charges which are related to sugar added to my bill worth Rs 1370, and these investigations were never done as I was standing next to my father throughout his admission.\n\n2nd thing we have noticed was the Triage Charges worth Rs 1800 added to my bill just to use their Emergency Bed.\n\n3rd thing which we have noticed is the consultation fee worth Rs 600 at the emergency ward and as per my past experience I had never ever paid any consultation fee at BLK Emergency.\n\n4th thing we have noticed was under the medical consumables section in which every higher amount of consumable is double charged.\n\nAfter checking the bill copy we raised our concern to the billing department they suggested we visit and meet M.O.D, we visited him in his room and discuss the matter. He was literally shouting at me saying we really don’t like people who came up with such complaints once their patients get well. We told him to be polite and professional as we are talking about our concerns. He gave the explanation that no doctors and nurses can provide you details for the treatment to be given to your patient. He was not willing to listen to our concerns and said that I can only waive off Rs 600 from your bill now please go and pay Rs 5430.\n\nLet me be very clear that this M.O.D was extremely rude and unprofessional. I did not want to bother my father so I paid the amount and leave the hospital.\n\nAs per my previous experience, I believed BLK was a reputed hospital and I always prefer to visit BLK for all our health issues. But this time I noticed BLK is also giving a false or dummy report for the investigations.\n\nIn my case, I received a false report for the investigation which had never happened throughout the admission. That too we receive when we questioned about the investigation charges. I have never come across such an awful experience with BLK hospital. This time I m extremely disappointed with your services, unprofessional behaviour, and unjustified charges.\n\nI want you to go through with this case and do the needful asap. I know my rights very well so it’s a request to return my amount which you have taken unethically.\n\nPlease contact me with the earliest resolution to my concern on my below-mentioned details.\n\nName: Rashi Shinh\n\nContact No.: 958203XXXX\n\nEmail ID: rashi.sxxxx@gmail.com"
    },
    {
      "source": "MouthShut",
      "hospital": "BLK",
      "review": "Hi friends , this hospital has very good infrastructure.\n\nBut the staff is bad and slow . Very poor communication among them . Leads to complete disaster . Very casual and careless staff . Kindly stay away from this hospital . No one wants to guide you properly ."
    },
    {
      "source": "MouthShut",
      "hospital": "BLK",
      "review": "Had worst experience with BLK hospital, Delhi. My mother, a CGHS beneficiary, admitted for ENT surgery (throat abscess) was declared Covid positive. We were charged One Lac rupees for 7 days Covid treatment as per CGHS rate despite having permission. As the billing staff denied that the permission has been submitted in completion. They kept on digging loopholes or else I say finding loopholes to grab a huge sum of money. They are butchers waiting for golden geese.\n\nThe staff is useless, careless and rude. They discharge people without conducting negative Covid tests and when a surgical patient goes for follow up the billing team and doctors insult them for not showing negative Covid report to them. Why on first incident, they discharge patients saying everything is normal if they are not sure and need to see a negative report, which patients are solely responsible to get it done. They forget to give food when patients are hospitalized for days in ward. The nursing staff need reminders from attendents again and again.\n\nInsulting senior citizens and dening further treatment because the patient was declared once Covid positive is in their imbibe values. The billing staff, on fetching one lac rupees from a retired CGHS beneficiary despite permission for cashless treatment, asks the attendants to give in writing that they have submitted one lac rupees in cash on their own wish, is disgusting. I DO NOT RECOMMEND ANYONE TO AVAIL TREATMENT IN THE HAND OF THESE BUTCHERS WAITING FOR GOLDEN GHEESE AT ALL.\n\n#ENTDept #OperationManager #FloorManager #Coordinators #NursingStaff #BLKHospital #Delhi #ButchersWaitingForSnatchingHugeSumOfMoney #CGHSBeneficiary #CGHSpanel"
    },
    {
      "source": "MouthShut",
      "hospital": "BLK",
      "review": "I went to the hospital with an appointment of 5:30 pm . And when I reached there the doctor was gone and they simply told me to come some other time ??"
    },
    {
      "source": "MouthShut",
      "hospital": "BLK",
      "review": "Overrate in this lockdown ... Online consultation is cheap in everywhere but their online consultation fee is higher than normal and in my first appointment doctor prescribed me only tests and said show your tests after that i will consult you and after 2 days they r saying me pay 1300 again then we'll connect you with doctor ... I told doctor she also don't want to see reports ."
    },
    {
      "source": "MouthShut",
      "hospital": "BLK",
      "review": "Sir today 29 april 2020 he kal mere papa ko.raat ko yaha laye the blk rajendrpalace hospital.me hamse 150000 manga hamne jama kiya iske baad corona ka report karvaya mere papa ka aj uska reslut ayya posative he lekin jab mere papa aye to unhone kaha ki 2 hour tak pani ke chillaya , 2 hour tak koi bathroom ke liye bnahi le gaya na koi khana na koi dekh rekh fir kis.chiz ke liye 150000 only 6 7 hour ke liye liye"
    },
    {
      "source": "MouthShut",
      "hospital": "BLK",
      "review": "Everyone - BLK Kapoor hospital which is located new delhi in Karol Bagh is pathetic due to his Faculty.\n\nOne of them considered to be a Senior Doctor name Dharma who is bone marrow specialist.\n\nHe guided us wrong many times and took alot of money and even the result start getting worst.\n\nAnd he always says one things it cannot be cure for sure....\n\nLong story cut to short one we went to a different hospital And now the situation of the patient is all controlled...\n\nBasically i would also tweet the same matter to Mr Modi and Arvind Kehriwal as we should cancel their degrees and all...because mr Dharma is a Money Mosquitoer........"
    },
    {
      "source": "MouthShut",
      "hospital": "BLK",
      "review": "Again the same experience. I had an appointment.bi was asked to wait for the doctor. After 40 minutes of waiting when went at counter 4 where I made the payment, I was told that the doctor isn't picking up the phone and won't be available. That's highly ridiculous. Sheer wastage of the patient's timings. I came specially from Nawada for my treatment."
    },
    {
      "source": "MouthShut",
      "hospital": "BLK",
      "review": "Worst experience from BLK..the money making hospital..I am very depressed by the treatment of this hospital..my father who is a patient of cancer admitted in Aug 2018..by then only his downfall done.. doctors of the hospital says he that he will be fine..till today they had done 4 operations and no recovery..they only want money..nothing else..doctors are only making fool of patient"
    },
    {
      "source": "MouthShut",
      "hospital": "BLK",
      "review": "Dr. Alka Sinha is the horrible, totally rude n misbehaving with zero knowledge. She is disturbed psycopath"
    },
    {
      "source": "MouthShut",
      "hospital": "BLK",
      "review": "Wrong Diagnosis by MRI DEPARTMENT and wrong treatment by some doctors. They has given medicines whether Patient is required or not."
    },
    {
      "source": "MouthShut",
      "hospital": "BLK",
      "review": "BLK Hospital Facilities are good but few doctors who act as gold diggers are shaming this hospital. My mother was treated without reasons by Dr Subhash chandra (Cardiology) and though at the operation theatre her veins were punctured but procedure was not due to \"No Requirement\", this was feedback of junior doctor doing the laser procedure. We had to pay all expenses of procedure. After four days when my mother had continuity of fever we went to him with new blood reports, he shood us away like dogs, \"while we are standing he said, yeh fever hai apko, yeh mera department nahi hai, consult doctor in medicine\". NOW coming to \"Gold Digger\" situation. Dr Subhash chandra asked me if I want to make a reasonable billing then I need to buy catheter which are used for procedure from outside chemist. I said fine as it may save me money. I got a call from his assitant sanjeev who refered me to a medical supplier called Nilesh. Nilesh quote was one lakh and after small negotiation he gave to me for 48000. He refused bill and said that he will deliver catheters to doctor directly. Now when the procedure was not done I asked to refund, the medical supplier told me that 12000 plust shall be refunded and he did. The whole episode is true and recorded. These kind of doctors are a curse to our system."
    },
    {
      "source": "MouthShut",
      "hospital": "BLK",
      "review": "Thieves in the BLK accounting office hacked my credit card account while I was on the operating table and took$5, 000. It took 5 months for my bank to investigate and correct this brazen theft.\n\nBLK staff did everything they could to cover up the theft; they will not connect you with hospital police and they run you around from office to office to office. They then disconnect you or pretend not to understand you. If you are from a foreign country, it is impossible to get the Delhi cyber police or the Indian newspapers to investigate. WARNING TO FOREIGN PATIENTS; Either pay these thieves in cash, or if you use a credit card, demand to have the payment done by a senior accountant, stand right on top of them and watch and closely verify every single step in the transaction as it is being done. These people would steal from a dead man."
    },
    {
      "source": "MouthShut",
      "hospital": "BLK",
      "review": "MY WIFE ADMITTED IN THIS HOSPITAL FOR HYSTEROSCOPY\n\n, THEY ADMITTED HER EMPTY STOMACH AND MADE HER WAIT TILL EVENING 5 PM. ON BEING ASKED THE VOICE WAS LOUD . MOREOVER PILLOW COVERS WERE DIRTY AND CURTAINS WERE NOT CLEANED.\n\nHOUSE KEEPING NEVER RESPONDED, MOREOVER DOCTORS VERY RUDE"
    },
    {
      "source": "MouthShut",
      "hospital": "BLK",
      "review": "They are concerned about only money making. No caring for patients, over priced in all things eg. They sold diapers@1300 which was sold in market @220 . Very bad mAnasultangement . Doctors focus on making fools to attendants emotionally and to perform different surgery and unnecessary tests. Doctors are not capable enough. Ganga ram is the best hospital."
    },
    {
      "source": "MouthShut",
      "hospital": "BLK",
      "review": "Bad experience. Worse than govt hospitals. They keep charging you for nothing. The processes are very slow so that your hospital stay is prolonged n they keep making money from u. Unnecessary referrals. N they won't trouble u for money on a daily basis n suddenly bombard you with a huge amount to be paid. I am a doctor myself n went through referral. If this can happen to a doctor imagine the plight of a common man.\n\nMy father in law was admitted one week back n till today his angioplasty despite being planned 4 days back is not done. N today they gave the reason that the equipment was used by some other doctor. Ridiculous. Ways to make money. N u keep chasing the doctor for information"
    },
    {
      "source": "MouthShut",
      "hospital": "BLK",
      "review": "The doctors are so inhuman and their treatment resulted in serious injury to my one month child\n\nUpon consulting with them they have given the treatment to child which lead to increase in injury\n\nMoreover the so called doctors , may be worst than compounders, was not feelings was not feeling sorry for same"
    },
    {
      "source": "MouthShut",
      "hospital": "BLK",
      "review": "My experience at BLK Hospital is very bad.\n\nThey make you wait for very long without any updates.Also, if you follow up from their staff, no proper information is provided.\n\nDoctor called my father for scheduled cataract surgery in the early morning by 8:00 am to occupy the bed.But, my father struggled a lot from getting admission to the un-defined time of surgery without any food or water as no eatable or drinking was recommended till the time of getting surgery.\n\nSo, I will not recommended this very expensive hospital with very poor services to anyone."
    },
    {
      "source": "MouthShut",
      "hospital": "BLK",
      "review": "Dear all\n\nPlease treat this review as warning before hospitalizing your near and dear ones.I lost my dad which was not expected under any circumstances.I took him to emergency where doctor examined him and advised to get him admitted for further tests and diagnos what exactly is the problem n accordingly treatment will be advised as per doctor symptoms were related to liver problem but I produced the reports of all tests which were done in month of December and January which didn't show anything critical.As advised we got him hospitalized but at midnight he complaint of having fever which my mother brought to notice of nurse on duty and then she came up injection which blew away his consciousness and after this he lost his senses.\n\nPlease note my dad came walking from car to emergency n drove the car for almost 1.5 grs same day. But after the injection was given he started having oxygen problem then he was shifted to HDU on 6 floor and in few hrs his BP was drastically down which surpised us as he never had BP n Sugar throughtout his life n never had medicines for these.And they shifted him to ICU stating this oxgen mask is not sufficing here n he is becoming restless and few hrs later on to ventilator.we only came for getting all tests done n diagniosing the issue and take proper medication but within few hrs our whole life changed and after being on ventilator for 02 days he left all of us in pain and grief.This is result of no proper treatment n all started with injection given by nurse and after that these guys couldn't normailze n his condition detroited with each passing minute.Most importantly they will come up with ideas to provide added machinery which costs as good as 60 to 70k per day n want to put on observation for 15 days.And these machines will not improve the situation rather will make money for Hospital.\n\nShameless creatures rather I doubt they have any humanity left in their souls."
    },
    {
      "source": "MouthShut",
      "hospital": "BLK",
      "review": "Hi friends I want to tell that when my sister is seriously ill me and my family get very panic that now what should we do now as you all know friends that in this anyone get hopeless so after that we take her to a nursing home which is near to our house after checking my sister doctor said that is nothing a normal stomoch pane we also think that doctor is right but after few hour the pane is going not so normal then the doctor says now I am not able to heal her take her to b.l.k then we take her to b.l.k they are great they are god they save my sister.\n\nThanks b.l.k"
    },
    {
      "source": "MouthShut",
      "hospital": "BLK",
      "review": "I had Visited the Hospital for my Grandfather's Heart Problem . The Problem was Minor as it was Adviced by some Other Doctor to Show to Someone, Who is A Specialist as I will be Unable to Treat Properly .\n\nAfter A Suggestion of Mr X Doctor I had Visited BLK Super Speciality .\n\nFor that they had Followed a Long Process of Xrays and All with some Blood tests Also . which are not at all Required and Admitted them for 5-6 days which Costs a Huge Amount .\n\nThe sevices Provide by Them was Good but they tries to keep their Patients for Long as Possible because they have to charge Alot .\n\nThey Give a Service of 5 star but it is not Affordable by all, Especially a Middle Class Family ."
    },
    {
      "source": "MouthShut",
      "hospital": "BLK",
      "review": "I have lost my beloved father here! Can't explain the whole senerio here plz feel free to call or drop a text on 9899591626 I will call.u and explain you andwill give you atleast 10 reason to not to go here! Please please please please do not go here if u love your closed ones . I would not recommend thishospital to my enemy either! Doctor Bhagwan ka roop.hote the ab ye log kasai se Jada Khatarr naak hai! I hope this hospital shuts down. Way soon to save some lives. Plz call or msg if u need any help"
    },
    {
      "source": "MouthShut",
      "hospital": "BLK",
      "review": "Hello friends today I am writing my 90th review on mouthshut.com. Mouthshut.com is one of the best website in India to earn money easily without investing much time and labour . Today my reviews related to a hospital which is named as Blk super speciality Hospital it is located in Delhi as we all know Delhi is famous for the qualities of hospital present here like all India medical, panth etc . So let's get started with the review of this Hospital .\n\nThe first thing which comes in our mind is the medical care which is most important for a hospital. My experience regarding this hospital was started 4 months ago when I admitted my friends grandmother in this Hospital . She was suffering from high blood pressure and her condition was not in control at that time. For the admission process they they charged a big amount from us . And also do a lot of test most of which are not connected with the problem .\n\nThe next thing is the infrastructure of a Hospital the infrastructure was good the hospital is very well constructed and you will find every machine which is required for a most typical patient to recover. But the administration of the hospital is words you will find a long chain of people connected to each other in the main hall for registration and completing documents to get their patient admitted in the hospital . The staff is not much in quantity to meet all of their requirements .\n\nThe sad thing is the staff and doctors behaviour and attitude towards the customers that is the patient and their relatives and loved ones. The receptionist was very much rule to the family members and loved ones of the patients .\n\nAt the last I will not suggest you to go to this hospital for small injuries common diseases and surgeries . It is very much expensive also which I forgot to write in the above aspects ."
    },
    {
      "source": "MouthShut",
      "hospital": "BLK",
      "review": "My relative was admitted to BLK for a kidney related problem. The problem was minor as they had to insert a needle into the kidney from outside to drain all the puss that had accumulated there.\n\nFor that they did a whole Xray and MRI twice alongwith blood tests which was not required. It costed 90k Rs for that simple process and they kept the person admitted for 6 days.\n\nThe private hospitals like Blk make you stay there for days beacause the rooms which are rented are rented on daily basis. The more a patient stay the more they earn.\n\nServices are high end like a 5 star hotel but they all do that at a high cost which are not affordable by middle class people."
    },
    {
      "source": "MouthShut",
      "hospital": "BLK",
      "review": "From Last Few Months My Mom Is Facing High Pain At The Back And Joint Due To Which She Won't Be Able To Stand For Long Time She Had Went To Many Doctors But No Improvement Was Seen In Her Problem Finally SomeOne In My Relative Had Recommended My Mother To Have Treatment From Doctor Duggal Who Is a Famous Neurologist Of Delhi And Works At BLK SUPER SPECIALITY HOSPITAL I Went There With My Mom The Infrastructure Of BLK SUPER SPECIALITY HOSPITAL Is Impressive And Huge From Outside And Inside It Is Well Constructed There Is a Separate Paid Parking Area For The Visitors And Patients.\n\n~ We Had Went To Take An Appointment The Receptionist Told Me To Pay Rs 2700 Rs I Was Bit Shocked After Hearing That Amount So I Made It Cleared And Asked It Again And She Told Me That On First Visit You Have To Pay The Fee Of Rs 2700 While After That That On Every Visit You Visit The Fees Will Be RS 2500 I Have Paid The Fees She Had Given Appointment Of 8PM But After Our Appointment Has Camed She Had Sent SomeOther Random Person Without Appointment Inside The Doctors Cabin As He Have Paid Extra Fee For On The Spot Appointment After Waiting For More Than Half N Hour Finally Our Turn Has Camed And My Mom Had Discussed The Problem Of Pain With Doctor He Had Told My Mother To Do MRI And XRAY After That He Will Pursue The Treatment And He Had Told Us To Come Again After 2 Days.\n\n~ After Doing The Test It Cost Around Rs 4290 We Went To. BLK SUPER SPECIALITY HOSPITAL To Show The Reports To Doctor But They Had Charged RS 2500 Again Just For Showing Reports We Have Paid The Fees And Went Inside The Doctor Has Checked The Reports And Written Medicines According To It And Told My Mother To Comeback After 1 Week Till Date Take All This Medicine On Time And Do Not Miss It, We Have Taken The Medicines And My Mom Has Started Taking It From Night But Medicines Are Either So Strong That After My Mom Have Taken It She Felt Such An High Pain That She Can't Be Even Able To Stand From Bed Or Do Any Work.\n\n~ Next Day Morning We Had Calll At BLK SUPER SPECIALITY HOSPITAL For Emergency Appointment But Receptionist Told Us That Firstly Doctor Will Be Available In The Evening And Its Being Normal With Some Patients That Such Pain Occurs And She Refuses To Give Any Appointment Of Today After Long Argument Of More Than 26 Minutes She Had Told Us Arrogantly To Come And Take Appointment We Went Again Paid RS 2500 Taken An Appointment Waited For 15 Minutes The Doctor Has Told My Mom To Stop Taking All The Medicines And He Had Written 5 To 6 Test More And After My Mom Had Did All The Test It Cost For Rs 12800, After We Went Again Paid The Fees RS 2500 And Doctor Has Checked The Report He Had Written Again Few Medicines And Told Us To Come Back After One Week.\n\n~ After Again We Took The New Medicines And My Mom Started Taking It But No Improvement Was Seen In Her Health Even After A Week And We Had Decided To Stopped The Treatment From BLK SUPER SPECIALITY HOSPITAL I Will Never Recommend Anyone To Had Their TreatmenT From There As You Might Got Confused After Watching Its Huge Well Constructed Infrastructure But Medical Facilities Are Limited When I Asked The Receptionist That We Want To Do Few Test She Told That Only XRAY And MRI Can Be Done But Not At This Moment As Operater Is Not There.\n\nThe Team Of Doctors Are Limited Mostly Practicing I Have Seen That During Any Emergency Cases Or Operation They Called The Doctor From Any Other Hospital, The Staff Is Arrogant And Behave Rudely With Patients And Mostly All Nurses And Wardboy Are Untrained And Young In The Age Of 20, No Improvement Was Seen In My Mom Health Beside The Doctor And Management Are Kept On Making There Money Through Every Patient Visit, Medicines They Told Us To Do Test From Specific Lab Only As They Receive Commission From There And Even After Doing The Test The Doctor Won't Be Able To Tell The Reason Of Pain."
    },
    {
      "source": "MouthShut",
      "hospital": "BLK",
      "review": "BLK Hospital is primarily for rich folk and foreigners from Arab and African countries. Rest of the folks will get the right treatment. but at a huge price.\nInfrastructure: Decent. Better than Ganga Ram Hospital. To visit a patient only one person can go inside the patient ward. Strict checking is done. Cannot take food inside. There is a sleeping room with couches for 15-20 people at a separate section for those who cannot sleep with the patient on the small bench.\nRooms: Rooms are decent sized. 6-8 bed rooms are pathetic. No place to sleep or stand. For 3/2 rooms there is decent space but the other patient/relatives keep coming and going. shouting and having party. Even though only 1 person is allowed and only 2 are allowed during visiting hours. the crowd cannot be controlled by security. We had many fights with other people coming in huge numbers and putting TV on high volume and talking loudly. They forget that its a hospital and not their chai time masti.\nMedical care: Decent. Just like other hospitals 2-3 doctors and dieticians will visit the room for no reason and make 500-600 bucks per visit. Keep check on the medicines and apparatus being brought by nurses. Take the bills which are thrown away in the cupboard.\nBilling: Worst counter. Prepare yourself 1-2 weeks beforehand if you have insurance. Get all approvals done. Huge number of people standing in lines for billing.\nProblems: BIGGEST problem is its blood bank. They have a blood bank that provides tested approved blood for the surgery of your patient. The problem is that they ask for as much blood from the person accompanying the patient. So, for example if your parent is admitted and has to go through surgery that day. since morning you will be hounded to give 4-5 units of blood(find other relatives who have no tattoos, BP, diabetes etc) ASAP.\nThere is no proof whether that much amount is being used or not. Secondly, you cannot buy that blood from them. you have to give them 4-5 units(depending on what they ask). Thirdly, you cannot buy blood from outside blood banks. YOU HAVE TO DONATE BLOOD. In my case I was stressed. had not slept for 3-4 days. and was running around begging people to donate blood. And the blood bank lady was enjoying her mobile movie.\n\nAnd on top of this scandal. they billed thousands of rupees for that blood. I was shocked. when I went to the billing section they told me that the blood given to the patient goes through several tests and is 100% pure. So not only are you paying for that. you are also replacing that blood. Stupidity.\n\nAll in all. whichever hospital you go to. you are screwed. If you are attendant of a patient you are screwed further. You have to run from pillar to post for many things. If you get 2 minutes of relaxation time. that is disturbed as you are sleeping on a bench next to the patient and are disturbed by nurses coming and going."
    },
    {
      "source": "MouthShut",
      "hospital": "BLK",
      "review": "My brother who was suffering from a minor jaundice. He was treated for jaundice 2 months ago from fortis, and he was doing fine. But When he got it again so we thought to get it treated permanently from the best hospital in Delhi. So we reached Blk hospital after searching on internet.And then they started performing all kinds of tests, half of which had already been performed in the previous hospitals. But they didn't care We showed them all the reports from previous hospitals and but they continued performing tests. And then decided to perform a surgery to permanently cure Jaundice under the leadership of Dr. Yogesh Batra.They assured us everything will be fine and Jaundice will go forever. So after the surgery everything was ok and we took my brother home with all the medicines which were very strong,\n\nSo my brother ate the medicines for a week as instructed and then his stomach started aching, So we took him to hospital again. Unfortunately it was sunday. Dr Yogesh Batra was at home. So my mother called Dr Batra and asked him to come to the hospital and take a look at my brother.Instead of showing humanity by helping my brother he told that there was a team of doctors who will attend to him. But this team of doctors was nothing but a team of toddlers and without proper investigation they went ahead and performed a surgery performed another surgery claiming that there is a hole in the intestine, but they couldn't find anything and it was a wild guess. But this surgery weakened my brother and he was in icu with 100% ventilation.\n\nThen started the flow of medicine and blood.They gave my brother 21 bottles of blood along platelets. Where my brother was perfectly fine and now he was in icu in critical condition.after a few days we got to know that the nurses were not doing their duties properly, specifically one male nurse \" Tony Mathew\".My brother went ahead and termed this nurse a \"monster\". He even told us that these people are performing all kinds of experiment and will take his life eventually. But we trusted the reputation of hospital and the doctors. Our trust broke when of their own employees told us that something is not right. So we along with our family members went and lodged a complaint with senior management, they gave all kinds of excuses. Then they summoned Dr Batra, the moment we saw him, he couldn't face us.We could see the guilt in his eyes.\n\nRight after this incident they shifted him to the medical icu, where my brother gave up due to complete carelessness of the doctors and the nursing staff.\n\nThey claim to having the best of all the world, but it's just the machine they have, rest the staff is the worst and insensitive. They know how to mint money.Even though money was never an issue but life is not a game which can be equated with life. This is not a hospital but a place where murders take place in a legal form and they are paid in excess amount to do it.\n\nI am sure many might think that I am biased as he was my brother but I am saying the truth. If you love your loved ones do not think of going here as they will start with all the tests and end up by saying we cannot do much so please take him to any other hospital and finally they will take the life of your loved one.\n\nI just wish I had never taken brother to this hospital."
    },
    {
      "source": "MouthShut",
      "hospital": "BLK",
      "review": "My friend met with an accident on 4th december 2016 at around 12 am\n\nHe reached to BL kapoor hospital with the help of his friends .\n\nFirst of all they said they will charge rs 24000 for stiches in his eyebro ( total 10 stiches) , plus they said it will be a police case . I didnt understand y a road accident would be a police case . My friend has already lost too much blood . His whole shirt and pant was in blood because he also injured his upper lips in which he got 5 stiches later. They said they will not report until Police is informed\n\nAfter this I have gathered info about this hospital , I didnt get a single positive feedback for this hospital\n\nI stongly did not recommend this hospital"
    },
    {
      "source": "MouthShut",
      "hospital": "BLK",
      "review": "Hi All\n\nI am writing it as I went through with the bad experience of BLK Hospital.\n\nMy father is having Hemorrhoids and doctor suggested to operate.\n\nBut my father's sugar level was high due to which it cant be possible to operate and he is also having Thyroid problem.\n\nBut do not know why the hospital staff and doctor processed for the claim on the same day when my father visited first time and they were keep forcing us for the operation as the sugar level was high and the Anesthesia doctor has denied to operate due to high Sugar level.\n\nThey didn't make sure that what precautions which should keep before doing any operation.\n\nI am just writing this whenever you visit that hospital don't get them do the claim process until n unless you would be done with your all test reports and everything will be normal to operate.\n\nIt was very much bad experience of mine.\n\nHave a happy health to all."
    },
    {
      "source": "MouthShut",
      "hospital": "BLK",
      "review": "Hello sir,\n\nMy mother is on dialysis and needs to get admitted to your hospital for better supervision as her health is very critical currently. She is CGHS beneficiary and whenever we try to approach your hospital, the staff denies stating they are full. Kindly help me on this.\n\nHer current treatment is NOT going good in current hospital. Her health condition is getting poor and poor day by day and she needs a better supervision to get well soon. Please help me to get admitted to your hospital.\n\nThanks,\n\nRajiv\n\n9599111160"
    },
    {
      "source": "MouthShut",
      "hospital": "BLK",
      "review": "The doctors, nurses on duty are attentive & caring. They have given all sorts of co-operation and attention to the patient. Giving full marks for then tremendous care and support to the patient.!\n\nDr. B L Kapur, an eminent Obstetrician and Gynaecologist, set up a Charitable Hospital in 1930 at Lahore. In 1947, he moved to post-partition India and set up a Maternity Hospital at Ludhiana. In 1956 on the invitation of the then Prime Minister, Dr. B L Kapur initiated the project for setting up a 200 bed hospital in Delhi. The hospital was inaugurated by the Prime Minister, Pt. Jawahar Lal Nehru on 2nd January, 1959.\n\nBy 1984, when the hospital celebrated its Silver Jubilee, it was an expanding hospital well on its way to becoming Delhi’s premier multispecialty institute. Services offered included General Surgery, Ophthalmology, ENT, Dentistry, Pulmonology, Intensive Care and Orthopedics, apart from mother & child care.\n\nA factor of much importance to the hospital was the health of the community. Enthusiastic doctors held camps and public health talks to improve the status of community health in the area.\n\nIn the late 1990s, the Trustees of the hospital felt the need to upgrade it to a tertiary care hospital and tied up with Radiant Life Care Private Limited to re-develop and manage the facility. Today, a modern state-of-the-art tertiary care hospital has come up in place of the old hospital. It is one of the biggest stand alone private Hospitals in the National Capital Region today."
    },
    {
      "source": "MouthShut",
      "hospital": "BLK",
      "review": "Doctors and the hospital staff just need money thats it.they play with life of every patient.they treat us as customers.its just a business organisation.\n\nDoctors will keep pretending as if they dont know what has happen to patient.they will keep diagnosing the disease even though if its clear.dont recommend any person be elder or young to go to this hospital.if you love your family just avoid this hospital"
    },
    {
      "source": "MouthShut",
      "hospital": "BLK",
      "review": "This hospital just has big building and nothing else .\n\nMy sister was 10 months pregnant and she was taken to hospital.\n\nThe foolish doctor who is a gynecologist said that I don't have time please come next Tuesday. When my sis went through a test, it stated that baby was already pushing and making movements to come out and she still made them wait as she had to go some where.\n\nMy sis went to hosp. at 9 a.m and her operation started at 1 p.m.\n\nDue to that delay, the baby damaged his lungs pushing him out and my sis crying in pain when the doc did a Cesarean and just to show they kept the baby on ventilator that baby is ok but the baby was already dead.\n\nThis fuc*ing doctors were the cause of our loss. Please do not go to this hospital they only want money. They take 1.5 lakh from us and gave us the dead body.\n\nI am right now just crying or abusing the fuc*ing doctors!\n\n*Please don't ever go to this hospital I beg you. If u don't want to lose your loved ones.*\n\nWaheguru ji ka Khalsa\n\nWaheguru ji ki fateh"
    },
    {
      "source": "MouthShut",
      "hospital": "BLK",
      "review": "My Experience with BL Kapoor Hospital was very pleasant. I had to visit the hospital last month in case of my father’s oral cancer. We received very warm welcome at the reception. The staff was very cooperative and guided us all the way.\n\nWhen my father was admitted we were afraid of high treatments costs as the infrastructure was very good, though we were ready to pay any amount we could have afforded. But when doctor visited us and we told him about our situation, he assured me of everything and told me not to worry. And we had face bare minimum tests and examinations.  We faced no extra charges for anything, be it medical, tests or other stuff.\n\nAfter surgery my father had no symptoms of cancer and we after a week of salary we were released from the hospital. We are highly satisfied with the services of BLK Hospital, Delhi."
    },
    {
      "source": "MouthShut",
      "hospital": "BLK",
      "review": "I shudder every time I think of the 4 days I spent in BLK hospital, and I hope no one has to go through the trauma that we had to endure. My father was admitted to this hospital from 21 Mar - 24 Mar 2013, as his oncologist, a doctor for who we have a lot of respect, consults here.\n\nOn the day of admission, we were informed he needs a PET scan the next day to rule out the recurrence of cancer - however, this ultra modern hospital does not have a PET machine which they conveniently forgot to mention, and so my father - a 67 year old diabetic and cancer patient who had been admitted to the hospital in the first place for treatment of high fever and extreme weakness - was taken to Ganga Ram hospital where there were at least 10 other patients, leading to a very long and tiring wait for my father - on account of this, he was also made to stay on an empty stomach (not even any water) for nearly 10 hours, the procedure finally concluding after 3 PM!\n\nThe same day, we were informed that he needs to undergo an endoscopy and they had fixed an appointment for him for the the next day at 9AM - he was also asked to fast overnight for the endoscopy, and were told it's a very short 5 - 10 minute procedure. He was taken to the endoscopy machine room at 9 AM and my sister who was the attendant was asked to wait outside. She waited for nearly 2 hours - each time she enquired with the department nurse, she was told he was undergoing the procedure.\n\nFinally, at 11 AM my father called my sister and informed her that he was being shuttled from one place to another and the procedure was yet to begin! When my sister confronted the attending staff, they informed her that they were cleaning the machines - can you imagine that they called a 67 year diabetic & cancer patient who could barely sit for a procedure that takes only 5 minutes and made him wait for over 2 hours to clean their machines!\n\nFinally, it emerged that the doctor who was supposed to the procedure, a Dr Vij, had been missing and the cleaning of the machine was just an excuse, with no thought for the poor suffering patient. Finally, the procedure was completed around 12.30 PM when it could have easily been finished by 9 AM  - and on account of the delay my father had also gone without food for over 12 hours for the second consecutive day.\n\nIn between all of this, there were a whole host of tests done on my father, many of which seemed to be un-necessary to us. When we questioned the need for some of the tests - the resident doctor said that anything could be possible and they didn't want to rule anything out - of course anything is possible but the job of a doctor is to pin point the 2-3 areas that are most likely, especially when the patient has been under your observation for over 3 days.\n\nThey would take blood samples from my extremely weak father 2-3 times a day and on the evening on which we expected him to be discharged (Saturday Marrch 23) we were informed that he has low Hb and needs blood transfusion  (He had already been given two units of blood in Feb and his Hb was normal just a day ago as tested at the hospital) - maybe he wouldn't have needed this if the resident doctor was a little less eager to do all possible tests in the world. On account of the 3 hour delay in endoscopy by the hospital and the insistence of the blood transfusion, ours discharge was pushed to the next day.\n\nOn the day of discharge, I noticed that the hospital had overlooked billing for the PET scan. I was foolish enough to bring it to the attention of the billing team - as on account of their oversight we had to spend an additional 4 hours at the hospital as they send revised bills to the insurance company without bothering to explain to them that they had made a mistake in billing.\n\nThe issue finally got resolved after I made numerous calls to the insurance company and demanded that a senior person take charge. I also demanded to meet the MS or the Astt MS, but I was told both were not in hospital. Incidentally, while I was going through this nightmare in billing, another couple were loudly complaining about the ineffectiveness of the hospital.\n\nThe nursing staff in the ward is completely clueless about what is going on and also did not appear very competent  - they kept on moving the canula on my father's arm and a couple of times there was bleeding from the canula that they failed to notice and I had to call them to fix it.\n\nAnd finally, the hospital security - some of the security guards behave like they are bouncers at a pub and the poor harried attendant who is running around from floor to floor on account of the sheer all-round incompetence of the hospital is treated with extreme rudeness for things like daring to forget the attendant pass!\n\nI find nothing, absolutely nothing, to recommend about this hospital - all they have is a fancy building and LOTS of \"staff\" but not one of that staff is either competent or polite.\n\nI repeat, it is better to stay at home and do nothing than go to this hospital, because going to this hospital will make you poorer in health and in bank balance."
    },
    {
      "source": "MouthShut",
      "hospital": "BLK",
      "review": "I went to meet doctor \"Amit Aggarwal BLK Hospital\" in oncology to find an second opinion. I paid 850 rs. for the consultation and I didnt spend more than 5 minutes with him and what I found out was that I met with unprofessional doctor who in 5 minutes spent 3 minutes on phone and computer.\n\nA treatment of cancer was like and commodity for him and I found his response was very poor. before coming out he was indulged in computer and I had to ask him if he is done or should I wait to hear some more, he didnt care to tell me that this is it and I had to leave the room by knowing that he is no more intersted in listening or telling anything"
    },
    {
      "source": "JustDial",
      "hospital": "BLK",
      "location": "BLK-MAX Super Speciality Hospital",
      "review": "Long long long wait subhe 10 bje operation ho gya rat ke 9 bje tak  iccu  me bed nahi mila koi bat krne ko tayar nahi kisi ko kuch pata nahi kisse bat kre"
    },
    {
      "source": "JustDial",
      "hospital": "BLK",
      "location": "BLK-MAX Super Speciality Hospital",
      "review": "My wife had surgery in Blk max doctor is really good and the staff is really really bad like an uneducated people after surgery we went for check up they asked to wait for three hours just to remove dressing that is 5 min job and they are not even talking properly"
    },
    {
      "source": "JustDial",
      "hospital": "BLK",
      "location": "BLK-MAX Super Speciality Hospital",
      "review": "Worst hospital in delhiPls don`t go there my husband admitted with thyphoid fever they have severe pain but they give only drip no doctor come for three days due to weekend  they did citi scan on third day of admission .infection was gone to blood  they put ventilation and then dialysis and then dead .in five days my husband dead because of late treatment. They are doing bussiness .they don`t care patient .Dr r k singhal is the worst doctor if u want to save ur life don`t go bl kapoor hospital"
    },
    {
      "source": "JustDial",
      "hospital": "BLK",
      "location": "BLK-MAX Super Speciality Hospital",
      "review": "Very poor service by radiation dept at BLK MAX. Their machine need repair and maintenance every 2-3 days due to which no proper radiation done within schedule time.they dont care of patient."
    },
    {
      "source": "JustDial",
      "hospital": "BLK",
      "location": "BLK-MAX Super Speciality Hospital",
      "review": "Terrible hospital! Slow response, poor communication, poorly managed. Would not recommend to anyone.Very expensive."
    },
    {
      "source": "JustDial",
      "hospital": "BLK",
      "location": "BLK-MAX Super Speciality Hospital",
      "review": "Their security are too bad they didn`t talk politely with attender  and doctor doesn`t properly visit in wards"
    },
    {
      "source": "JustDial",
      "hospital": "BLK",
      "location": "BLK-MAX Super Speciality Hospital",
      "review": "Very low care at admission three times has been changed our room since 4 pm to 7:30 pm our peceint was having high fiver but at admission they do not care much. Our room was booked 3 times tel times alleot room and cancel why it hepens I don`t understand. I met one hospital stuff Mr. Govind he has helped a lot if he was not kind to me anything can heppened. this is big hussle not really happy. Mr. Arshad at admission is always busy with all peciants I suggest there must be more care. One important think B..."
    },
    {
      "source": "JustDial",
      "hospital": "BLK",
      "location": "BLK-MAX Super Speciality Hospital",
      "review": "A doctor name Jameel manzoor (ent) is misbehave patient never take appointment with this doctor underrated doctor  I had a terrible experience with BLK-MAX Super Speciality Hospital. The management was very poor, and it affected the overall service."
    },
    {
      "source": "JustDial",
      "hospital": "BLK",
      "location": "BLK-MAX Super Speciality Hospital",
      "review": "I had a terrible experience with BLK-MAX Super Speciality Hospital. The hospital was over-priced, and I felt like they were not transparent about their charges. The overall interaction left me feeling dissatisfied and frustrated."
    },
    {
      "source": "JustDial",
      "hospital": "BLK",
      "location": "BLK-MAX Super Speciality Hospital",
      "review": "I had a terrible experience at BLK-MAX Super Speciality Hospital. Accessing the facility is a nightmare, and once inside, the slow response times from staff were frustrating. I endured an excessively long wait, only to find the premises unsanitized. For a hospital that should prioritize patient care, their lack of efficiency and cleanliness is alarming. I do not recommend this hospital!"
    },
    {
      "source": "JustDial",
      "hospital": "BLK",
      "location": "BLK Pest Control",
      "review": "Satisfied with work and rates for the work"
    },
    {
      "source": "JustDial",
      "hospital": "BLK",
      "location": "BLK Pest Control",
      "review": "Good quality  good service for termite small less chemicals"
    },
    {
      "source": "JustDial",
      "hospital": "BLK",
      "location": "BLK Pest Control",
      "review": "Good job blk pest control"
    }
  ],
  "review_count": 79,
  "news": [
    {
      "source": "Brave News",
      "hospital": "BLK",
      "headline": "Blkmaxhospital"
    },
    {
      "source": "Brave News",
      "hospital": "BLK",
      "headline": "Maxhealthcare"
    },
    {
      "source": "Brave News",
      "hospital": "BLK",
      "headline": "Testimonials | BLK Max Hospital"
    },
    {
      "source": "Brave News",
      "hospital": "BLK",
      "headline": "Critical Care Treatment Hospital in Delhi, India | Book Doctor Appointment Online, Video Consultation"
    },
    {
      "source": "Brave News",
      "hospital": "BLK",
      "headline": "BLK-Max Super Specialty Hospital, New Delhi - International patient care in Delhi, India | PNY Healthcare"
    },
    {
      "source": "Brave News",
      "hospital": "BLK",
      "headline": "EWS | BLK-Max Super Speciality Hospital"
    },
    {
      "source": "Brave News",
      "hospital": "BLK",
      "headline": "Book Appointment with BLK-Max Super Speciality Hospital, New Delhi, New Delhi for Cardiac Sciences , Transplant, General & Laparoscopic Surgery, Neuro Sciences, Orthopedics"
    },
    {
      "source": "Brave News",
      "hospital": "BLK",
      "headline": "BLK-Max Hospital | Treatment, Contact Doctor, Book Appointment Online"
    },
    {
      "source": "Brave News",
      "hospital": "BLK",
      "headline": "BLK Super Speciality Hospital | Best Joint Replacement Surgery Hospital in Delhi, India"
    },
    {
      "source": "Brave News",
      "hospital": "BLK",
      "headline": "Community Services | BLK Max Hospital"
    },
    {
      "source": "Brave News",
      "hospital": "BLK",
      "headline": "Vrhhealthcare"
    },
    {
      "source": "Brave News",
      "hospital": "BLK",
      "headline": "BLK Hospital Delhi, BL Kapoor Super Speciality Hospital New Delhi"
    },
    {
      "source": "Brave News",
      "hospital": "BLK",
      "headline": "BLK Super Specialty Hospital in India | Prices, Doctors, Patient Reviews"
    },
    {
      "source": "Brave News",
      "hospital": "BLK",
      "headline": "BLK Super Speciality Hospital in India: Prices for Diagnosis and Treatment, Reviews | MediGlobus"
    },
    {
      "source": "Brave News",
      "hospital": "BLK",
      "headline": "BLK Hospital: Book Appointment online - HBG Medical Assistance"
    },
    {
      "source": "Brave News",
      "hospital": "BLK",
      "headline": "BLK hospital and B L Kapur memorial hospital delhi – We Care India"
    },
    {
      "source": "Brave News",
      "hospital": "BLK",
      "headline": "BLK Hospital in Delhi | Hospital"
    },
    {
      "source": "Brave News",
      "hospital": "BLK",
      "headline": "About Us - BLK Max One of Largest Hospital in Delhi, India"
    },
    {
      "source": "Brave News",
      "hospital": "BLK",
      "headline": "The Top Hospital in India for Cancer Care Treatment: BLK Max Super Speciality Hospital - Medsolin"
    },
    {
      "source": "Brave News",
      "hospital": "BLK",
      "headline": "BLK Hospital - Via Globe Health Cares"
    },
    {
      "source": "Brave News",
      "hospital": "BLK",
      "headline": "BLK Best Hospitals in Delhi|Multi Speciality Hospital |UHHUniversal Health Help"
    },
    {
      "source": "Brave News",
      "hospital": "BLK",
      "headline": "Kidney Transplant Hospital in Delhi, India | Book Doctor Appointment Online, Video Consultation at BLK Max"
    },
    {
      "source": "Brave News",
      "hospital": "BLK",
      "headline": "Our Specialities | Best Hospital in Delhi, India - BLK Max Hospital"
    },
    {
      "source": "Brave News",
      "hospital": "BLK",
      "headline": "BLK-Max Super Speciality Hospital Online OPD Appointment: OPD Schedule & Timings, - AIIMS Registration"
    },
    {
      "source": "Brave News",
      "hospital": "BLK",
      "headline": "How one ER visit changed everything for local youth | Elliot Lake Standard"
    },
    {
      "source": "Brave News",
      "hospital": "BLK",
      "headline": "Contact Us - Best Hospital in Delhi-NCR | BLK Max Hospital"
    },
    {
      "source": "Brave News",
      "hospital": "BLK",
      "headline": "Hospital & Primarcy Care Medical Services | Boulder City"
    },
    {
      "source": "Brave News",
      "hospital": "BLK",
      "headline": "BLK Max Hospital, Delhi - Find Reviews, Cost Estimate and Book Appointment - International Patient Services - Contact Directly here"
    },
    {
      "source": "Brave News",
      "hospital": "BLK",
      "headline": "Blk Patient Portal - Find Official Portal"
    },
    {
      "source": "Brave News",
      "hospital": "BLK",
      "headline": "Terms And Conditions | Max Hospital"
    },
    {
      "source": "Brave News",
      "hospital": "BLK",
      "headline": "Book an Appointment Online With Top Doctors & Surgeons | BLK Max Hospital"
    },
    {
      "source": "Brave News",
      "hospital": "BLK",
      "headline": "BLK Super Speciality Hospital: View Doctor List & Get Appointment"
    },
    {
      "source": "Brave News",
      "hospital": "BLK",
      "headline": "Find Your Doctor By Speciality | BLK-Max Super Speciality Hospital"
    },
    {
      "source": "Brave News",
      "hospital": "BLK",
      "headline": "Patients - BCOM Health"
    },
    {
      "source": "Brave News",
      "hospital": "BLK",
      "headline": "BLK Max Hospital Pricelist - Find Current Rates in Year 2025 - International Patient Services - Contact Directly here"
    },
    {
      "source": "Brave News",
      "hospital": "BLK",
      "headline": "BLK-Max Super Speciality Hospital Online OPD Appointment, Schedule, Contact Number - DoctorsList.in"
    },
    {
      "source": "Brave News",
      "hospital": "BLK",
      "headline": "Brooklands Health Centre - OneMedical Group"
    },
    {
      "source": "Brave News",
      "hospital": "BLK",
      "headline": "Top 5 Doctors in BLK-Max Super Speciality Hospital, Delhi | DocTrePat"
    },
    {
      "source": "Brave News",
      "hospital": "BLK",
      "headline": "Bangkok's Top 10 Best Hospitals Ranked - Clinics on Call"
    },
    {
      "source": "Brave News",
      "hospital": "BLK",
      "headline": "BLK Max Super Speciality – Rajendra Place - Deepam MediTours"
    },
    {
      "source": "Brave News",
      "hospital": "BLK",
      "headline": "BLK Memorial Hospital Prices in India"
    }
  ],
  "news_count": 41,
  "collection_date": "2025-11-20T00:24:03.286682"
}